{
    "title": "10 Ways To Use Zipcast",
    "slug": "10-ways-to-use-zipcast",
    "date": "2011-02-22T01:29:35.000Z",
    "url": "http://blog.500startups.com/?p=1116715049",
    "uri": "http://500.co/2011/02/21/10-ways-to-use-zipcast/",
    "postId": "1116715049",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/02/slideshare-300x81.png"
    ],
    "creator": "",
    "categories": [
        "guest-posts",
        "mentors",
        "mentors",
        "rashmi-sinha",
        "slideshare",
        "web-conferencing",
        "zipcast"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/02/slideshare.png\"><img class=\"alignnone size-medium wp-image-1116715051\" title=\"slideshare\" src=\"/backup/slideshare-300x81-2011-02-21-11-19-29.png\" alt=\"\" width=\"300\" height=\"81\" /></a>\n\n<em>SlideShare recently announced <a href=\"http://blog.slideshare.net/2011/02/16/announcing-zipcast-changing-the-way-the-world-conducts-web-meetings/\" target=\"_blank\">Zipcast</a>, a new social web conferencing system that is entirely browser-based.  We've reblogged these tips on how to use Zipcast <a href=\"http://blog.slideshare.net/2011/02/17/10-ways-to-use-zipcast/  \" target=\"_blank\">(original post</a>). SlideShare co-founder and CEO <a href=\"http://twitter.com/#!/rashmi\" target=\"_blank\">Rashmi Sinha</a> is a venture advisor and mentor for 500 Startups, as well as a 500 founder. We hope you find these Zipcast tips useful and start trying it out! Already 500 Startups has used it for one of our accelerator talks.</em>\n\nYesterday, we launched Zipcast – a fast, simple and social way to host web meetings. Everyone with a SlideShare account can host a Zipcast, or check into Zipcasts that others are hosting.\n\nHere are our 10 favorite ways to use Zipcasts. We are sure you will think of a million other ways to use Zipcasts.\n\n<strong>1.  Share ideas with colleagues: </strong>You want to share an idea with colleagues e.g., you want to share product specs with remote colleagues. Or you want to just share a presentation that you saw on SlideShare e.g., Mary Meekers’s latest <a href=\"http://www.slideshare.net/kleinerperkins/kpcb-top-10-mobile-trends-feb-2011\">mobile projections</a>. Just start up a private Zipcast and invite your colleagues by giving them the link over IM.\n<strong> </strong>\n\n<strong>2. Launch your next product using Zipcast: </strong>You are a startup with no marketing budget – but you know how to build buzz on Twitter and Facebook. Start a Zipcast (or informal webinar) about your technology that will change the world. Ask friends, users, anyone you can to join in using Facebook and soon you will have a gathering that is growing virally.\n<strong> </strong>\n\n<strong>3. Give a remote talk at a conference: </strong>You have been invited to Australia but don’t have 5 days to make the trip. We know you want to visit Melbourne, but sometimes, you just can’t make it. But you can sit at your desk, or even on your couch, and do the talk (make sure to ask the conference to project you on a large screen).\n<strong> </strong>\n\n<strong>4. Teach anyone, anywhere: </strong>Are you a professor and want to do a lecture remotely to your students while travelling?<strong> </strong>Zipcast can let you engage your students without cost or complexity. Plus, your students already have Facebook logins.\n<strong> </strong>\n\n<strong>5.  Pitch a client: </strong>Are you a design, marketing firm and want to pitch a potential client on a project proposal? Invite the client team to your meeting room and present your idea to them. Invite your whole team on your end, so that the client does not just get to hear the proposal, but meets the people who will work on it via video.\n<strong> </strong>\n\n<strong>6. Walk people over your sales deck – build trust by using video: </strong>You are a sales person looking to walk a prospect over your sales deck. Give them a link to your Zipcast room and get straight to pitching (don’t waste time downloading the meeting software).\n<strong></strong>\n\n<strong>7. Support your customers: </strong>While on the phone, simply give your customers the link to your meeting room and talk them through the problem. Show them presentations, or drop links to documents or videos on SlideShare in the Zipcast chat. Consider keeping your meeting room open during support hours for customers to join in.\n<strong></strong>\n\n<strong>8. Run a non-profit fund raiser using Zipcast: </strong>You are a non-profit looking to raise funds for the next year. You have already put your pitch deck on SlideShare. Next time you are on the phone with a potential donor, invite them to your SlideShare meeting room. Walk them over your deck.<strong> </strong>\n<strong></strong>\n\n<strong>9. Share your trip photo album with your friends: </strong>You went on vacation to Italy and took a lot of pictures of historical buildings. Now you want to share with your friend who is interested in architecture. Start a Zipcast to share and discuss these pictures with your friend.\n\n<strong></strong>\n\n<strong>10. Do PowerPoint Karoake with your friends: </strong>Zipcast is not just all work. It can be used for fun things like PowerPoint Karaoke when you choose a random presentation and someone who has never seen that deck before presents it. It can be a fun way to spend an evening. Imagine your friends improvising through the deck that Colin Powell used to justify the Iraq war!\nWith Zipcast, you can choose a random slide deck on SlideShare and have your friend present to it. Then it’s your turn and they get to choose the slide deck!\n\nWe can’t wait to see what you will do with Zipcasts. Leave comments about how you are using it.\n\nGo to the Zipcast page to check out <a href=\"http://www.slideshare.net/zipcast\">current Zipcasts</a> or press the Zipcast button on any SlideShare presentation to get started.",
    "type": "post",
    "path": "/2011/02/21/10-ways-to-use-zipcast/"
}