{
    "title": "100 Billion Reasons to Build (Kick Ass) Solutions for the Events Industry",
    "slug": "100-billion-reasons-to-build-kick-ass-solutions-for-the-events-industry",
    "date": "2010-11-17T01:43:05.000Z",
    "url": "http://blog.500startups.com/?p=1116714498",
    "uri": "http://500.co/2010/11/16/100-billion-reasons-to-build-kick-ass-solutions-for-the-events-industry/",
    "postId": "1116714498",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "christen-obrien",
        "conferences",
        "events",
        "events",
        "meetups",
        "smash-summit",
        "warm-gun"
    ],
    "content": "<em>Please welcome <strong>Christen O'Brien</strong> to 500 Startups! Christen recently joined the 500 team as Director of Events. You may recognize her work in recent 500 events such as <a href=\"http://warmgun.com/\" target=\"_blank\">Warm Gun</a> and <a href=\"http://smashsummit.com/\" target=\"_blank\">SMASH Summit</a>. Look for an exciting 2011 filled with equally awesome events.</em>\n\nWhy is it that I spend valuable time doing things for our conferences and events that really should be addressed by technology?\n\nHere's why: <strong>Because current technology for events sucks. B</strong><strong>adly.</strong>\n\n<strong></strong>I've been producing events for over ten years and am sad to say that there is still a huge deficit in event technology and I bet that most event producers will tell you the same. Sure, there are a few solutions here and there that work well or at least address basic needs. But I have yet to come across anything that has really understood our market, our frustrations, and our needs.\n\nAnd the thing is, our market is HUGE. People will often remark that they never knew \"conference production\" was an actual industry. Well, wake up and smell the market potential! Worldwide, events and conferences represent a <strong>$100+ billion </strong>industry with annual growth of<strong> 5.5%</strong> and some international annual growth rates touching <strong>20%</strong>.\n\nSo what are the biggest pain points for event producers like me that need to be addressed? The top 3 on my mind are:\n\n<strong>1. A Single-Source Solution:</strong>\nCurrently, most event organizers will tell you they use tools like Eventbrite for registration, their inbox for customer service, Constant Contact for email blasts, Salesforce for CRM, WordPress for event websites,  Dropbox for collecting slide decks, SlideShare for sharing slide decks, Facebook and Twitter for social media marketing, a hodgepodge of online event calendars for competitor research, Ustream for live streaming... you get the picture.\n\nIt's hellish to manage each of these platforms, and <strong>very few of these services work together.</strong>\n\nThere is a HUGE need for someone to create 1 main platform that integrates each of these individual platforms and eliminates the frustration of multiple log-ins, multiple updates, etc. Yes, it would be easier if one company could just do it all but I personally would rather choose my individual platforms because , well, I like the \"Slideshares\" of the world and I doubt \"MegaCorp\" could really create something better and constantly iterate.  So my wishlist is 1 platform that can tie together all my current platforms, provide important data culled from each service, maintain a consistent UI/UX across them, allow for cross-service updates and distribution, etc.\n\n<strong>2. Social Apps:</strong>\nThe whole point of using social media is the power of viral, right? However, the events industry hasn't yet figured out how to tap into this and, to its chagrin, there are few good solutions out there - at least not that I'm aware of (and if I don't know about it and it exists, there's a huge marketing issue there).\n\nRecently, I came across a company that's creating an app that offers conference discounts based on 'sharing' a current discount with your network of friends. The funny thing is, I've been trying to figure out how to do this for years - i.e. how can I get my user base motivated to share this event with their network of contacts? Of course with any marketing technology there's a risk there of becoming 'that annoying conference' so the strategy needs to be carefully considered, but I'm going to try the product on our next conference and see how it works.\n\nIt would also be cool to use social networks to do things like create conference topics and agendas, or vote on keynotes, speakers, and sponsors. There's really so many ways that incorporating social into event production could be extremely powerful - and <strong>extremely profitable</strong>.\n\n<strong>3. Event Calendars:</strong>\nThis is probably one of the most frustrating areas for event producers - trying to figure out when the gazillions of other events are so you can 1) avoid those dates for your own events, and 2) stay tapped in to what your 'competitors' are doing. For 10 years, I've watched event producers cull industry calendars and event websites to create massive Excel spreadsheets that they use to track and plan events. It takes hours upon hours and requires continuous manual upkeep.\n\nUm, hello 1999.\n\nI haven't really seen anything that directly addresses this problem. The best tool I've seen so far is <a href=\"http://plancast.com\" target=\"_blank\">Plancast</a>. Even though it's intended for event attendees, event producers use it not only as a marketing tool but also as an industry calendar. However, it still needs a lot of work and could probably offer a premium (paid) version to event producers if it addressed needs like sorting capabilities, customizable views/export features, integration with Outlook/G-cal/other calendars,  and pulled in other event calendars (i.e. offered an all-in-one solution so we don’t have to hop between industry calendars).\n\nIn conclusion: There are so many more products that event producers would pay for and areas of technology within the events industry that seriously need love. If you know about some kick-ass tools/services/software or would like any feedback on something you're working on, <a href=\"mailto:christen@500startups.com\">ping me</a>. I cant tell you how much I would LOVE to see some innovation in the events space.",
    "type": "post",
    "path": "/2010/11/16/100-billion-reasons-to-build-kick-ass-solutions-for-the-events-industry/"
}