{
    "title": "3 Dumb Reasons Why Startups Aren't Translating Their Services into Arabic",
    "slug": "3-dumb-reasons-why-startups-arent-translating-their-services-into-arabic",
    "date": "2013-07-11T16:37:15.000Z",
    "url": "http://500.co/?p=1116728343",
    "uri": "http://500.co/2013/07/11/3-dumb-reasons-why-startups-arent-translating-their-services-into-arabic/",
    "postId": "1116728343",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/07/arabicipad.jpg",
        "https://lh5.googleusercontent.com/6O_FNygrYYtoSkybgC3OMBO2BAaEzBMB6vwPdN195OiONMASCRnMCGdjbgLsaIc4rcVGIj2i2J6c3dA7pnNe-9m8rKFRsafjXHLNFbGtZpAoFfL1idLa5_RZ",
        "http://500.co/wp-content/uploads/2013/07/usa-vs-world-1024x687.png",
        "http://500.co/wp-content/uploads/2013/07/dubai-1024x639.jpeg"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "arabic",
        "dakwak",
        "emea",
        "guest-posts",
        "middle-east",
        "startups"
    ],
    "content": "<p dir=\"ltr\"><em>The following post was contributed by <a href=\"http://twitter.com/hanimorrar\" target=\"_blank\">Hani Morrar</a>, Biz Dev Manager at <a href=\"http://twitter.com/dakwak\" target=\"_blank\">Dakwak</a>. Hani started his career in Amman, Jordan doing sales, marketing and lead generation. He moved to Dubai in 2011 to work as a Marketing Project Manager at <a href=\"http://tcf-me.com/\">The Content Factory</a>, and one year later returned to Jordan to work with <a href=\"http://cashu.com/\">cashU</a>, the leading prepaid online payment gateway in the MENA region. Last year, Hani joined <a href=\"http://dakwak.com/\">Dakwak</a> and recently came to Mountain View for 500's accelerator program.</em></p>\n<p dir=\"ltr\">سأل الممكن المستحيل : أين تقيم ؟ فأجابه في أحلام العاجز</p>\n<p dir=\"ltr\">Translation: The \"Possible\" asked the \"Impossible\": where do you live? and it answered, \"In the dreams of the quitter.\"</p>\n<p dir=\"ltr\">If you ask any startup founder what they mean when they say “global,” you’ll usually get a pretty disappointing answer. To many, “global” means they’re targeting Europe, Latin America, Japan and maybe China and India. But you’ll rarely – if ever – hear countries like Saudi Arabia, Qatar or Jordan included in the mix. Even most startups that throw around the terms “EMEA” or “MENA” spend little to no time going after the Middle East.</p>\n<p dir=\"ltr\">It’s time to end that. Even though the Arab world is home to more than 60 million smartphone users and 90 million people on the internet, Arabic is widely regarded as the most underserved language on the internet, and less than 1% of all apps are available Arabic. Talk about a BIG ASS missed opportunity.</p>\n<p dir=\"ltr\">I’m from Jordan, so I know this market is already huge and will grow to ridiculous proportions in the future. We were excited about joining an accelerator program that’s invested in companies like <a href=\"http://jo.jeeran.com/en/amman/#connect\">Jeeran</a>, <a href=\"http://www.angel.co/tamatem\">Tamatem</a> and of course, my company <a href=\"http://www.dakwak.com\">Dakwak</a>. We’re one of the first Middle Eastern companies to work out of 500’s office in Mountain View.</p>\n<a href=\"/backup/arabicipad-2013-07-11-13-11-37.jpg\"><img class=\"alignleft  wp-image-1116728347\" alt=\"arabicipad\" src=\"/backup/arabicipad-2013-07-11-13-11-37.jpg\" width=\"645\" height=\"484\" /></a>\n<p dir=\"ltr\">But given the opportunities in market, why do so many companies have such an aversion to translating their services and properly marketing to this region? Why miss out on making a hell of a lot more money?</p>\n<p dir=\"ltr\"><strong>Dated (and Wrong) Perceptions</strong></p>\n<p dir=\"ltr\">Though the facts above state otherwise, many people still have completely false ideas of what life is like in the Modern Arab world. People use the internet. They go on Facebook. And they use apps, websites and almost everything else people use in the United States. Most of them have never ridden a camel, and many Arabs spend just as much time browsing silly internet websites as you do.</p>\n<p dir=\"ltr\"><img alt=\"\" src=\"https://lh5.googleusercontent.com/6O_FNygrYYtoSkybgC3OMBO2BAaEzBMB6vwPdN195OiONMASCRnMCGdjbgLsaIc4rcVGIj2i2J6c3dA7pnNe-9m8rKFRsafjXHLNFbGtZpAoFfL1idLa5_RZ\" width=\"609px;\" height=\"440px;\" /></p>\n<p dir=\"ltr\">Despite what many think, there’s a growing Arab middle class with money to spend – Arabic speakers have the fastest growing online GDP in the world, and their overall online GDP is ranked 11th. This means they’re not browsing the internet – they’re comfortable whipping their wallets out and spending cash online.</p>\n<strong> People think English is Enough</strong>\n\n“English is the language of business!” NO, it’s not, at least not everywhere. While past generations in the Arab world were comfortable using English or French – mostly because that’s all they had – the current generation expects to consume information online in Arabic. Young people in the Arab world are hungry release for services and apps in their language – not English.\n\n<a href=\"http://500.co/wp-content/uploads/2013/07/usa-vs-world.png\"><img class=\"alignleft  wp-image-1116728353\" alt=\"usa vs world\" src=\"/backup/usa-vs-world-1024x687-2013-07-11-13-11-37.png\" width=\"645\" height=\"433\" /></a>\n<p dir=\"ltr\">Startups seem to think that having a great product is all that matters. Newsflash: people are more likely to trust a service (and spend money on it) when it’s been tailored to their market. According to recent research, 85% of consumers are more likely to buy a product with information in their native language. Sure, not all your collateral needs to be in Arabic, but you should have enough of your site or app translated to get users to sign up.</p>\n<p dir=\"ltr\"><strong>Confusion about Arabic</strong></p>\n<p dir=\"ltr\">Getting your site or app translated into Arabic may seem extremely daunting at first, especially since the script is completely indecipherable to someone who’s only used the western alphabet. Another complication is the fact that MSA (modern standard Arabic) is actually very different from the <a href=\"http://en.wikipedia.org/wiki/Varieties_of_Arabic\">dialects people speak in various Arab countries.</a></p>\n<p dir=\"ltr\">While this may intimidate you more about translating your site, having an MSA version is 1000% better than only having European languages. Services like Google Translate and <a href=\"https://dakwak.com/home\">Dakwak</a> have made it very easy to do basic localization without extra staff. If more localization is needed, you can always do it later with the help of a translator or crowdsourcing. Having a basic MSA translation of your product is the first step to getting way more customers and actually being global.</p>\n<p dir=\"ltr\"><a href=\"http://500.co/wp-content/uploads/2013/07/dubai.jpeg\"><img class=\"alignleft  wp-image-1116728355\" alt=\"dubai\" src=\"/backup/dubai-1024x639-2013-07-11-13-11-37.jpeg\" width=\"574\" height=\"358\" /></a></p>\n<p dir=\"ltr\"><em>Think this futuristic skyline belongs to Tokyo? NYC? Shanghai? NOPE. Dubai. </em></p>\n<p dir=\"ltr\">It’s shocking how few businesses are going after the Arab market. Only 5% of Fortune 500 companies and – based on casual observation, a handful of western entrepreneurs – focus even a minimal amount of energy on selling to people who want services, apps and products in Arabic. If you’re a startup, you probably have first mover advantage in the Middle East. SEIZE IT.</p>",
    "type": "post",
    "path": "/2013/07/11/3-dumb-reasons-why-startups-arent-translating-their-services-into-arabic/",
    "backgroundImage": "/backup/ArabWorld-960x540-2013-07-11-13-11-37.png"
}