{
    "title": "4 Marketing Channels You’re Not Using (But Should Be)",
    "slug": "4-marketing-channels-youre-not-using-but-should-be",
    "date": "2013-09-26T16:26:53.000Z",
    "url": "http://500.co/?p=1116729771",
    "uri": "http://500.co/2013/09/26/4-marketing-channels-youre-not-using-but-should-be/",
    "postId": "1116729771",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/09/nicki.gif",
        "http://500.co/wp-content/uploads/2013/09/bored.gif",
        "http://500.co/wp-content/uploads/2013/09/Screen-Shot-2013-09-26-at-10.19.30-AM.png",
        "http://500.co/wp-content/uploads/2013/09/Screen-Shot-2013-09-26-at-10.46.37-AM1.png",
        "http://500.co/wp-content/uploads/2013/09/rupaul.gif"
    ],
    "creator": "",
    "categories": [
        "distribution",
        "distribution",
        "forums",
        "hubspot",
        "linkedin",
        "marketing",
        "podcasting",
        "quora",
        "webinars"
    ],
    "content": "<p dir=\"ltr\">If you’re a startup, chances are your company already has its own Facebook page, Twitter handle, Pinterest page and maybe even a company blog. But if you’re putting work into creating original content, you really need to be on as many marketing channels as possible to drive traffic to your site. The thought of using LinkedIn forums, webinars and podcasts might put you to sleep, but if you’re a startup, you NEED to go after customers wherever they are.</p>\n<p dir=\"ltr\">Here are a few useful places for distributing content that you might be neglecting….</p>\n<p dir=\"ltr\"><strong>Podcasts</strong></p>\n<p dir=\"ltr\">“Podcasts are dead. Does anyone even listen to them?” That’s what 500 Partner <a href=\"http://twitter.com/christine_tsai\">Christine Tsai</a> told me when I first suggested recording founder interviews. She gave me the go-ahead to produce a <a href=\"https://itunes.apple.com/us/podcast/startup-founders-podcast/id631210870\">500 Startups show,</a> but I could tell she was skeptical (and maybe even laughing at me behind my back). 50k+ downloads later, who’s laughing now?</p>\n<p dir=\"ltr\"><a href=\"/backup/nicki-2013-09-26-13-11-26.gif\"><img class=\"aligncenter size-full wp-image-1116729777\" alt=\"nicki\" src=\"/backup/nicki-2013-09-26-13-11-26.gif\" width=\"500\" height=\"200\" /></a></p>\n<p dir=\"ltr\"><span style=\"color: #333333;\">(Jk Christine, I’d never give you the side eye).</span></p>\n<p dir=\"ltr\">Honestly though, podcasts do seem like kind of a lame channel to most people. Why? Well, they’re not as flashy as Facebook, require you to listen the sound of your own voice (hell!) every week, and most people have no clue how to get started. Remember: 99.9% of people in office jobs get BORED during the day. Take advantage of that and give them something to listen to while they work!</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"/backup/bored-2013-09-26-13-11-26.gif\"><img class=\"wp-image-1116729785 aligncenter\" alt=\"bored\" src=\"/backup/bored-2013-09-26-13-11-26.gif\" width=\"403\" height=\"403\" /></a></p>\n<p dir=\"ltr\">A regular podcast is a great opportunity for you to show that you’re an expert at something. Does your company make an app about health? Do a weekly 15-minute show with fitness tips and nutrition news. Do you run a B2B, IT-focused startup? Record “This week in IT” and become the company that CTO's – i.e., people who will actually buy your product – go to for news, info and reviews.</p>\n<p dir=\"ltr\">Once you become an expert, people will feel a look more comfortable spending $$$ on whatever it is you’re selling.</p>\n<p dir=\"ltr\"><em>Ideal for: Pretty much anyone – just make sure you have good mics, an interesting topic, and someone with a decent voice.</em></p>\n<p dir=\"ltr\"><strong>Quora</strong></p>\n<p dir=\"ltr\">We all waste time reading dumb stuff on Quora. Whether it’s a post about <a href=\"http://www.quora.com/McDonalds-fast-food-chain/What-elements-contribute-to-making-McDonalds-french-fries-taste-good\">McDonald’s french fries</a> or <a href=\"http://www.quora.com/Apple-Inc-2/What-is-the-internal-culture-like-at-Apple\">what it’s like working at Apple</a>, it’s easy to lose 20 minutes minutes reading user-submitted answers on all different types of topics.</p>\n<p dir=\"ltr\">What you may not realize is that A LOT of the content on Quora is just marketing in disguise. And thanks to the “post anonymously” feature, sometimes it’s very, very sneaky marketing. I’m certain that big companies post questions like “How would you compare product x vs. product y,” in hopes of getting good reviews for their latest gadget.</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"/backup/Screen-Shot-2013-09-26-at-10-19-30-AM-2013-09-26-13-11-26.png\"><img class=\"aligncenter size-full wp-image-1116729783\" style=\"border: 1px solid black;\" alt=\"Screen Shot 2013-09-26 at 10.19.30 AM\" src=\"/backup/Screen-Shot-2013-09-26-at-10-19-30-AM-2013-09-26-13-11-26.png\" width=\"604\" height=\"521\" /></a></p>\n<p dir=\"ltr\">If you want to be less stealthy, you can ask marketing or product people at your company to answer questions about your product, industry, or even specific vertical markets that you’re targeting. For example, if your software startup wants to make a big push in the health sector, you could have your team answer questions about regulations and compliance issues that affect doctors. Quora is also a great tool for answering questions about product features or your company’s culture.</p>\n<p dir=\"ltr\"><em>Ideal for: B2B startups, recruiting</em></p>\n<p dir=\"ltr\"><strong>LinkedIn Groups</strong></p>\n<p dir=\"ltr\">Many LinkedIn groups are like a networking event held at a creepy dive bar where everyone in attendance is a used-car salesman. Shady as they are, some of the niche groups are a great place for you to find high-level marketing, sales, and tech people at large companies. In other words, the people who will actually decide whether or not a business purchases your product.</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"/backup/Screen-Shot-2013-09-26-at-10-46-37-AM1-2013-09-26-13-11-26.png\"><img class=\"aligncenter size-full wp-image-1116729789\" style=\"border: 1px solid black;\" alt=\"Screen Shot 2013-09-26 at 10.46.37 AM\" src=\"/backup/Screen-Shot-2013-09-26-at-10-46-37-AM1-2013-09-26-13-11-26.png\" width=\"630\" height=\"371\" /></a></p>\n<p dir=\"ltr\">Spend some time looking for groups that are important to your industry, then feed the members useful content. Post stuff like Ebooks, stats, articles and blog posts that will people do their job better. After posting regularly for a month or so, reach out to group members who are your ideal customers and ask them to try your product. Just don’t be creepy about it.</p>\n<p dir=\"ltr\"><em>Ideal for: B2B startups, vertical marketing</em></p>\n<p dir=\"ltr\"><strong>Webinars</strong></p>\n<p dir=\"ltr\">Having trouble sleeping at night? Just say the word “webinar” to yourself ten times – I guarantee you’ll pass out pretty quickly. Yeah, webinars aren't exactly known for being exciting, but that doesn’t mean they’re not effective. All you have to do is look at a company like Hubspot – <a href=\"http://www.hubspot.com/blog/bid/23564/HubSpot-Breaks-World-Record-For-Largest-Webinar\">the king of webinars</a> – to see why. They constantly host useful marketing webinars that generate a TON of leads.</p>\n<p dir=\"ltr\">There’s 1 BIG reason Hubspot’s so great at it: 99% of their webinars AREN’T about Hubspot at all – they’re about making you better at marketing or sales. If you want a quick primer on how to host an effective webinar, just <a href=\"https://app.hubspot.com/library/webinar\" target=\"_blank\">sign up for a few of theirs</a> to see how they do it.</p>\n<p dir=\"ltr\"><a href=\"/backup/rupaul-2013-09-26-13-11-26.gif\"><img class=\"aligncenter size-full wp-image-1116729775\" alt=\"rupaul\" src=\"/backup/rupaul-2013-09-26-13-11-26.gif\" width=\"500\" height=\"370\" /></a></p>\n<p dir=\"ltr\">Even if you aren’t a B2B company, webinars for user training and engagement are a fantastic way to keep your customers excited and buying more. Having an “expert tips”  series is also a great strategy for figuring out who your biggest evangelists are, too. Make them feel special, and they’ll tell all their friends about how great your product is.</p>\n<p dir=\"ltr\"><em>Ideal for: B2B startups, content marketing, vertical marketing, finding (and cultivating) your “power users”</em></p>\n<p dir=\"ltr\">I’ll go into more detail about using each of these marketing channels (and more) in the near future, so check back for blog posts with step-by-step tips and instructions. For now, think about how your company can use less popular channels like the ones above to get more leads, engagement, users and MONEY!</p>\n<p dir=\"ltr\"><strong>What’s a marketing channel that you think more startups should use? Post a comment below or tell me on <a href=\"http://twitter.com/markjsaldana\">Twitter</a>.</strong></p>",
    "type": "post",
    "path": "/2013/09/26/4-marketing-channels-youre-not-using-but-should-be/",
    "backgroundImage": "/backup/wonka-960x540-2013-09-26-13-11-26.jpg"
}