{
    "title": "4 MORE Marketing Channels You're Not Using (But Should Be)",
    "slug": "4-more-marketing-channels-youre-not-using-but-should-be",
    "date": "2013-10-08T16:19:31.000Z",
    "url": "http://500.co/?p=1116729885",
    "uri": "http://500.co/2013/10/08/4-more-marketing-channels-youre-not-using-but-should-be/",
    "postId": "1116729885",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/10/slideshare.png",
        "http://500.co/wp-content/uploads/2013/10/Screen-Shot-2013-10-08-at-11.12.38-AM.png",
        "http://500.co/wp-content/uploads/2013/10/googleauthorship.jpg"
    ],
    "creator": "",
    "categories": [
        "distribution",
        "distribution",
        "google-plus",
        "instagram",
        "marketing",
        "reddit",
        "slideshare",
        "startups",
        "tips",
        "video",
        "vine"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em>\n<p dir=\"ltr\">A few weeks ago, <a href=\"http://500.co/2013/09/26/4-marketing-channels-youre-not-using-but-should-be/\">I wrote about 4 marketing channels</a> you might be neglecting at your startup. Here are a few more of places where you might find your customers:</p>\n\n<h2 dir=\"ltr\">Instagram video/Vine</h2>\n<p dir=\"ltr\">You probably think Vine is for people who are trying way too hard to be funny. You’re right, but it’s also a great face for you teach people about your startup! A lot of big brands are doing fancy stuff on these channels, thanks to the fact that they have a TON of money. Check this out:</p>\n<iframe src=\"https://vine.co/v/h1aErXDwA1l/embed/postcard\" height=\"600\" width=\"600\" frameborder=\"0\"></iframe><script charset=\"utf-8\" type=\"text/javascript\" src=\"//platform.vine.co/static/scripts/embed.js\" async=\"\"></script>\n\nSince you probably don’t have the budget for a zero-gravity Vine flight, you’ll probably have to be a little more creative. Check out what we did at 500 HQ with 10 bucks worth of school supplies:\n\n<iframe src=\"//instagram.com/p/bj9VNljfyi/embed/\" height=\"710\" width=\"612\" frameborder=\"0\" scrolling=\"no\"></iframe>\n\nShort videos are GREAT for teaching someone how to do something. Does your startup focus on healthy eating or dieting? Do 6-second recipes on Vine, or give super quick dieting tips. Do you help startups with SEO? Give quick SEO hacks and tips! You don’t even need to put someone in front of the camera – just use a whiteboard or paper like we did in our distribution tip video.\n<p dir=\"ltr\">There are some important differences between Vine and Instagram, so read up on them before you decide to use one or the other. <a href=\"http://techcrunch.com/2013/06/20/instagram-video-vs-vine-whats-the-difference/\">Here’s a great guide from TechCrunch.</a></p>\n<p dir=\"ltr\">In general, Vine LOOKS better, but there are more people on Instagram. If you’re using one or the other for live events, I’d suggest going with Vine – when you tweet a link, a preview will show up on Twitter. With Instagram, someone will have to click through to watch the video (not good).</p>\n<p dir=\"ltr\">Also, be sure to research what hashtags your audience is using. For us, tags like #siliconvalley, #tech, #startups, and #design get us more followers and likes.</p>\n<p dir=\"ltr\">People LOVE tips and hacks, so take advantage of that with short-form online video!</p>\n\n<h2 dir=\"ltr\">SlideShare</h2>\n<p dir=\"ltr\">PowerPoint presentations are usually the last thing that comes to mind when you think about marketing. But they really are a great – and unexpected – way to make an idea from your company go viral. Don’t believe me? Netflix’s culture deck has more than 5 MILLION views on slideshare.</p>\n<iframe style=\"border: 1px solid #CCC; border-width: 1px 1px 0; margin-bottom: 5px;\" src=\"http://www.slideshare.net/slideshow/embed_code/1798664?rel=0\" height=\"356\" width=\"427\" allowfullscreen=\"\" frameborder=\"0\" marginwidth=\"0\" marginheight=\"0\" scrolling=\"no\"></iframe>\n<div style=\"margin-bottom: 5px;\"><strong> <a title=\"Culture\" href=\"https://www.slideshare.net/reed2001/culture-1798664\" target=\"_blank\">Culture</a> </strong> from <strong><a href=\"http://www.slideshare.net/reed2001\" target=\"_blank\">Reed Hastings</a></strong></div>\nDo you want to position someone at your company as a thought leader? Get them to put together a deck about the core problem your startup is solving with interesting stats and insights about the market. Have tips or lessons to share about running a startup? Make it into a deck and share it! If you ever present at a conference, take 5 seconds to upload your deck to SlideShare and tweet it out. Don’t be ashamed to pimp out your content on every channel imaginable.\n<p dir=\"ltr\">One fantastic thing about this channel – SlideShare links are viewable right on Twitter as an embedded presentation.</p>\n<p style=\"text-align: center;\"><a href=\"/backup/slideshare-2013-10-08-13-11-19.png\"><img class=\"aligncenter size-full wp-image-1116729897\" alt=\"slideshare\" src=\"/backup/slideshare-2013-10-08-13-11-19.png\" width=\"494\" height=\"615\" /></a></p>\nThis is a feature we always use during demo days and conferences, and lots of the decks on our SlideShare channel have upwards of 10K views (one even has 100K).\n<h2 dir=\"ltr\">Reddit</h2>\n<p dir=\"ltr\">Redditors can be a tough crowd. They can smell marketing from a mile away, and many people learn the hard way that you can’t just spam subreddits with your content without really pissing people off.</p>\n<p dir=\"ltr\">So, what do you do? Pay for ads. They’re really cheap, and I’ve heard success stories from more than a few startups about getting new users through Reddit ad units. They sit right at the top of the page, and people can upvote and downvote them like other content on the site.</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"/backup/Screen-Shot-2013-10-08-at-11-12-38-AM-2013-10-08-13-11-19.png\"><img class=\"aligncenter size-full wp-image-1116729891\" alt=\"Screen Shot 2013-10-08 at 11.12.38 AM\" src=\"/backup/Screen-Shot-2013-10-08-at-11-12-38-AM-2013-10-08-13-11-19.png\" width=\"802\" height=\"297\" /></a></p>\n<p dir=\"ltr\">Test out lots of different subreddits related to your startup and see what sticks. I heard from one startup that <a href=\"http://www.reddit.com/r/atheism/\">r/atheism</a> was the best performing channel for one of their ads, and their startup has absolutely nothing to do with philosophy or religion.</p>\n<p dir=\"ltr\">Just exercise more restraint here than you would on other channels; Reddit users aren’t fun to deal with when they’re angry. Don’t make a sales pitch – teach them something new or show them why your product is cool.</p>\n\n<h2 dir=\"ltr\">Google Plus</h2>\n<p dir=\"ltr\">Yeah, Google Plus is the lamest dude at the party that no one wants to talk to. That’s OK. While you’ll never go viral here, it’s a great place to build links and help make your content easier to find on the web.</p>\n<p dir=\"ltr\">There are <a href=\"http://moz.com/blog/google-plus-correlations\">different opinions about how this channel affects SEO</a>, but what isn’t up for debate is that link-building anywhere helps your ranking in search results. Google Plus is a great place to do that.</p>\n<p dir=\"ltr\">Google Plus is also a great way to make your blog’s content look much better in search results. By verifying your email with your G+ profile, your photo will show up along with a bio whenever someone finds something you’ve created. Like this:</p>\n<p dir=\"ltr\"><a href=\"/backup/googleauthorship-2013-10-08-13-11-19.jpg\"><img alt=\"googleauthorship\" src=\"/backup/googleauthorship-2013-10-08-13-11-19.jpg\" width=\"592\" height=\"339\" /></a></p>\n<p dir=\"ltr\">It’s a little tricky to set up, but <a href=\"http://blog.kissmetrics.com/google-authorship/\">KISSmetrics has a nifty guide on how to do it</a>.</p>\n<p dir=\"ltr\">As with all of your marketing, focus on what works and TEST TEST TEST. Are there any marketing channels I missed that you think startups are stupid for not using? Tell me about them below!</p>\nNext week, I’ll have even more marketing tips for you, so stay tuned!",
    "type": "post",
    "path": "/2013/10/08/4-more-marketing-channels-youre-not-using-but-should-be/",
    "backgroundImage": "/backup/gramz-960x540-2013-10-08-13-11-19.jpg"
}