{
    "title": "5 Distribution Experiments You Can Do For $10 Or Less",
    "slug": "5-distro-experiments-you-can-do-on-10-or-less",
    "date": "2014-03-13T16:30:27.000Z",
    "url": "http://500.co/?p=1116731835",
    "uri": "http://500.co/2014/03/13/5-distro-experiments-you-can-do-on-10-or-less/",
    "postId": "1116731835",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "distribution",
        "distribution",
        "email",
        "facebook",
        "growth",
        "marketing",
        "tips"
    ],
    "content": "<em>This is part of our Distribution series, presenting actionable material your startup can use today. Get more marketing tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to <a title=\"Join the Distrosnack newsletter\" href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">Distrosnack</a>, our daily email with bite-sized tips to grow your startup's reach.\n</em>\n<p dir=\"ltr\">Last week, I wrote about about the <a href=\"http://500.co/2014/03/03/the-whatsapp-effect/\">Whatsapp Fallacy</a>, and why zero distribution will not work for 99.9% of companies out there, including yours.</p>\n<p dir=\"ltr\">One of the common reasons / excuses I hear from companies as to why they’re not focused on distribution experiments has to do with the fact that founders think they need a large budget to have meaningful results.</p>\n<p dir=\"ltr\">We get it. It’s understandable not to want to blow through precious seed dollars with haphazard distro experiments. Don’t do that!</p>\n<p dir=\"ltr\">But just because you’re on a budget (who isn’t) doesn’t mean you should put off distro experiments until you raise a lot of funds. If you wait that long, you might not be able to raise.</p>\n<p dir=\"ltr\">Successful experiments can net you results that you can use as a stepping stone to run more segmented experiments, and/or funnel back into product development. The point is to start gathering data immediately.</p>\n<p dir=\"ltr\">Just like the lean startup methodology, we’re going to launch our ads early (build), read results (measure), and focus on expanding the signals of success (learn).</p>\n&nbsp;\n<h2 dir=\"ltr\">“We don’t know what we’re doing and don’t want to waste money.”</h2>\n<p dir=\"ltr\">This is valid. Most companies starting out don’t have a distribution hacker on demand, and could very well be shooting dollars in the dark.</p>\n<p dir=\"ltr\"><strong>Here's what happens when you throw out paid acquisition altogether:</strong></p>\n<p dir=\"ltr\">a) you handicap your product by cutting out a potentially valuable acquisition strategy</p>\n<p dir=\"ltr\">b) your company misses out on a valuable mine of ongoing feedback and data that could be going towards product development and improved messaging</p>\n<p dir=\"ltr\">c) you miss out on learning about your messaging, value propositions, and landing pages.</p>\n<p dir=\"ltr\"><strong>At 500 Startups, we believe in starting distribution from day 1.</strong></p>\n<p dir=\"ltr\">To get you started, here are 4 distro experiments &amp; hacks that the 500 Distribution Team has used to help our 1:1 clients and accelerator companies run distribution experiments and improvements on $10 a day -- or less.</p>\n&nbsp;\n<h2 dir=\"ltr\">#1 Test your conversion funnel</h2>\nWe recommend <a href=\"https://mixpanel.com/\">Mixpanel</a> to a lot of our companies because it gives you free events / people in exchange for you simply putting their logo on your site.\n<p dir=\"ltr\"><strong>HOW TO DO IT</strong></p>\n\n<ol>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Set up events at each step of your funnel and find the weak points in your funnel. Work to improve the weak points first.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Reduce registration friction by only requiring completely necessary fields. This will increase the amount of users entering your product but be aware this will reduce the overall quality of incoming users. The hope is the increase in volume will offset the decrease in quality.</p>\n</li>\n</ol>\n<p dir=\"ltr\"><strong>COST: Free</strong></p>\n<p dir=\"ltr\">Wait, you don’t have an email funnel? You should really get on that. But don’t worry, it's easy to get started with something simple, and still get results right away. (<a title=\"How to Suck Less at Email Marketing -- 500 Startups Blog\" href=\"http://500.co/2013/08/13/how-to-suck-less-at-e-mail-marketing/\" target=\"_blank\">Read about how to suck less at email marketing here.</a>)</p>\n&nbsp;\n<h2 dir=\"ltr\">#2 Capture / recapture abandoning users with funnel abandonment emails</h2>\n<p dir=\"ltr\">This can be also done through Mixpanel.</p>\n<strong>HOW TO DO IT</strong>\n<ol>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Set up a people property for the “last step in funnel” that the user takes and email them a customized message when they drop out of the funnel.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">You can also set up people properties for your best customers to reward them for hitting certain retention goals.</p>\n</li>\n</ol>\n<p dir=\"ltr\"><strong>COST: Free</strong></p>\n&nbsp;\n<h2 dir=\"ltr\">#3 Test FB ads at minimal spend</h2>\nIf you don't know what you're doing, spending on FB ads can be scary like a runaway train. Luckily, there are a few techniques to mitigate risk and limit spend while still getting most of the key benefits of advertising on Facebook.\n<p dir=\"ltr\"><strong>HOW TO DO IT</strong></p>\n\n<ol>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">When you don’t have a large budget to spend it is best to start with broad targeting. It may seem like starting very targeted is the best path to take with a low budget, but there’s a needle-in-the-haystack problem with this approach. If you have 100 factors you can test and you are only testing 1 at a time, you’ll need get lucky with picking the one that is successful first. With broad targeting, your highs won’t be as high, but you’ll be able to test more general assumptions -- which is how you need to start. You can also look for signals of potential success.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Always test male/females separately. Gender segments will typically perform differently.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Always test different age ranges separately. Different age segments will also usually perform differently.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Test different value propositions, copy, and images.</p>\n</li>\n</ol>\n<strong>COST: You can get valuable results with a spending cap of $10 a day.</strong>\n\n&nbsp;\n<h2 dir=\"ltr\">#4 User Interview</h2>\n<p dir=\"ltr\">One cheap method that garners valuable insight is the in-person interview. Aaahh! Talking to real people! We know, we know, but for $5, the insights you’ll learn are worth any potential awkwardness. And it’s never awkward to WIN, at UX and distribution that is.</p>\n<p dir=\"ltr\"><strong>HOW TO DO IT</strong></p>\n\n<ol>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Go to a coffee shop, buy people a cup of coffee, and watch them use your product. You can observe people's natural interaction with your product, or suggest specific goals / actions for them to achieve.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Focus on your onboarding flow. It will be painful to watch because things that are obvious to you as the creator are sometimes not obvious to users. But good-painful.</p>\n</li>\n</ol>\n<strong>COST: $5 or less</strong>\n\n&nbsp;\n<h2 dir=\"ltr\">BONUS: Learning The Tools</h2>\n<p dir=\"ltr\">One final important reason to get started with distribution early is so you can learn the tools now (before you go big time)! This will save you time when you’re ready to scale your distribution strategies.</p>\n&nbsp;\n<h2 dir=\"ltr\">Conclusion</h2>\n<p dir=\"ltr\">Even if you're not Whatsapp (and you're not), or an amply funded startup, you don't have to sit on your hands and wait for distribution to come to you. There are LOTS more experiments beyond what we've briefly outlined here, all at varying levels of spend.</p>\n<p dir=\"ltr\">The most important thing to keep in mind is that distribution should be a core focus for your company, now. Start early, start small, but START.</p>\n&nbsp;\n<h2 dir=\"ltr\">What's Next?</h2>\n<p dir=\"ltr\">If you enjoyed this post, then check out these additional resources for how you can up your game from the 500 Distribution team:</p>\n\n<ul>\n\t<li><a title=\"How to Suck Less at E-mail Marketing\" href=\"http://500.co/2013/08/13/how-to-suck-less-at-e-mail-marketing/\">How to Suck Less at Email Marketing</a></li>\n\t<li><a title=\"4 Easy Ways to Grow Your Twitter Followers\" href=\"http://500.co/2013/12/13/4-easy-ways-to-grow-your-twitter-followers/\">4 Easy Ways to Grow Your Twitter Followers</a></li>\n\t<li><a title=\"The Power of Trigger Emails\" href=\"http://500.co/2013/10/25/the-power-of-trigger-emails/\">The Power of Trigger Emails</a></li>\n</ul>\n<p dir=\"ltr\">And, don’t forget you can get Distro delivered. Get a daily bite-sized distro hack delivered to your inbox:</p>\n<strong>&gt;&gt; <a title=\"Distrosnack 500 Startups Distribution Email Newsletter\" href=\"http://eepurl.com/BfYXn\">Subscribe to Distrosnack here</a> &lt;&lt;</strong>",
    "type": "post",
    "path": "/2014/03/13/5-distro-experiments-you-can-do-on-10-or-less/",
    "backgroundImage": "/backup/cheapskates-960x540-2014-03-13-14-10-30.jpg"
}