{
    "title": "5 Ridiculous Marketing Tricks that Used to Work",
    "slug": "5-ridiculous-marketing-tricks-that-used-to-work",
    "date": "2013-11-05T17:12:51.000Z",
    "url": "http://500.co/?p=1116730427",
    "uri": "http://500.co/2013/11/05/5-ridiculous-marketing-tricks-that-used-to-work/",
    "postId": "1116730427",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/11/longcat.gif",
        "http://500.co/wp-content/uploads/2013/11/giphy.gif",
        "http://500.co/wp-content/uploads/2013/11/11-4-2013-11-50-28-PM.png",
        "http://500.co/wp-content/uploads/2013/11/giphy-1.gif",
        "http://500.co/wp-content/uploads/2013/11/11-4-2013-11-46-22-PM.png",
        "http://500.co/wp-content/uploads/2013/11/yoda.gif"
    ],
    "creator": "",
    "categories": [
        "branding",
        "digg",
        "distribution",
        "domains",
        "facebook",
        "open-graph",
        "seo",
        "social-media"
    ],
    "content": "<p dir=\"ltr\"><em>This post is part of the ongoing Distribution  series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em></p>\nOnline marketing is constantly shifting and changing. Today’s startup marketer has the daunting task of keeping up with all these changes while quickly adapting strategy as needed. Growth doesn’t come easy, but then again, few good things do.\n\nIn fact, it’s probably best to think of your marketing like a mining operation. If you plan and execute well enough, you’re likely to strike a few rich veins (acquisition channels) that yield good results. Of course those veins can run out, so you’ll need to find new ones to mine. If you're clever, you'll become very efficient at getting every last ounce of value out.\n\nBut before you put on your hard hat and dig up a gas line, let’s pause and take a look back. Yes, it’s time to visit a few great moments in marketing — this time in the form of the ridiculous online marketing tricks of the past. Part of us wishes some of these still worked today, but thankfully, we know better.\n<h2><b>Freakishly Long Keyword-R</b><b>ich Domain Names</b></h2>\n<img alt=\"longcat\" src=\"/backup/longcat-2013-11-05-13-11-12.gif\" width=\"252\" height=\"168\" />\n\nEarlier on the web, many domains were looooong. Scary long. This was due to several things, but in many cases, companies just wanted to stuff keywords right into the domain name itself. As such, it was not uncommon to find something like <a href=\"http://www.booktraveltohawaiionline.com/\">www.booktraveltohawaiionline.com</a> or much worse.\n\nToday, we know that it’s better to use a memorable brand name. Google has also recently taken steps to reduce the value of these domains even further in what was called the EMD (exact match domain) Update of 2012. So when in doubt, avoid the keywords and go for something easy to spell.\n\nPro Tip: It should be a domain name you could tell some in-person easily, without  him or her asking you to repeat it for clarification.\n\n<hr />\n\n<h2><b>The Digg Effect</b></h2>\n<img class=\"aligncenter size-full wp-image-1116730439\" alt=\"giphy\" src=\"/backup/giphy-2013-11-05-13-11-12.gif\" width=\"375\" height=\"281\" />\n\nBefore Reddit and Hacker News, there was Digg, and it was glorious. The community kicked ass, the site was clean, and the content was literally the best of the web. It was where you went to find the latest trend before BuzzFeed started putting everything in GIFs.\n\nGetting to the front page of Digg crashed the featured websites quite often. That was the Digg Effect. When harnessed correctly, it was an incredibly powerful way to drive traffic or to just entertain a large audience. Nowadays, audiences you reach from Reddit or Hacker News are OK, but not fantastic. We miss you Digg, but we do kinda like where things are going today with <a href=\"http://digg.com/\" target=\"_blank\">the new site.</a>\n\n<hr />\n\n<h2><b>Absurd SEO Hacks</b></h2>\n<img class=\"aligncenter size-full wp-image-1116730445\" alt=\"11-4-2013 11-50-28 PM\" src=\"/backup/11-4-2013-11-50-28-PM-2013-11-05-13-11-12.png\" width=\"499\" height=\"314\" />\n\nI can’t help but try to imagine what was going through the first person’s head when trying to trick search engines with transparent text. Did he or she laugh manically as the code was updated? This, along with myriad other absurd SEO hacks, have been tried over the years. Google deploys a small army of content reviews, data scientists, and other smart people who fight this stuff even to this day.\n\nTo those crazy fools who post blog comment spam and to those who auto-generated millions of fake pages, we salute you. Yes—even you—the genius behind keyword stuffing. Thank you. Someone had to get crazy, and you did it. Of course, you ruined it for us all, and now Google subjects us to routine torture with cute animal names like Panda and Penguin. We're not exactly happy about that.\n\n<hr />\n\n<h2><b>Open Graph Hacking</b></h2>\n<img class=\"aligncenter size-full wp-image-1116730447\" alt=\"giphy (1)\" src=\"/backup/giphy-1-2013-11-05-13-11-12.gif\" width=\"800\" height=\"239\" />\n\nFacebook has done a lot for the modern-day marketer. In fact, many start-ups are able to get some form of lift off using Facebook Ads and Facebook Login for user onboarding. For a short window, several enterprising startups managed to use Facebook Open Graph actions to grow insanely fast. The one that did that best was probably SocialCam, which attracted 75M users in just over a year.\n\nOf course, though, the ride didn’t last long, especially after several other apps tried to mimic the aggressive growth techniques. That ultimately led to many of those actions being deprecated or adjusted. The big lesson for startups: a diverse approach to growth is vital. Dependence on any one platform can hurt, and hurt bad.\n\n<hr />\n\n<h2><b>Overly Demanding Brand Pages</b></h2>\n<img class=\"aligncenter size-full wp-image-1116730435\" alt=\"11-4-2013 11-46-22 PM\" src=\"/backup/11-4-2013-11-46-22-PM-2013-11-05-13-11-12.png\" width=\"541\" height=\"366\" />\n\nSometimes it’s better for marketers to be extremely direct about what they want users to do. This is known as the “call to action\" or CTA. But in the 140-character world of social media, this is sometimes taken to the extreme. The worst offenders: bossy community managers and overly demanding brand pages. They ask you to “like this” or “tweet that” or “engage here.” It can be really damn annoying at times but also effective.\n\nIn the end, it’s probably better to skip most of these tactics or to use them sparingly. Facebook has even <a href=\"http://sproutsocial.com/insights/2013/08/facebook-news-feed-quality/\">recently begun to punish pages</a> for lower-quality posts. Resist the urge of vanity metrics such as Facebook Likes you must.\n\n<a href=\"/backup/yoda-2013-11-05-13-11-12.gif\"><img class=\"aligncenter size-full wp-image-1116730457\" alt=\"yoda\" src=\"/backup/yoda-2013-11-05-13-11-12.gif\" width=\"500\" height=\"213\" /></a>\n\n<strong>Know of any other ridiculous online marketing techniques that used to work? Tell us in the comments.</strong>\n<h1></h1>\n<h1><b>What's Next?</b></h1>\nIf you enjoyed this post, first check out these additional resources for how you can up your game from the 500 Distribution team:\n<ul>\n\t<li><a href=\"http://500.co/2014/03/13/5-distro-experiments-you-can-do-on-10-or-less/\">5 Distribution Experiments You Can Do For $10 Or Less</a></li>\n\t<li><a href=\"http://500.co/2013/08/13/how-to-suck-less-at-e-mail-marketing/\">How to Suck Less at Email Marketing</a></li>\n\t<li><a href=\"http://500.co/2013/10/25/the-power-of-trigger-emails/\">The Power of Trigger Emails</a></li>\n</ul>\nThen, sign up to get a daily bite-sized distro hack (and one awesome GIF) delivered to your inbox:\n\n<b>&gt;&gt; </b><a href=\"http://eepurl.com/BfYXn\"><b>Subscribe to Distrosnack here</b></a><b> &lt;&lt;</b>",
    "type": "post",
    "path": "/2013/11/05/5-ridiculous-marketing-tricks-that-used-to-work/",
    "backgroundImage": "/backup/shamwow-960x540-2013-11-05-13-11-12.jpg"
}