{
    "title": "5 SEO Wins that Take 5 Minutes",
    "slug": "5-seo-wins-that-take-5-minutes",
    "date": "2013-06-11T18:19:35.000Z",
    "url": "http://500.co/?p=1116727831",
    "uri": "http://500.co/2013/06/11/5-seo-wins-that-take-5-minutes/",
    "postId": "1116727831",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "advice",
        "distribution",
        "musings",
        "seo"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em>\n\nIn the early days of your startup, it’s tough to make time to invest in SEO (Search Engine Optimization). You have enough to worry about,  and now SEO is more complex than ever thanks to ongoing changes at Google. And with so much shifting to social, maybe it doesn’t feel like a strong channel for your business. Finally, you typically don’t see immediate results with SEO investments –  it might take months to see the real impact.\n\nHowever it’s still important to nail the basics when you get started. Here are the top 5 quick SEO wins your startup needs. These should each less than 5 minutes to setup, so think of this as a simple checklist for any new domain you launch on the web. Now let’s get started:\n\n<b>Verify your Page Titles</b>\n\nOne of the more important wins for SEO is properly formatted page titles. These should be wrapped in &lt;H1&gt; headline tags so Google knows to classify the text as a page title. Open up a few pages (especially the important ones) and make sure this is setup correctly site wide. Use solid titles for all your pages and include modifiers (2013, guide, how-to) when applicable to help with longer tail search terms.\n\n<b>Setup Google Webmasters Tools</b>\n\nVisit <a href=\"http://www.google.com/webmasters/tools/\">www.google.com/webmasters/tools/</a> to setup your domain(s) in Google Webmaster Tools. You’ll need to verify ownership of your site through a &lt;head&gt; tag or by placing a file on your server. After that Google hands over a treasure trove of valuable data about your website. The truth is Google wants you to do SEO, and they’re happy to help provide some guidance right here in Webmasters Tools.\n\n<b>Add a Site Map</b>\n\nOnce you’re setup in Webmasters Tools you can also submit an XML Site Map. This is a list of all the URLs on your domain(s). Ideally this is a dynamically generated file that updates whenever new URLs are created on your domain. If you’re unable to create a dynamic sitemap file today use <a href=\"http://www.xml-sitemaps.com/\">http://www.xml-sitemaps.com/</a> to get started. This service will crawl your site and pull out the first 500 URLs it finds. Eventually you’ll want a dynamic solution but this at least gets you started. Adding a good site map is a must for any site with deep content  (any URLs that may be hidden behind several levels of navigation).\n\n<b>Google Yourself</b>\n\nYou can never Google yourself enough these days. In addition to searching for your brand name try searching “site:www.youdomain.com” in Google sometime. This shows you the majority of URLs Google has indexed from your site.\n\nPage one of the results also represents what Google interprets as some of the more important pages of your site. See anything here that doesn’t belong? Be sure to remove those URLs or add “noindex” tags to the &lt;head&gt; of that document. For example, you’re likely to see your privacy or terms of service URLs here since those are typically linked to on every page of your site. Since they bring little to no SEO value you may want to “noindex” these URLs. Cleaning up irrelevant or low value content can help keep Google focused on your more meaningful pages\n\n<b>Link Out</b>\n\nStop being so selfish! Most sites do not link out to external sites, especially from their homepage. However doing this actually helps with SEO as it signals to Google what sites you associate yourself with. That helps them know what “neighborhood” to place you in. For example, you may want to link to the official websites of a few brands you carry if your an e-commerce website selling those products. I recommend healthy external linking both on your homepage and other internal content pages like company blog posts.\n<p style=\"text-align: center\"><strong>Are you a 500 company who needs help with distribution? <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">Let's talk</a>.</strong></p>",
    "type": "post",
    "path": "/2013/06/11/5-seo-wins-that-take-5-minutes/",
    "backgroundImage": "/backup/baby-960x540-2013-06-11-13-13-19.jpg"
}