{
    "title": "500 Hearts Startups Who Get Mobile ",
    "slug": "500-hearts-startups-who-get-mobile",
    "date": "2013-03-02T01:57:23.000Z",
    "url": "http://500.co/?p=1116726137",
    "uri": "http://500.co/2013/03/01/500-hearts-startups-who-get-mobile/",
    "postId": "1116726137",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/03/chat.jpg",
        "http://500.co/wp-content/uploads/2013/03/luca-300x193.jpg"
    ],
    "creator": "",
    "categories": [
        "955-dreams",
        "accelerator",
        "android",
        "cubie-messenger",
        "curious-hat",
        "distribution",
        "dr-chrono",
        "happy-inspector",
        "ipad",
        "iphone",
        "kickfolio",
        "medialets",
        "mindsnacks",
        "mobile",
        "monogram",
        "platforms",
        "tablet",
        "vungle"
    ],
    "content": "<b id=\"internal-source-marker_0.7803021944127977\">This past month, we told you about some of the investment areas that excite us the most, like <a href=\"http://500.co/2013/02/14/breaking-down-borders-why-language-startups-kick-ass/\">language startups</a> and <a href=\"http://500.co/2013/02/12/vai-brasil-brazils-tech-scene-sambas-onto-the-worlds-stage/\">international</a> <a href=\"http://500.co/2013/02/15/jai-ho-500-helps-indian-startups-march-to-victory/\">companies</a>. Today, we’re sharing why 500 loves mobile companies. Want to be part of our next batch of startups? <a href=\"http://bit.ly/Applyfor500\">Apply now before it’s too late! </a>(deadline is TONIGHT at 11:59pm, PST)\n</b>\nJust a few years ago, people called the first iPad a “big iPhone.” I was one of the first iPad skeptics myself, and didn’t understand the appeal of a big touchscreen device. That is, until I actually felt one in my hands. And then bought one. After using it in ways I hadn’t anticipated at all – like watching Netflix while washing dishes, or reading sheet music PDFs without the hassle of printing – I was addicted. I even used it to keep up with Twitter, Facebook, and online news while I watched TV – something that more than 85% of the population does, too.\n\nThere’s no question that Apple and Google have ushered in an unprecedented era of mobile computing. Apple has sold more than 100 million iPads in total over the last 3 years, and Android is poised to remain the top mobile OS in the United States through 2016. And in total, there are more than 1.5 million apps across the Apple, Google Play, and Microsoft app stores. People are hooked on apps.\n\nWith mobile internet usage set to eclipse the desktop in 2014, other big companies are jumping into the market, too. They’d be crazy not to, especially as other parts of the world (like <a href=\"http://500.co/2013/03/01/southeast-asia-sea-is-social-on-steroids/\">Southeast Asia</a>), become as mobile as their western counterparts, thanks to the introduction of low-cost feature phones and Android devices.\n\n500 is making it rain in mobile – we’re putting serious cash into companies that are mobile first, companies that utilize mobile as a key distribution strategy, or companies that are helping other companies monetize and/or distribute their mobile presence. We see this happening across many themes - from education to entertainment, e-commerce to real estate, and more.\n\nWe have a number of awesome mobile startups in the 500 family, like <a href=\"https://itunes.apple.com/us/app/monogram/id517886439?ls=1&amp;mt=8\">Monogram</a> (a slick, ecommerce fashion magazine), <a href=\"https://itunes.apple.com/us/app/happy-inspector/id454179020?mt=8\">Happy Inspector</a> (an iPad app for property inspections), <a href=\"http://medialets.com/\">MediaLets</a> (mobile rich media ad platform), <a href=\"http://vungle.com/\">Vungle</a> (monetizing mobile via video),  <a href=\"http://www.955dreams.com/\">955 Dreams</a> (mobile publishing platform &amp; makers of “<a href=\"https://itunes.apple.com/us/app/band-of-the-day/id459664402?mt=8\">Band Of The Day</a>”), <a href=\"https://itunes.apple.com/us/app/drchrono-ehr/id369191782?mt=8\">Dr Chrono</a> (EHR for iPad), <a href=\"https://itunes.apple.com/us/artist/mindsnacks/id385497071\">MindSnacks</a> (language learning apps), <a href=\"https://itunes.apple.com/us/app/cubie-messenger/id507726019?mt=8\">Cubie Messenger</a> (mobile messaging app) and <a href=\"http://kickfolio.com/\">Kickfolio</a> (iOS browser testing). And that only scratches the surface.\n\n<a href=\"http://www.curioushat.com/\">Curious Hat</a>, a startup focused on creating fun, innovative interactive experiences for children, was part of our most recent batch of startups. Here’s what they had to say about their time at 500:\n\n<em>When we started the adventure of 500 Startups last October, we had one app in the Apple Store, many ideas, dozens of prototypes, a great team scattered around the world, and a lot of curiosity. What an incredible and intense 4 months they were! We met amazing mentors that guided our vision toward a better product, better communication, and better design. We released 6 apps that got downloaded 200k times and were featured by Apple many times, and are now building a mobile playground where parents and children will play and interact in new ways.</em>\n\n<a href=\"/backup/chat-2013-03-01-13-19-57.jpg\">\n<img class=\"alignleft  wp-image-1116726145\" alt=\"Print\" src=\"/backup/chat-2013-03-01-13-19-57.jpg\" width=\"150\" height=\"150\" /></a>\n\n<em>We have a grand vision that goes beyond building individual apps. Being side by side with other amazing companies and founders gave us lots of inspiration; you see each other grow, refine your goals, and build a better product without forgetting the passion that brought you at 500 in the first place. The feeling that you are forever part of a #500Strong family is an amazing advantage for dreamers and builders like ourselves.</em>\n\n<a href=\"http://500.co/wp-content/uploads/2013/03/luca.jpg\"><img class=\"alignleft  wp-image-1116726139\" alt=\"luca\" src=\"/backup/luca-300x193-2013-03-01-13-19-57.jpg\" width=\"240\" height=\"154\" /></a>\n\n<strong>Luca Prasso, Founder and CEO, <a href=\"http://www.curioushat.com/\">Curious Hat</a> </strong>(fun fact: he previously won an Oscar for his work on the movie <a href=\"http://www.imdb.com/name/nm1657966/\">Shrek</a>). Check out <a href=\"http://www.livestream.com/500startups/video?clipId=pla_45f1711e-5e4a-4a1e-9ac9-da40f137bca2&amp;utm_source=lslibrary&amp;utm_medium=ui-thumb\">video of Luca’s demo day pitch.</a>\n\nAre you building the next great mobile app? Is mobile distribution a key part of your strategy? If so, <a href=\"http://bit.ly/Applyfor500\">apply to be part of our Spring Accelerator.</a> <strong>The deadline is TODAY, March 1st at 11:59pm, PST, so <a href=\"http://bit.ly/Applyfor500\">get your application in NOW. </a></strong>",
    "type": "post",
    "path": "/2013/03/01/500-hearts-startups-who-get-mobile/",
    "backgroundImage": "/backup/ipad-960x540-2013-03-01-13-19-57.jpg"
}