{
    "title": "500 FAQ",
    "slug": "500-faq",
    "date": "2012-09-15T03:59:15.000Z",
    "url": "http://500.co/?p=1116723017",
    "uri": "http://500.co/2012/09/14/500-faq/",
    "postId": "1116723017",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "accelerator",
        "announcements",
        "startups"
    ],
    "content": "&nbsp;\n<strong>What is 500 Startups?</strong>\n<p dir=\"ltr\">We’re a hybrid between an accelerator and seed fund. We run our accelerator program twice a year offering funding, hands on programming, office hours, mentorship, bootcamps, and the tools needed to blow up your startup. Additionally, we invest in startups outside of our accelerator, host series of conferences and events such as unSEXY, Inbox Love, Geeks on a Plane, and more. You can learn more about us through this <a href=\"http://www.youtube.com/watch?v=oy--ub2jMHs&amp;feature=BFa&amp;list=PL571BAAD2DFD8F8C7\">video</a> and this <a href=\"http://www.youtube.com/watch?v=khm5VvuAVwk&amp;feature=autoplay&amp;list=PL571BAAD2DFD8F8C7&amp;playnext=1\">video</a>.</p>\n&nbsp;\n&nbsp;\n<strong>What kind of investments does 500 Startups make?</strong>\n\nWe make seed stage investments ranging from $25K to $250K (roughly). We invest in companies via the following:\n\n- Participating in companies’ seed rounds\n- Investing in companies that go through our <a href=\"http://500.co/accelerator\">accelerator program</a>.\n&nbsp;\n&nbsp;\n\n<strong>How do I get funded by 500 Startups?</strong>\n\nCurrently, there are two methods to get into 500 Startups.\n<strong><em>To be funded through our accelerator program</em></strong>, you can:\n\n<strong>Apply through AngelList</strong>: If you don’t have one already, create an AngelList profile and apply for the accelerator <a href=\"http://angel.co/500startups\">here</a>. Pro tip: read through what we look for before applying. (Scroll down to Question #8)\n<strong>Referrals</strong>: We source out recommendations for startups through referrals from our network. This includes <a href=\"http://500startups.com/mentors\">mentors</a> and <a href=\"http://500startups.com/startups\">founders</a> from the 500 family. We trust people in our network to help us filter, evaluate, and find the type of companies that we want to join our family. Not all opinions are weighed the same. Careful referrals with a lot of thought and consideration are weighed more heavily. Referrals along the lines of “Hey, meet my {new} friend X! Thx!” less so.\n\n<em><strong>For seed investment only (not accelerator):</strong></em>\n\n<strong>Referrals</strong>: We value referrals from our network. Intros and recommendations for startups will be evaluated by our investment team. (See above regarding referrals.) Pro tip: Be open to hearing why someone may not want to recommend you. Don’t expect someone to refer you just because you’re friends.\n&nbsp;\n&nbsp;\n<strong>What’s the difference between the 500 Accelerator Program and 500’s seed investments?</strong>\n\n<strong>Accelerator Program:</strong> It’s a structured program with about 25 - 35 startups hosted in the 500S headquarters for 4 months. At the end of the program, we hold three Demo Days in Mountain View, San Francisco and New York, respectively. (Although we don’t limit ourselves!) During Demo Days startups pitch to potential investors (and press). To get an idea of what happens, check out previous pitches via this <a href=\"http://www.youtube.com/watch?v=9yrNgq_ahsE&amp;feature=autoplay&amp;list=PL571BAAD2DFD8F8C7&amp;playnext=1\">video</a> and this <a href=\"http://www.youtube.com/watch?v=9yrNgq_ahsE&amp;feature=autoplay&amp;list=PL571BAAD2DFD8F8C7&amp;playnext=1\">video</a>.\n\n<strong>Seed Investments:</strong> We also invest outside the program by making seed investments. Seed companies do not work from our office space, but they have access to our mentor and founder networks.\n&nbsp;\n&nbsp;\n<strong>When is the deadline to apply for the Fall 2012 Accelerator batch?</strong>\n\nSunday September 23 11:59PM Pacific. You can apply <a href=\"https://angel.co/500startups#overview\">here</a>.<strong></strong>\n&nbsp;\n&nbsp;\n<strong>When can we expect to hear back after we apply?</strong>\n\nGiven the anticipated volume of applications, we can’t promise that we will respond to everyone. (Sorry!) But if we’re interested in you, you’ll definitely hear from us. Again, increase your chances by checking out question eight.\n&nbsp;\n&nbsp;\n<strong>What are the dates for the next 500 Accelerator Batch?</strong>\n\nThe next accelerator class will begin Oct 4th, 2012 and conclude at the end of January/early February 2013.\n&nbsp;\n&nbsp;\n\n<strong>What type of companies does 500 Startups look for?</strong>\n\nThere’s an visual overview here: <a href=\"http://500.co/2012/04/06/visualizing-the-last-18-months-of-500-startups/\">Awesome Visual.ly Infographic </a>\n<p dir=\"ltr\">Generally, though, we look for the following:</p>\n<em><strong>Strong Team:</strong></em> A solid team is the foundation for all great companies. We usually look for a small cross-functional team with the combination of technical skills, design talent, marketing know-how, or at least a combination of two out of the three. We look for smart, passionate people who work well together, and are driven to solve problems for a target customer group. Founders who have worked together for at least a few months are a bonus.\n<strong><em>Investment Themes:</em></strong>The startups we invest in all have an internet-based form of distribution. They typically fall under the common theme of:\n\n- Consumer E-Commerce\n- SMB Productivity &amp; Cloud Services\n- Mobile + Tablet (iOS &amp; Android)\n- Payments &amp; Financial Services\n- “Family Tech” &amp; Education\n- International + Cross-border, Language\n- Healthcare/Wellness; Food Tech\n\n<strong><em>Product:</em></strong> We have a strong preference for companies whose products are launched and have demonstrated some usage validation (beyond just friends and family). The product should address a problem for a specific target customer and rely primarily on scalable methods of distribution, particularly using online platforms (search, social, mobile, local).\n<strong><em>Traction:</em></strong> Having traction is a demonstration of proof of concept. If the data suggests things are moving in the right direction, it will help your chances of being accepted to 500.\n<strong><em>Business model:</em></strong> We prefer simple and straightforward revenue models. Examples include subscription, lead generation, transaction/SaaS, etc. We also like capital efficient businesses. We look for companies that can be operational with less than $1M in funding.\n&nbsp;\n&nbsp;\n\n<strong>What value will I get out of being in the 500 Accelerator Program?</strong>\n\n<em><strong>Mentorship:</strong></em> One of the biggest benefits of going through the 500 Startups Accelerator program is having access to knowledgeable <a href=\"http://500.co/mentors/\">mentors</a>. As founders going through the program, you will have access to the 500 Partners, seasoned entrepreneurs, experienced investors, or individuals with considerable expertise in their field to give feedback and offer you guidance. The 500 Accelerator also hosts talks and fireside chats. These speakers include top domain experts on important topics such as distribution, design, data, fundraising, and more. Learn more through this <a href=\"http://www.youtube.com/watch?v=qIVe0Ms4AUo&amp;feature=bf_prev&amp;list=PL571BAAD2DFD8F8C7\">video</a>.\n<strong><em>500 Network:</em> </strong>The 500 Startups network consists of a growing list, several hundred founders and mentors strong. They come from diverse backgrounds, expertise, and locations. You’ll be connected to a growing list of growth hackers, engineers, designers, marketers, and founders from not just Silicon Valley or other parts of the U.S., but also Brazil, China, India, Japan, Russia, and other international markets. It is a tight-knit community that actively communicates with each other and provides support. We really are a big global entrepreneurial family.\n<strong><em>Brand and PR:</em></strong> 500 Startups has a strong brand as one of the top accelerators in the world. Associating your startup with the 500 Startups brand is valuable. Our brand helps us attract an impressive group of tech investors and press to our Demo Days as well as the ability to continually build our network.\n<em><strong>Funding:</strong></em> Accelerator companies receive $50K in funding for 5% of the company. We also participate in follow-on investments up to $250k for companies we think are doing well.\n<em><strong>Office space:</strong></em> We have a 10,000 sq ft <a href=\"http://www.youtube.com/watch?v=3tsbISFI6-s&amp;feature=BFa&amp;list=PL571BAAD2DFD8F8C7\">office space</a> in Mountain View overlooking a stunning view of Silicon Valley. During your time in the accelerator you will work in our office along with about 25-30 other startups (mostly your classmates!). We feel the space is necessary in order to foster an environment of collaboration. Being here with other founders will encourage a sense of camaraderie as you are all facing the same types of challenges; they understand what you’re going through. Each of you can offer help, advice and encouragement and sometimes just support. Previous classes have likened it to summer camp. You get to be very close over your time here.\n<strong><em>Fun:</em></strong>The 500 Startups culture encourages collaboration, innovation, creativity, taking risks, having fun, and being authentic. You’ll be working hard but it will be crazy, fun and like nothing else. Each batch has their own personality, but the most common result of the program is that companies within each batch bond with each other and maintain great connections even beyond the program.\n&nbsp;\n&nbsp;\n\n<strong>What are examples of companies that have gone through the 500 accelerator program?</strong>\nExamples include <a href=\"http://getpunchd.com/\">Punchd</a> (acquired by Google), <a href=\"http://www.internmatch.com/\">InternMatch</a>, <a href=\"http://9gag.com/\">9GAG</a>, <a href=\"http://www.snapette.com/\">Snapette</a>, <a href=\"https://toutapp.com\">ToutApp</a>, <a href=\"http://www.vayable.com/\">Vayable</a>, <a href=\"http://cardinalblue.com/\">Cardinal Blue</a>, <a href=\"http://launchrock.com/\">LaunchRock</a>, <a href=\"http://www.farmeron.com/\">Fameron</a>, <a href=\"http://www.brandboards.com/\">BrandBoards</a>, <a href=\"https://www.fitocracy.com/\">Fitocracy</a>, <a href=\"https://safeshepherd.com/\">SafeShepherd</a>, <a href=\"http://spinnakr.com/\">Spinnakr</a>, <a href=\"https://www.intercom.io/\">Intercom</a>, <a href=\"http://www.72lux.com/\">72lux</a>, <a href=\"https://chalkable.com/\">Chalkable</a>, <a href=\"http://wanderable.com/\">Wanderable</a>, <a href=\"http://www.publikdemand.com/\">PublikDemand</a>, <a href=\"https://www.facebook.com/tokyootakumode\">TokyoOtakuMode</a>, and <a href=\"http://www.happyinspector.com/\">HappyInspector</a>. For a complete list, go <a href=\"http://500.co/startups-test/?startuplocations=0&amp;startupinvestmentthemes=0&amp;startupstages=accelerator-2&amp;submit=Filter\">here</a>.\n&nbsp;\n&nbsp;\n<strong>What is it like being in 500 Startups? </strong>\n\nSome of our founders have shared their experience on Quora. You can read it <a title=\"http://www.quora.com/500-Startups/What-is-it-like-being-in-500-Startups\" href=\"http://www.quora.com/500-Startups/What-is-it-like-being-in-500-Startups\">here</a>.\n&nbsp;",
    "type": "post",
    "path": "/2012/09/14/500-faq/"
}