{
    "title": "More Funding for White Swans: Announcing the Merger of 500 Startups and Y Combinator",
    "slug": "500combinators",
    "date": "2014-04-01T16:50:56.000Z",
    "url": "http://500.co/?p=1116732019",
    "uri": "http://500.co/2014/04/01/500combinators/",
    "postId": "1116732019",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2014/04/bbottle.jpg"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "announcements",
        "paul-graham",
        "pg",
        "sam-altman",
        "sam-biddle",
        "secret",
        "valleywag",
        "yc"
    ],
    "content": "<p dir=\"ltr\"><em>Note: This was originally published on <a href=\"http://www.zwani.com/graphics/april_fools_day/images/1aprilfools15.gif\" target=\"_blank\">April 1st, 2014. </a> It's a joke.\n</em></p>\n<p dir=\"ltr\">At 500 Startups, we hit some big milestones over the last year: we opened up our first San Francisco office, funded our 500th company, and made it to Valleywag more times than we can count (yo Biddle… keep ‘em coming).</p>\n<p dir=\"ltr\">But today, we’re proud to announce our biggest accomplishment yet.</p>\n<p dir=\"ltr\">500 Startups and Y Combinator are joining forces to create 500 Combinators, the most prestigious accelerator monopoly program in the world.* As part of the merger, 500 Startups founding partner Dave McClure will be named Chief Marketing Officer and report to Sam Altman.</p>\n<p dir=\"ltr\">Why join forces? Well, 500 Startups has already been funding YC rejects for 4 years, and we figured this was an easier way to double our helping of <del>PG’s</del> Sam Altman’s sloppy seconds. Together, we believe we can help twice as many white male nerdy Stanford &amp; MIT students who look like Zuck, and already have access to everything.</p>\nWe’re now accepting applications for our inaugural batch in Mountain View. Submissions will be accepted through Hacker News where they will immediately be torn apart via the commenters. Those who survive will be subject to relentless trolling on Secret. Breaks will be given every 30 minutes to let Secret app users continue their normal programming of pointing out how much Dave McClure is full of shit.\n<p dir=\"ltr\">The inaugural 500 Combinators batch is expected to launch this summer and include roughly 850 startups. Be sure to tune into this batch’s Demo Week, which will consist of 15 second pitches spanning 5 consecutive non-stop days. Don’t worry, investors - you’ll be well taken care of with unlimited Blue Bottle coffee and puffy Patagonia vests to keep you warm at night.</p>\n<p dir=\"ltr\"><a href=\"/backup/bbottle-2014-04-01-14-10-50.jpg\"><img class=\"aligncenter size-full wp-image-1116732025\" alt=\"bbottle\" src=\"/backup/bbottle-2014-04-01-14-10-50.jpg\" width=\"700\" height=\"466\" /></a></p>\n<p dir=\"ltr\">In addition to joining forces, YC &amp; 500 are proud to announce a new program for VC diversity training (in partnership with Ben Horowitz and Sheryl Sandberg) called, “The Hard Thing about Funding People Who Don’t Look Like Zuck”.</p>\n<p dir=\"ltr\">We want to thank everyone for their support and collusion over the years. We’ll have a small celebration dinner tonight at BIN38. Wear your Google Glass to get a free drink.</p>\n<p dir=\"ltr\">500 Combinators: Make Something VCs Want.</p>\n<p dir=\"ltr\"><em>*merger pending antitrust approval by the DOJ &amp; FTC</em></p>",
    "type": "post",
    "path": "/2014/04/01/500combinators/",
    "backgroundImage": "/backup/headerimage-960x540-2014-04-01-14-10-50.png"
}