{
    "title": "#500Fuerte – Mexican Founders Share Their Startup Stories",
    "slug": "500fuerte-mexican-founders-share-their-startup-stories",
    "date": "2013-04-11T02:18:29.000Z",
    "url": "http://500.co/?p=1116726783",
    "uri": "http://500.co/2013/04/10/500fuerte-mexican-founders-share-their-startup-stories/",
    "postId": "1116726783",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/04/manolopresenting.jpg",
        "http://500.co/wp-content/uploads/2013/04/ricardo.jpg",
        "http://500.co/wp-content/uploads/2013/04/Ricardo-Cacique-and-Dave-McClure-at-Mexican-VC-Demo-Day-March-16-2012-1024x650.jpg"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "fontacto",
        "startups",
        "yogome"
    ],
    "content": "<p dir=\"ltr\">Last week, our Mexico City Venture Partner, <a href=\"https://twitter.com/cesarsalazar\">César Salazar</a>, told you <a href=\"http://500.co/2013/04/05/mexico-the-sleeping-giant/\" target=\"_blank\">why Mexico is shaping up to become one of the biggest markets in the next decade</a>. We’ve had more than a few Mexican founders come through the 500 ranks over the last few batches – here are a few of their startup stories:</p>\n<p dir=\"ltr\"><strong><a href=\"https://twitter.com/manolodiaz\" target=\"_blank\">Manolo Diaz</a>, CEO and co-founder, <a href=\"http://yogome.co/\" target=\"_blank\">Yogome</a></strong></p>\n<p dir=\"ltr\"><a href=\"/backup/manolopresenting-2013-04-10-13-21-18.jpg\"><img class=\"alignleft  wp-image-1116726789\" alt=\"manolopresenting\" src=\"/backup/manolopresenting-2013-04-10-13-21-18.jpg\" width=\"681\" height=\"252\" /></a></p>\n<p dir=\"ltr\">Our story with 500 Startups had an amazing start. We meet Dave at Mexican.VC Demo Day in March last year, and during that week one of our games reached the Top 10 in the app store. I remember watching Dave go to his iPhone after I mentioned that, and it worked because after the presentation, he went directly to us and started asking about our team and our process to make the games. One week later, we were shaking hands to close the formal invitation to the new batch. I will never forget that.</p>\n<p dir=\"ltr\">When the batch started it was like a dream come true. We always wanted to go to Silicon Valley, and now 500 Startups was validating that we had something amazing going on. We've had the opportunity to work with incredible mentors with years of experience, and some of them even decided to be more than that and invest on the company. I really enjoyed all the nights working late with amazing mentors (like <a href=\"http://500.co/mentors/maneesh-arora/\" target=\"_blank\">Maneesh Arora</a>) and getting tacos for dinner while working on distribution. I even invited <a href=\"https://twitter.com/paulsingh\" target=\"_blank\">Paul Singh</a> to an event in Mexico where he had a great time helping other entrepreneurs.</p>\n<p dir=\"ltr\">Having 30 companies from all around the world in the same place working and sharing knowledge is extremely helpful. Especially since sometimes you'll have the answer to someone else's problem, and other times they will have the answer for you.</p>\n<p dir=\"ltr\"><strong><a href=\"https://twitter.com/rcacique\" target=\"_blank\">Ricardo Cacique</a>, CEO and co-founder, <a href=\"http://fontacto.com/\" target=\"_blank\">Fontacto</a></strong></p>\n<p dir=\"ltr\"><a href=\"/backup/ricardo-2013-04-10-13-21-18.jpg\"><img class=\"alignleft  wp-image-1116726787\" alt=\"ricardo\" src=\"/backup/ricardo-2013-04-10-13-21-18.jpg\" width=\"504\" height=\"298\" /></a></p>\n<p dir=\"ltr\">500 Startups was an accelerator in all senses. It was where we met people with bold visions and learned strategies to take over the telecom market in Latin America. The first effect it had on us coming from Mexico was a cultural one. Within a couple of days, we debunked a ton of myths about Silicon Valley. Yes, there is something in the air that makes big things happen in the valley, but it’s ultimately up to you to be successful. It doesn’t matter if you come from a small city in Mexico that people have never heard of and can’t even pronounce (I’m from Queretaro, Mexico); if you work hard enough, you can create stuff that helps millions of people, pushes the limits of the status quo and makes a ton of money.</p>\n<p dir=\"ltr\">500 forced us to optimize for the important stuff: product design, raising money, listening to customers, and building the best cloud phone system for businesses in Latin America.</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"http://500.co/wp-content/uploads/2013/04/Ricardo-Cacique-and-Dave-McClure-at-Mexican-VC-Demo-Day-March-16-2012.jpg\"><img class=\" wp-image-1116726785 aligncenter\" alt=\"Ricardo-Cacique-and-Dave-McClure-at-Mexican-VC-Demo-Day-March-16-2012\" src=\"/backup/Ricardo-Cacique-and-Dave-McClure-at-Mexican-VC-Demo-Day-March-16-2012-1024x650-2013-04-10-13-21-18.jpg\" width=\"614\" height=\"390\" /></a></p>\n<p dir=\"ltr\">500 also accelerated our heart rate (in a good way) in the weeks prior to and during demo days. Dave’s feedback can be tough, but it was exactly what we needed; we were from a different country and really had to stand out to overcome the language and cultural barrier.</p>\n<p dir=\"ltr\">After 500, you become part of a global family of doers, and what I experienced there will always encourage me to do my best. It’s like being in the Space Program – you’re pushing the edge of what is known, and you optimize to succeed not because you have to, but because you can.</p>",
    "type": "post",
    "path": "/2013/04/10/500fuerte-mexican-founders-share-their-startup-stories/",
    "backgroundImage": "/backup/Ricardo-Cacique-and-Dave-McClure-at-Mexican-VC-Demo-Day-March-16-2012-960x540-2013-04-10-13-21-18.jpg"
}