{
    "title": "#500Strong Stories: Facing the Challenges of Being a Female Founder",
    "slug": "500strong-stories-facing-the-challenges-of-being-a-female-founder",
    "date": "2013-03-14T03:32:42.000Z",
    "url": "http://500.co/?p=1116726309",
    "uri": "http://500.co/2013/03/13/500strong-stories-facing-the-challenges-of-being-a-female-founder/",
    "postId": "1116726309",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/03/jacqui-boland-300x225.jpg",
        "http://500.co/wp-content/uploads/2013/03/samantha.png"
    ],
    "creator": "",
    "categories": [
        "founders",
        "gospotcheck",
        "red-tricycle",
        "startups",
        "women",
        "women-founders",
        "womens-day"
    ],
    "content": "In addition to having <a href=\"http://www.500.co/about\">lots of women on the 500 team</a>, we’re proud to say that the startups we support are incredibly diverse, with a healthy mix of male and female founders from nearly every continent. We think it makes the 500 network, stronger, better, and way more interesting. We wouldn’t have it any other way.\n\n<a href=\"http://en.wikipedia.org/wiki/International_Women's_Day\">International Women’s Day</a> was last week, and we were excited to see lots of great stories pop up about women in tech. Being a founder is hard, and female founders have a unique set of challenges that can make things like fundraising extremely difficult (as if it wasn’t already excruciatingly hard!). Some founders in the #500Strong family decided to join the conversation by sharing their experiences – check them out below:\n\n<a href=\"http://500.co/wp-content/uploads/2013/03/jacqui-boland.jpg\"><img class=\"alignleft  wp-image-1116726317\" alt=\"jacqui-boland\" src=\"/backup/jacqui-boland-300x225-2013-03-13-13-21-32.jpg\" width=\"180\" height=\"135\" /></a>\n\n<strong>Jacqui Boland, Founder and CEO, <a href=\"http://redtri.com/\">Red Tricycle</a></strong>\n\n<em>As a first time CEO, I knew fundraising would be tough for Red Tricycle. Raising venture capital is challenging given the best circumstances. </em>\n\n<em>Throw in the fact that I don't have Ivy League/business school credentials, any startup experience under my belt, a deep Valley network (we're based in Marin for pete's sake!) or a technical co-founder. Or even a co-founder. Plus, let's face it, a media company simply isn't sexy in VC world, and I'm slightly older (ahem) than your average accelerator grad. And oh yeah, I'm a woman. </em>\n\n<em>So I expected a hard road. And was not disappointed. I heard quite a few \"no thank you’s,” as well as a few \"you've got to be kidding me’s\" as I made the rounds. 76 to be exact. Sure, some investors I met with were sexist (How many male CEOs get asked if they're going to have any more kids?), some were ageist, and some were elitist. </em>\n\n<em>But fortunately, I stuck around long enough to find open-minded, generous and supportive investors who believed in me and the company i'm building (Thank you 500, Maveron, Zulily, and others). As for the rest?  To quote the brilliant Kathryn Minshew \"if anything, those experiences simply make me more hell bent on succeeding and proving each and every one wrong.\"</em>\n<em>\nMy tips for other female founders:</em>\n\n<em></em><em>- Do your research (TechCrunch, Women2.0. Venture Beat, etc) and find investors who have a history of supporting female CEOs</em>\n\n<em></em><em>- Fundraising is numbers game: the more people you meet with, the more you improve your pitch, become better equipped to answer tough questions, and the more likely you'll find the right investor who believes in you.</em>\n\n<a href=\"/backup/samantha-2013-03-13-13-21-32.png\"><img class=\"alignleft size-full wp-image-1116726319\" alt=\"samantha\" src=\"/backup/samantha-2013-03-13-13-21-32.png\" width=\"136\" height=\"158\" /></a>\n\n<b id=\"internal-source-marker_0.5717910840176046\"> Samantha Holloway, Co-founder and CSO, <a href=\"http://www.gospotcheck.com/\">GoSpotCheck</a></b>\n\n<em>I've been asked a lot recently about my experience as a female co-founder, and how it might differ from the experiences of my other (male) co-founders. I run sales for us and have gone to many fundraising meetings as well, and I have never been treated that differently than my male co-founders. Maybe I'm luckier than some others have been, but I don't really believe in luck. The first five seconds you meet someone is usually the time it takes for him or her to make a judgment about you, so I always make that count. It may be more important for women to be confident, to the point, and sound intelligent, but shouldn't we be doing all of that anyway?</em>\n\n<em>Don’t get me wrong, I have had experiences where I have been treated differently because I’m female, it just hasn’t been specific to co-founding a startup. A few years ago I dyed my hair dark brown (I'm very blonde). I had dark hair for almost a year, during which time I literally noticed people (men) would speak to me differently. Insane, I know, but it appeared as though I was perceived as being more intelligent than when I had blonde hair. It was an amazing social experiment. I wasn’t upset by it, if anything it made me more aware of my initial judgments of others.  </em>\n\n<em>These types of everyday judgments are part of human nature and we need to learn the ways we can act to combat them, even if it means having to prove we are smart enough to have a seat at the table. Maybe I’m more understanding because I have a Psychology background, or maybe I’m just realistic and understand that men and women are different and perceive each other differently. Either way, I think all of us female founders have a unique opportunity to learn from these experiences, share them, and most importantly, keep up the good work.<b id=\"internal-source-marker_0.5717910840176046\"></b></em>\n\nWe hope their stories inspire you to keep pushing forward and preserving. Being a female founder is tough, but it can be done. <strong>We’ll have more experiences from founders later this week, so stay tuned!</strong>",
    "type": "post",
    "path": "/2013/03/13/500strong-stories-facing-the-challenges-of-being-a-female-founder/",
    "backgroundImage": "/backup/IMG_7602-960x540-2013-03-13-13-21-32.jpg"
}