{
    "title": "6 Ways To Steal Your Competitor's Audience",
    "slug": "6-ways-to-steal-your-competitors-audiance",
    "date": "2013-06-25T16:54:59.000Z",
    "url": "http://500.co/?p=1116728135",
    "uri": "http://500.co/2013/06/25/6-ways-to-steal-your-competitors-audiance/",
    "postId": "1116728135",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/06/comp1.jpg"
    ],
    "creator": "",
    "categories": [
        "competition",
        "distribution",
        "distribution-tuesday"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em>\n\nCompetition is healthy, but completely decimating your competition is healthier, especially for your bottom line. So how can you siphon off some your competitor's audience to grow your own product? By using a few old tricks and bending a few rules, of course. Here are a few ideas to get you started:\n<h2>Look Under the Hood</h2>\nOver the years, I have gleaned a ton of insights from my competitors by simply hitting “View Source” on their websites. In some cases, their marketing and audience development techniques were right there in plain sight. Look for tracking pixels in the footer of the website that reveal what ad partners they’re working with. Sometimes this can also reveal other valuable information, such as how they A/B test their website.\n\n<img alt=\"\" src=\"/backup/comp1-2013-06-25-13-11-54.jpg\" width=\"200\" height=\"202\" align=\"right\" />\n<h2>Google Alerts</h2>\nThis one seems so simple, but for some reason many people skip it. Setting up <a href=\"http://www.google.com/alerts/manage\" target=\"_blank\">Google Alerts</a> for your competitor’s brand and/or domain names is the quickest and easiest way to monitor their marketing campaigns, and you get results in real time. This is especially useful if your competitor does a lot of blogger outreach. Now you can follow with a similar (or better) offer and try to convert their bloggers into your own. Be sure to select the “All results” option under volume when you set up your alerts.\n<h2>SEO Tracking</h2>\nBy far the best way to track your competitors' Google rankings (not to mention your own) is with <a href=\"http://moz.com/\">MOZ.com</a>. The site offers a simple dashboard that lets you compare keyword rankings over time with several competitors. This tracking service is available to members only, and pricing starts around $99 per month. However, anyone can use their Open Site Explorer to get high-level details about how they compare to a competitor. See how you stack up or uncover potential SEO honeypots your competition has already discovered.\n<h2>Broken Link Redirects</h2>\nIf your competitor is a big old dinosaur, there’s a good chance that at least some links on the company's website point to expired domains. What’s to stop you from purchasing those old domains and redirecting the URL to your homepage? It’s a dirty trick, sure, but it works, and the fact is the competition is not likely to ever notice. <a href=\"http://stackoverflow.com/questions/65515/how-to-find-broken-links-on-a-website\" target=\"_blank\">This thread on Stack Overflow</a> has several techniques for finding some breakage.\n<h2>Ad Spend Tracking</h2>\nAd spend tracking has been around for a while now. With it, you can track your competitor’s media spend across platforms like AdWords, Facebook, and various display networks. You can also get copies of ad creative used. That way you can get a head start on your own ads by understanding what is already resonating with your competitor's audience. You may also find some new ad channels and techniques to target the same customers they are already targeting. Some the time-tested tools to track ad spend include <a href=\"http://www.spyfu.com/\" target=\"_blank\">Spy Fu</a>, <a href=\"http://www.keywordspy.com/\" target=\"_blank\">KeywordSpy</a>, and <a href=\"http://www.whatrunswhere.com/\" target=\"_blank\">What Runs Where</a>.\n<h2>Scrape It Till You Make It</h2>\nMany a startup has used some form of scraping to get that initial push. I would list them all, but I would probably need to build a scraper to go out and find all the countless tales. Scraping might not be the most glamorous way to start a business, but it’s damn effective. Let’s say you have an opportunity to gather email addresses, Facebook IDs, or other similar data from your competition. Do it. If you need some help getting started, reach out to my friends over at <a href=\"http://scrapinghub.com/\" target=\"_blank\">The Scraping Hub</a>. It’ll be our little secret.\n<p style=\"text-align: center\"><strong>Are you a 500 company who needs help with distribution? <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">Let's talk</a>.</strong></p>",
    "type": "post",
    "path": "/2013/06/25/6-ways-to-steal-your-competitors-audiance/"
}