{
    "title": "7 Ways to Know Your Startup Is Ready for PR",
    "slug": "7-ways-to-know-your-startup-is-ready-for-pr",
    "date": "2014-04-02T18:02:32.000Z",
    "url": "http://500.co/?p=1116732031",
    "uri": "http://500.co/2014/04/02/7-ways-to-know-your-startup-is-ready-for-pr/",
    "postId": "1116732031",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2014/04/IMG_5658.jpg"
    ],
    "creator": "",
    "categories": [
        "airpr",
        "embargo",
        "pitching",
        "pr",
        "press-2",
        "startups",
        "tips"
    ],
    "content": "<em>The following post was contributed by Leta Soza, PR Engineer at <a href=\"http://airpr.com\" target=\"_blank\">AirPR</a>. Follow her <a href=\"https://twitter.com/LetaSoza\" target=\"_blank\">@LetaSoza.</a></em>\n<p style=\"text-align: center;\"><a href=\"/backup/IMG_5658-2014-04-02-14-12-02.jpg\"><img class=\"size-full wp-image-1116732037 aligncenter\" alt=\"IMG_5658\" src=\"/backup/IMG_5658-2014-04-02-14-12-02.jpg\" width=\"390\" height=\"260\" /></a></p>\nYou have a big launch coming up, and you couldn’t be more excited to share your news with the world! Before you start pitching senior reporters or enlisting the help of an agency to do so, ask yourself: Are you really ready to fulfill your end of the bargain?\n\nHolding a quick audit of your PR tool belt will help ensure that you’re equipped with everything you need to build your narrative and supply journalists with the glue that’ll keep ‘em coming back for more. Remember, how you lay this foundation of initial outreach will affect your company’s lifelong relationship with press.\n\nRead through this checklist to see if you’re ready to show off what you’ve been building.\n<ul>\n\t<li><b>You’ve established a narrative and built key messaging.</b> Have you invested time and effort in building a narrative, fine-tuning brand messaging, and outlining key talking points? What anecdotes will you turn to when you’re asked for a quote on the fly? How will you position your brand among industry trends, and what makes you stand out from competitors? Without concrete, established messaging, you’re essentially throwing your strategy to the wind.. Remember — PR is an investment, so take the time to do it right like you would any other area of your business. Take the time to really think about your positioning before your big PR push.</li>\n</ul>\n<ul>\n\t<li><b>You’ve got enough money in the bank for a proper, comprehensive PR budget. </b>If snacks and desks seem like distant dreams, you should probably invest your time and money in other parts of your business. A solid PR budget for a startup will run between $3-7k/month depending on the PR pro or firm you hire. Also, be sure to temper your expectations. Just because you turn on the PR hose doesn’t mean big coverage will start tomorrow. It can take up to 2 months to start to see media hits so plan product launches accordingly. Give yourself enough time to formulate a comprehensive strategy.</li>\n</ul>\n<ul>\n\t<li><b>You’ve designated a point person to manage outsourced PR.</b> Whether it’s your social media/content lead or another person on your team, you need to have someone on staff who will take ownership of outsourced PR to ensure timeliness and transparency. <a href=\"http://readwrite.com/2014/02/25/why-every-tech-company-needs-an-english-major\" target=\"_blank\">Quality storytelling can make or break a company</a>, so be sure your intermediary is able to guide your brand’s narrative and understands the needs of your company</li>\n</ul>\n<ul>\n\t<li><b>Your spokesperson has been coached and is ready to rock. </b>You can’t “do PR” without a great spokesperson, and it’s essential that this person feels confident in their delivery. Their job: deliver key messages and shine a flattering light on the company while remaining authentic. This person should be a founder or someone else who is able to articulate what makes your company different. Abve all, make sure this person is media trained, prepped for interviews, and ready to shine.</li>\n</ul>\n<ul>\n\t<li><b>You can prove how you’re different. </b>Does your product have any unique bells or whistles that can <span style=\"text-decoration: underline;\">show</span> rather than tell? What anecdotes can you share with reporters that support the claims you’re making? Think about every customer touch point as a piece to the active-PR puzzle. From <a href=\"http://www.rsed.org/campusuite/errors/error404.cfm?404;http://rsed.org:80/alskksALSKDFJADS\">a memorable 404 page</a> to an example of how your team made a customer's lifelong dream come true, having solid examples to show <strong>why</strong> you’re different will solidify whether you’re newsworthy or not.</li>\n</ul>\n<ul>\n\t<li><b>You’re ready to tout exclusivity. </b>Every reporter likes to feel like they’re getting something special. Are you okay with <a href=\"http://blog.airpr.com/dont-embargo-my-love/\">saving the news for a one-and-only</a> or small group of reporters? Just make sure it’s something worth their time and be respectful by starting conversations early in the game.</li>\n</ul>\n<ul>\n\t<li><b>You know that PR is a team effort, and that <span style=\"text-decoration: underline;\">every employee is a brand advocate</span></b>. Sure — most employees will not be speaking to the media, but embracing the fact that they all deliver messaging via their respective channels is paramount to building a cohesive narrative. From your social media team to your customer care specialists, all employees should be on the same page when it comes to overarching messaging. Everyone should know where to funnel media inquiries. It’s not a bad idea to add PR 101 to on-boarding orientations or hold an all-hands meeting on the topic.</li>\n</ul>\nNow that you know what should precede heavy PR outreach, map out a timeline for achieving these foundational steps Happy pitching!",
    "type": "post",
    "path": "/2014/04/02/7-ways-to-know-your-startup-is-ready-for-pr/",
    "backgroundImage": "/backup/pR-960x540-2014-04-02-14-12-02.jpg"
}