{
    "title": "8 Things You Must Do To Support Pregnant Startup Employees",
    "slug": "8-things-you-must-do-to-support-pregnant-employees",
    "date": "2014-02-26T16:24:36.000Z",
    "url": "http://500.co/?p=1116731617",
    "uri": "http://500.co/2014/02/26/8-things-you-must-do-to-support-pregnant-employees/",
    "postId": "1116731617",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "founders",
        "pregnancy",
        "pregnant",
        "startups",
        "startups",
        "vc",
        "women"
    ],
    "content": "A few months after my first child was born, I wrote a post likening parenthood to entrepreneurship called \"<a href=\"http://techcrunch.com/2011/12/18/startuphood-and-parenthood-not-for-the-faint-of-heart/\" target=\"_blank\">Startuphood and Parenthood: Not for the Faint of Heart.</a>\" Two and a half years later, I'm expecting my second. I was quite guarded about my first pregnancy (especially on social media), so aside from that blog post, I shared very little about the experience. This time around, I've been much more open about it and felt inspired to write thoughts and observations I've had over the last few months.\n\nGiven the endless controversy about sexism, women in tech, working moms, women founders, gender roles, etc, I was initially hesitant to write this post. Anything and everything is fuel for someone's fire. However, it's important to be vocal about these things (in a constructive manner, of course) and put it out there. Being a pregnant VC may sound less than desirable, given how male dominated the industry is. You could argue the same applies to tech companies and startups. There are tales of companies not wanting to hire women of a certain age for fear they'd get pregnant and be out of commission for a few months. As we see more women running companies, in leadership roles, and also on the other side of the table as investors, this will hopefully become a non-issue.\n\nCompanies like Google and Facebook offer great maternity and paternity leave. However, when you're a startup, it can be nebulous especially if you've never had a pregnant employee on the team. Many startups don't have a maternity (or paternity) leave policy in place. But as your company grows and/or women on the team have children, this changes. In fact, more than just coming up with a policy, it's absolutely critical to ensure that you retain these employees. The last thing you want is to lose talent because your company culture is a hindrance to parents.\n\nWith that, here are a few tips I've come up with (in no particular order). My suggestions have more to do with how to treat expectant moms versus how to develop your actual leave policy:\n<h2>1. Uphold a company culture that supports pregnancy and working parents</h2>\nThis is first and foremost the most important thing, because once you have this then everything else falls in line. Oftentimes companies (especially small ones, where resources are stark) will view pregnancy as a burden. Some are even reluctant to hire women for that reason, especially married women of childbearing age. Don't be that company. You'll only do yourself a disservice and miss out on amazing talent.\n<h2>2. Be flexible</h2>\nPregnant women have to somehow make it through the day and also deal with physical changes, unpleasant symptoms of pregnancy, and a barrage of doctors' appointments and lab tests that will often happen during work hours. If you need to re-arrange meetings or schedule around your team member's appointments, do it. These appointments are all important and oftentimes are time-sensitive.\n<h2>3. Do not make assumptions or decisions on her behalf</h2>\nWe all make assumptions about pregnant women, either based on having been through it directly, indirectly, or pure conjecture. \"She's probably too tired to do X,\" \"She's not going to want to travel because she's pregnant,\" \"Her due date is Y so she won't want to take this on so I'll ask someone else to do it,\" etc. While your intentions may be good, this is something every expectant working mom fears - being phased out. I'll put myself out there and admit this has/is a fear of mine. Let her be the one to decide whether something's too much for her to handle or not. Let her lead the conversation and decision making around what her maternity leave plan is, especially if it has to do with transitioning work and hiring people - or at the very least, make sure she is directly involved.\n<h2>4. Assume that pregnancy changes nothing about her role in the company</h2>\nI'll refrain from opening a can of worms and get into the working mom vs. stay-at-home mom debate. But from personal experience and from the many working moms I know, we'd rather that people assume we're going back to work after maternity leave. In fact, some women will actually want to stay plugged in with what's going on while they're on leave. Don't question whether she's returning to the company once the baby arrives. Don't be an asshole and take the position away from her while she's out.\n<h2>5. Offer awesome maternity leave</h2>\nThere is a minimum requirement every state mandates for companies (usually of a certain employee size). My 2 cents - of course companies should comply with what their state law requires. However, depending on the state, it might be rather stingy and it’s in your best interest to go above and beyond what you’re “required” to do. Startups may think they can't afford to have an employee out for too long, let alone pay them during that time. But remember that it's temporary and most likely it won't have a significant impact on the bottom line if you were to (for example) provide fully paid leave. Being as generous as possible will go a LONG way in both retaining and attracting talent for both moms and dads. Also, good employees will feel just as invested in making sure things don't go awry while they're out and not leaving teammates in the lurch.\n<h2>6. Do NOT touch her stomach</h2>\nThis may seem like common sense. But many people don't get it. Yes, it’s not every day you see a round, beach-ball shaped stomach. But think of it this way – would you touch her stomach if she weren't pregnant?\n<h2>7. Remember the dads</h2>\nPregnancy is usually all about the mom because she's the one carrying the baby for 9 months. However, realize that expectant dads are going through a lot too. I love the fact that Facebook offers equal leave for moms and dads. Consider that for your company. Offering unequal leaves just reinforces the longstanding notion that parenting responsibilities aren't equal, and that doesn’t help anyone.\n<h2>8. Remember that It doesn’t just end with maternity leave</h2>\nI’ve heard of companies offering great maternity/paternity leave, only to be oddly inflexible when it comes to working parents’ schedules. This all goes back to your company culture. You may have a company where telecommuting, leaving the office early, and working from home are frowned upon. That’s your prerogative. But if you want to be more inclusive of working parents, then revisit these policies and make it easier for parents to juggle their two full-time jobs. (Yes, parenting is a full-time job even if you work at a company too) And extra brownie points if you set up a mother’s room for moms when they return to the office! (500 did)\n\nThoughts or suggestions? Post a comment below!",
    "type": "post",
    "path": "/2014/02/26/8-things-you-must-do-to-support-pregnant-employees/",
    "backgroundImage": "/backup/pregnant-960x540-2014-02-26-14-10-24.jpg"
}