{
    "title": "A Sense of Déjà Vu: Why focusing on monetization is critical for mobile app developers. ",
    "slug": "a-sense-of-deja-vu-why-focusing-on-monetization-is-critical-for-mobile-app-developers",
    "date": "2011-02-10T03:41:32.000Z",
    "url": "http://blog.500startups.com/?p=1116714961",
    "uri": "http://500.co/2011/02/09/a-sense-of-deja-vu-why-focusing-on-monetization-is-critical-for-mobile-app-developers/",
    "postId": "1116714961",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/02/luckyluke-150x150.jpg",
        "http://500.co/wp-content/uploads/2011/02/michaeloiknine-150x150.jpg"
    ],
    "creator": "",
    "categories": [
        "android",
        "apple",
        "apsalar",
        "guest-posts",
        "ios",
        "iphone",
        "lucky-luke",
        "mentors",
        "mentors",
        "michael-oiknine",
        "mobile",
        "mobile-analytics",
        "mobile-apps",
        "mobile-monetization",
        "platforms",
        "startups",
        "tips"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/02/luckyluke.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714962\" title=\"luckyluke\" src=\"/backup/luckyluke-150x150-2011-02-09-11-21-41.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2011/02/michaeloiknine.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714963\" title=\"michaeloiknine\" src=\"/backup/michaeloiknine-150x150-2011-02-09-11-21-41.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet Lucky Luke aka 500 SuperMentor and Founder Michael Oiknine (<a href=\"http://twitter.comapsalarinc\" target=\"_blank\">@apsalarinc</a>).  Michael is co-founder &amp; CEO of <a href=\"http://apsalar.com\" target=\"_blank\">Apsalar</a>, a behavioral targeting and analytics platform for mobile apps.  Prior to Apsalar, Michael was co-Founder &amp; COO of Kefta, a SaaS provider of online behavioral targeting solutions (acquired by Acxiom in March 2007).</em>\n\nIn the mid-90s, when the web was in its infancy, the entrepreneurs of the time made a big mistake. They focused too much on the wrong metric for their business: the number of new users in a given period. These startups raised large amounts of cash, but instead of focusing on the value provided by their product or on the user experience, they engaged in a spending spree to acquire users, or “eyeballs,” as we used to call it. I was there to see this model implode, and don’t want to see history repeated in the mobile app environment.\n\nEvery conceivable method of getting eyeballs was explored, often at great cost. The rationale was, “Let’s get users and we’ll have time later to figure out how to monetize them. Worst case scenario, we’ll generate advertising revenues which we know are higher when your user base is bigger.” With such a lack of actionable foresight on the part of the business, the only folks who ultimately profited were TV networks, the billboards on Highway 101 in the Bay Area, and the portals of the time: Yahoo, AOL and MSN. Similar, and worse, cautionary tales abound of good ventures gone bust because their founders hadn’t secured sustainable monetization avenues before the subsequent sharp decline in advertising spending.\n\nThe same flawed logic is currently being applied to the mobile app market, with nearly all discussion centered on number of downloads. The metric du jour seems to be “download velocity,” but not nearly enough thought is given to the question of what happens next. The current crop of bright young entrepreneurs (most too young even to have witnessed the previous bust) needs to look to the past to improve upon the future.\n\nMobile app publishers must get serious about monetization—making money rather than spending it needlessly. With few exceptions, publishers need to find ways to generate revenue on a per-user basis that is higher than the cost of acquiring those users. This is the only way to build a sustainable business and separate yourself from the competition, thus giving you more leeway to acquire (profitable) customers. Shortsighted publishers run the risk of falling into the same trap as their web predecessors.  The solution is: replace the metric of ‘download velocity’ with a user-centric metrics, such as conversion, retention, and lifetime value.\n\nLet’s first look at three strategies for app monetization:\n\n<strong>Strategy #1: Ads</strong>\n\n<strong></strong><em>Best for: Consumer apps with large audiences (ex. Pandora); highly targeted apps</em>\n\nSome mobile app publishers will be able to monetize with ads, but unless your app is a big consumer mobile app with a large audience or a highly targeted app within a vertical, it’s not your best bet.\n\n<strong>Strategy #2: In-app transactions</strong>\n\n<em>Best for: Mobile commerce apps; gaming apps; lead gen apps; publishers with a large number of apps in their portfolio</em>\n\nThanks to in-app purchases, iOS (and soon Android) developers are starting to scratch the surface of in-app transactions. We see a lot of digital goods in-app purchases, but developers could also cross sell to another portfolio app, up-sell to a pro version of their app, or generate leads. (In-app transactions encapsulate more than just in-app purchases. Consider lead generation; the transmission of information is a very powerful, and monetize-able, transaction.)\n\n<strong>Strategy #3: Subscription models</strong>\n\n<em>Best for: Content (e.g. magazine, newspaper) apps; professional &amp; consumer services apps (e.g. Life 360); telecom apps (e.g. Skype)</em>\n\nGood examples currently come from telecom apps, but expect the subscription trend to pick up. Subscription models help developers increase the life value of their customers. The key success factors here will be lowering customer acquisition costs and reducing churn over time. And don’t forget pricing strategy—monthly trials or free offers will be valuable approaches.\n\nWith your monetization strategy in place, you now need to measure its effectiveness at each user level.  Your app produces tons of user data.  This data, if analyzed properly, can be used to maximize your monetization strategy by enhancing user engagement, profitably growing your user base and most importantly increasing revenues.  Fortunately, there are plenty of best practices that were built on the web of yesterday to help the mobile app publishers of today.  Let me share two of them that are key:\n\n<em><strong>1. Conversion Funnel Analysis</strong></em>\n\nA conversion funnel is a sequence of steps that a user is expected to take in order to reach a specific conversion goal. Note that the steps of a conversion funnel can all belong to the same mobile application, a.k.a. in-app conversion funnel, or can span multiple mobile applications, a.k.a. cross-app conversion funnel. An example of a conversion funnel could be one that has an in-app purchase as the goal, with the steps (in order) being start a game, reach level 1, view a digital good offer, and click on offer.  Understanding how users are converting on this in-app purchase, and more importantly how you can increase these conversion rates is critical to the success of any app.\n\n<strong> 2. <em>Cohort-based Engagement Analysis</em></strong>\n\nThis kind of engagement analysis will allow you to manage user engagement by grouping users into “cohorts,” or groups of people sharing common experiences within a defined period of time, and tracking their unique behaviors over time. Cohort examples are groups of users who started using your mobile app within a specific week, or groups of users who reached level 1 of your game for the first time within a specific week. The business goal for an engagement analysis could either be to increase retention of users in your mobile application or to increase monetization of users in your mobile application. For instance, you can optimize retention by focusing on a retention-related engagement metric such as ’searching for a product’, whereas you could optimize monetization by focusing on a monetization-related engagement metric such as ‘completing an in-app purchase’.  Either way, you are gaining important insights into user behaviors.\n\nConversion funnels and cohorts are two examples of user-centric analytics to be used when monetizing your mobile apps.  They each produce valuable and actionable knowledge that can improve retention and revenues in your mobile apps.  There are other tools available that mobile app developers can use to understand what their users want, and then cater to them in a way that links user engagement to recurring revenues.  This is a good time to get serious about engagement and monetization.\n\n<em>Today, mobile distribution platform <a href=\"http://tapjoy.com\" target=\"_blank\">Tapjoy </a>announced an analytics partnership with Apsalar. <a href=\"http://venturebeat.com/2011/02/09/tapjoy-launches-way-for-advertisers-to-pay-for-engagement-in-mobile-games/\" target=\"_blank\">Read about it here</a>.</em>",
    "type": "post",
    "path": "/2011/02/09/a-sense-of-deja-vu-why-focusing-on-monetization-is-critical-for-mobile-app-developers/"
}