{
    "title": "Acquisitions: Pulling Back the Covers - Part 1",
    "slug": "acquisitions-pulling-back-the-covers-part-1",
    "date": "2010-10-07T21:38:47.000Z",
    "url": "http://blog.500startups.com/?p=1116714245",
    "uri": "http://500.co/2010/10/07/acquisitions-pulling-back-the-covers-part-1/",
    "postId": "1116714245",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/10/riddler-150x150.jpg",
        "http://500.co/wp-content/uploads/2010/10/ryanjunee-150x150.jpg",
        "http://500.co/wp-content/uploads/2010/10/termsheet.jpg?w=300"
    ],
    "creator": "",
    "categories": [
        "acquisitions",
        "ex-googler",
        "ex-youtuber",
        "google",
        "guest-posts",
        "mentors",
        "mentors",
        "omnisio",
        "riddler",
        "ryan-junee",
        "tips",
        "youtube"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2010/10/riddler.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714297\" title=\"riddler\" src=\"/backup/riddler-150x150-2010-10-07-10-16-38.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2010/10/ryanjunee.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714300\" title=\"ryanjunee\" src=\"/backup/ryanjunee-150x150-2010-10-07-10-16-38.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet <strong>The Riddler</strong>, the first 500 Startups super-mentor to make an appearance on this blog. The Riddler, aka </em><em><a href=\"http://ryanjunee.com/\" target=\"_blank\">Ryan Junee</a>, is a </em><em>serial entrepreneur and start-up advisor by day. By night, he schemes complex riddles to trick fellow entrepreneurs and unwitting technophiles. He is currently working on an as-yet-unlaunched startup. His previous company, Omnisio, developed innovative ways to edit and enhance online videos and was acquired by Google/YouTube in 2008. In this post, Ryan pulls back the covers on acquisitions and shares his adventures from Omnisio.</em>\n\n<a href=\"http://500.co/wp-content/uploads/2010/10/termsheet.jpg\"><img class=\"alignnone size-medium wp-image-1116714247\" title=\"termsheet\" src=\"http://500.co/wp-content/uploads/2010/10/termsheet.jpg?w=300\" alt=\"\" width=\"300\" height=\"168\" /></a>\n\nTo many entrepreneurs, the process of getting acquired seems like a black box.  I suspect this is because far fewer acquisitions happen than, say venture financings (about which <a href=\"http://venturehacks.com/archives\" target=\"_blank\">a lot</a> has been written), so there are a lot less data.  Also there are generally very strong confidentiality agreements in place protecting the terms of these deals.\n\nI'd like to write a little about this topic since it's something I'm often asked about, but bear in mind I too am bound by confidentiality agreements regarding <a href=\"http://techcrunch.com/2008/07/30/google-acquires-omnisio-to-spice-up-youtube/\" target=\"_blank\">the sale of my company</a>, so I won't be able to go into the specifics of our deal.\n\nThis is a two-part post.  In this first post I'll talk about deciding whether to sell your company and some of the key things you and your team need to think about.  In the next post, I'll talk more about the actual negotiation process.\n\n<strong>Context</strong>\n\n<strong></strong>To set the context, I'll say up-front that my advice is aimed at technology companies (particularly web and software companies) who are selling quite early in their lifecycle.  The reality is that acquisitions of this type are usually <strong>talent acquisitions</strong>.  We've seen a huge amount of acquisition activity this year, with large companies picking up small teams working on cool new products.  This is in large part due to the fact it's very difficult to hire good engineers right now.  Big companies and small startups alike are feeling the pain.  One avenue available to big companies with deep pockets is to acquire early stage startups in order to hire their engineers and product folks, effectively paying them a very nice signing bonus.\n\nTake a look at <a href=\"http://www.scores.org/graphics/google/\" target=\"_blank\">this graphic</a> depicting Google's acquisitions, and notice how the small acquisitions far outnumber the large ones.  Keep in mind that acquisition prices are almost never disclosed so these are just rumored prices, but likely in the right ballpark.  This graphic chalks up most of the smaller acquisitions as 'technology' acquisitions, but I'm willing to bet most were actually done to acquire talent (I don't have any inside information on this fact).\n\nWhat exactly is a talent acquisition?  Usually it involves valuing the company based on the number of engineers and product folks that will join the acquiring company.  Something like $1-$2M per engineer would not be unheard of.  The money is generally paid in installments, with some paid upfront and some paid out over a period of 2-4 years.  From the acquiring company's perspective these are basically signing and retention bonuses, although the deal may be structured formally as an acquisition (stock purchase).  If the company has outside investors, they will probably get paid their share upfront with no payments held back, since they aren't joining the acquiring company.\n\nSo that sets the context for the rest of this post.  If you are running a rapidly growing business and/or one generating a healthy cash flow, then you are in a different ballpark and <a href=\"http://horizonpartners.com/article/timing-ma-part-iv-qualifying-buyers\" target=\"_blank\">other posts</a> will probably be more relevant to you.\n\n<strong>Should You Sell?</strong>\n\nA lot has been written lately about the good and bad of selling out early vs swinging for the fences and trying to create the next billion dollar business.  I don't want to rehash the philosophical and macro-economic arguments, but instead focus on the personal decision of the entrepreneur.  This is a very important personal question that every entrepreneur who finds themselves in this position must answer.\n\nDespite the current thread of \"dipshit companies selling out early\" reverberating in the blogosphere, I don't think any entrepreneur should ever feel bad about selling his or her company.  If you look at the range of possible outcomes for a startup, selling early is still on the high-end.  Sure you could do even better and have a YouTube sized exit, but those are very rare.  Selling, even for a small amount, still puts you FAR above the majority of startups whose likely outcome is failure. Remember that you are the entrepreneur and <strong>this is your company.</strong> You took the risk to start it, you worked hard, and now you are rewarded with the option to sell should you wish to.  This is your decision to make, you earned it.  Theodore Roosevelt summed up this sentiment brilliantly in 1910:\n<blockquote><em>\"It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat.\"</em></blockquote>\nSo with that out of the way, should you sell?  First look at your motivations as an entrepreneur.  You may be in this for the money, or to change the world, or more likely some combination of both.\n\nIf your primary goal is to change the world, you need to decide if you can best achieve your goal by continuing with your current company or taking an exit and then starting something new in a few years.  Some inputs to this decision will be how passionate you are about the work you are currently doing, and how good the offer is.  The best laid schemes of mice and men often go awry, and it's certainly possible that a year or two into your business you aren't achieving the success you imagined at the start.  You have to really try and evaluate whether continuing what you are doing now is your best shot vs starting from scratch again.  At least you have some sense of the odds with what you are working on now; starting afresh is a shot in the dark.\n\nIf money is your primary goal, it's important to realize that we don't have constant utility of money.  Going from a net worth of zero to $1M, $5M or $10M feels a lot different than going from $10M to even $50M or $100M.  There are several life changing thresholds you can cross, for example getting out of debt, owning your own house outright, never having to worry about work again.  These things can significantly change your life, and beyond that the differences are more like do you own your own private jet or your own island chain.  Going from 'starving entrepreneur' constantly worrying about making rent and skimping on food, to being comfortable and free to do whatever you want - that's a big deal.  Taking an early exit can put you in this position, and give you the time and flexibility to start whatever company you want next time around.  In fairness, if you stick with your current company you may also have an option to take some cash off the table when you raise a VC round.  This practice is becoming more and more popular.\n\nI'll end this section by saying it's definitely not an easy decision to make.  It wasn't for us.  We ended up weighing a bunch of factors like those above, as well as the prospects for our company going forward given we were pre-revenue and the funding environment was looking quite shaky (we were one of the last companies Google acquired before the economy collapsed, and so in hindsight our timing impeccable).  We also worried about potentially competing with Google/YouTube because we knew they were developing similar products internally.\n\nAs you can see there's no simple answer to the 'should you sell' question.  It's very complex and nuanced.  The important thing to remember is that it's your decision to make as an entrepreneur.  Don't listen to the people on the sidelines who really have no idea what you are going through.\n\n<strong>Closing Doors</strong>\n\nThis seems like an appropriate point to mention that there are certain actions you can take as an entrepreneur that will prevent you from even getting the opportunity to make this decision.  Specifically, if you decide to take VC funding, or perhaps even angel funding, you may close the door to an early stage exit.\n\nIn a talent acquisition, the acquiring company is paying for you to join them.  If they have to pay large amounts to outsiders who aren't going to join the company, that means they either have to pay more for the deal overall, or pay the founders less making them less incentivized to take the deal and/or stay at the company.  VCs almost always have the power to veto a sale of your company, and will likely do so for an early exit because the nature of their portfolio investing approach means they need companies to swing for the fences.\n\nIn our case we hadn't taken much external investment and the founders owned most of the company, which meant that we at least had the option to sell if we wanted to.  When raising money it's always good to think about what implications it will have on your exit opportunities.\n\n<strong>How to Sell Your Company</strong>\n\nIf you've decided you want to sell your company and you don't yet have an offer on the table, you are surely wondering how to go about getting one.  Unfortunately, the answer is <strong>don't try.</strong>\n\nAs the saying goes, \"<em>companies are bought and not sold</em>\".  This means it is best to focus on building and managing your company as an independent and successful business, rather than trying to convince other companies to buy you.  In this way it's kinda like dating.  The more valuable you are as a company, the more interest others will have in you.  Also keep in mind that you can't control the circumstances of other companies, such as whether they are acquiring or not and what type of deals they are looking for.  What you can control is your own company, so focus on that.\n\nOf course, it's not just that simple.  Companies have to somehow find out about you if they are going to approach and make an offer.  Big companies are often looking for diamonds in the rough, but there's a lot of rough out there so you have to somehow get their attention. This is where the value of a startup hub like Silicon Valley is quite evident.  A large number of deals happen based on who you know.  The initial introduction of your company to a potential acquirer is likely to be by a mutual acquaintance, which is why networking is so important as I mentioned in my <a href=\"http://startups.ryanjunee.com/an-introduction-to-silicon-valley\" target=\"_blank\">previous post</a>.  Of course you can't really plan for this, but you can make it easier for serendipity to strike by simply getting to know a lot of people while you build a great company.\n\nThese days there are certain places acquisitive companies can look that have a higher concentration of diamonds, such as programs like <a href=\"http://ycombinator.com/\" target=\"_blank\">Y Combinator</a>.  Being part of a program like this is good way to get the attention of acquiring companies.  While the folks at Y Combinator don't encourage founders to sell early, they do encourage the founders to make their own decision and so you do see a number of Y Combinator companies getting picked up quite early.\n\nWhat would be considered a diamond?  Acquiring companies are generally looking for a cool product/technology that is somewhat synergistic with their business.  However, this is more of a proxy to prove that the team is smart and capable of executing, and shares a similar vision.  It is quite possible that the acquiring company will not want to continue offering your product once you join.\n\n<strong>Pick a Number</strong>\n\nSo you've got tentative interest from an acquirer, what should be your first step?  You should absolutely sit down as a team and come up with 'the number'.  This is the absolute minimum price you will accept for your company.  How much it's going to take to give up on your dream?  Once your company is acquired, you will no longer be in control and the acquiring company can do anything they like with the product - which includes shutting it down.  Come up with your number under the assumption that this will happen.  Your baby is gone.  How much is it gonna take?  And really think about what your <strong>minimum </strong>is - if you would take even $1 less that is not your minimum.  It's important to have a very open discussion with your cofounders, and have this number set in stone.  Later during the heat of negotiations you will face serious temptations, but if you've thought about this minimum number in advance in a calm and rational way you confident in walking away from the deal if the acquirer does not meet your price.  I mean this - you have to be prepared to say \"thanks for your time\" and walk away, which I can tell you is damn hard to do.  But it's never a good idea to start lowering this number during the negotiation process when you might not be thinking clearly.  Don't succumb to temptation and do something you may regret later.\n\nOf course 'the number' is not just a single number.  There are terms attached, such as whether the payment is in cash or stock (and how you value the stock of the acquiring company), how much is paid upfront and how much is held back, the period over which it is paid, your new role, salary and terms of your employment etc.  It's also perfectly rational to have a different 'number' for each acquirer, in the case that you have multiple offers.  Naturally you will be more excited about working at some places than others.\n\nBe sure to hash all of this out with your team before you embark on the actual negotiations.\n\nIn a separate upcoming post, I'll talk about what to expect in the negotiation process, the importance of lawyers and advisors, and some of the key terms you should worry about. (UPDATE: <a href=\"http://500.co/2010/10/10/acquisitions-pulling-back-the-covers-part-2/\">Part 2 is now published</a>)",
    "type": "post",
    "path": "/2010/10/07/acquisitions-pulling-back-the-covers-part-1/"
}