{
    "title": "Acquisitions: Pulling Back The Covers - Part 2",
    "slug": "acquisitions-pulling-back-the-covers-part-2",
    "date": "2010-10-10T16:43:47.000Z",
    "url": "http://blog.500startups.com/?p=1116714314",
    "uri": "http://500.co/2010/10/10/acquisitions-pulling-back-the-covers-part-2/",
    "postId": "1116714314",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/10/team.jpg?w=300"
    ],
    "creator": "",
    "categories": [
        "acquisitions",
        "ex-googler",
        "ex-youtuber",
        "google",
        "guest-posts",
        "lawyers",
        "mentors",
        "mentors",
        "negotiations",
        "omnisio",
        "riddler",
        "ryan-junee",
        "term-sheets",
        "tips",
        "youtube"
    ],
    "content": "<em>500 Startups Mentor <a href=\"http://ryanjunee.com/\" target=\"_blank\">Ryan Junee</a> continues with Part 2 of his thoughts about startup acquisitions. <a href=\"http://500.co/2010/10/07/acquisitions-pulling-back-the-covers-part-1/\" target=\"_blank\">Catch up on Part 1</a>.</em>\n\n<a href=\"http://500.co/wp-content/uploads/2010/10/team.jpg\"><img class=\"alignnone size-medium wp-image-1116714317\" title=\"team\" src=\"http://500.co/wp-content/uploads/2010/10/team.jpg?w=300\" alt=\"\" width=\"300\" height=\"217\" /></a>\n\nThis is a continuation of <a href=\"http://500.co/2010/10/07/acquisitions-pulling-back-the-covers-part-1/\">my previous post</a> in which I talked about some of the key things you and your team need to think about when deciding to sell your company.  In this post I will describe the actual negotiation process and some of the important terms you will need to know.\n\n<em><strong>Negotiations</strong>\n</em>\nA lot has been written about negotiation strategy and tactics, and I'm far from an expert, so I'll let you research the general stuff on your own.  In the context of a potential acquisition, the first thing you need to do is get a strong internal sponsor/champion at the acquiring company.  This is probably the person who found and approached you, unless that person is not very senior in which case it may be his or her boss, or further up the chain of command.  Usually it's someone in the product or engineering team who really understands what you have achieved, and really wants you to be part of the company.  Find this person and do everything you can to make them love you. They will be the one who tells the M&amp;A team to go ahead and get a deal done.\n\nYou will probably have a bunch of meetings at the company demoing your product, talking about the technology and your shared vision.  Hopefully there's a strong synergy between your vision and theirs.  Hopefully they like your architectural choices and the technology stack you have chosen.  Hopefully they are impressed by how much you have accomplished with so few resources (this is where startups really shine compared to large companies).  If all goes well, at some point you will be introduced to the M&amp;A team, sometimes called the corporate development team, who will take over and handle the tactical negotiations from here on.\n\nAcquisition negotiations are a strange things.  At first no one seems to come right out and say just what is going on and what the purpose of the discussions are.  Often companies are just 'exploring how we could work together' - but there seems to be a shared understanding that a potential acquisition is really what's being talked about, and eventually someone, usually from the M&amp;A team, will come out and say it.  This is when things move into high gear!\n\nYou'll want to quickly assemble your team of lawyers and advisors (which I discuss below) who will help you through the negotiation process.  Before you have this team assembled, there are a couple of things you should make sure you do from the beginning to start out on the right foot.  First, don't immediately sign a no-shop agreement.  A smart acquiring company will ask you to do this right away, but you need to resist.  Explain that you'd be happy to sign an NDA and keep the details of your discussions confidential, but you aren't ready to sign a no-shop agreement until the discussions progress and you have a better understanding of the actual terms.  In my opinion it's ok to sign a no-shop once you have agreed on a termsheet, but before you reach that stage you should not.\n\nSecondly, have your BATNA ready (\"Best Alternative to a Negotiated Agreement\").  You need other options if you are going to have any leverage in the negotiation (again, much like dating :)  This could be other interested acquirers (which is why it's important to not sign a no-shop agreement, so you can go out and get in front of other acquirers now that you have interest from one), it could be investors interested in funding your company so you can continue independently, or it could be simply walking away and continuing to do what you do best.  You have to show that you don't <strong>need</strong> this deal, make them want you as much as you want them.  And even if you don't have other options yet you need to be projecting this attitude.\n\nThe negotiations will progress through a few phases.  There will be a due diligence phase where the acquirer digs deeper into your product and technology.  They may even put you through a formal interview process (since they are basically hiring you).  Next you will begin negotiating a <strong>termsheet</strong> - a short document (usually 4-6 pages) that outlines the key terms of the deal, and streamlines the process by ensuring you have agreement on all the important stuff before engaging expensive lawyers (I talk about some of the key terms below).\n\nEventually you will reach agreement and sign the termsheet.  This could happen relatively quickly over a week or two, or could drag on for a couple of months depending on how closely your expectations match and how hard you negotiate.  Term sheets are not legally binding, but they aren't usually broken if both sides have been honest in the negotiations thus far. For this reason (because the deal has a reasonably high likelihood of going through), it's ok to sign a no-shop agreement at this point.\n\nThe final phase is negotiating the <strong>definitive agreement.</strong> Whereas a termsheet is only a few pages, the definitive agreement may be well over 100, and is mostly legalese that lawyers on both sides will relish the opportunity to argue over.  Depending on how thorough you were at the termsheet stage and how hard you decide to negotiate, this phase could again drag on for months.\n\nIf the deal doesn't fall through, then at some point everyone on both sides is happy and signing day arrives!  After penning your autograph on stacks of documents you can sit back, relax and let your writers cramp subside.  But you're not quite done yet.  Usually there's a bunch of administrivia that needs to be taken care of after signing and before the deal is officially 'closed'.  This can take a few days or a week or so.  Closing day will eventually arrive, you'll login to your online bank account and a huge smile will appear on your face, techcrunch and a hundred other blogs will write about you, and you will join the ranks of entrepreneurs who have successfully sold a company.\n\nOf course come Monday you'll have a new job and a new adventure to embark on, so relax while you can.\n\n<em><strong>Lawyers and Advisors</strong></em>\n\nI mentioned above the importance of assembling your team to help with negotiations.  This basically boils down to lawyers and advisors.  I first want to explain that lawyers and advisors are very different - you need to make sure you have <strong>both</strong>.  To put it simply, lawyers are focused on minimizing risk.  They will pore over the details of an agreement and make sure you aren't exposing yourself to things that could come back to hurt you.  They want to protect you.  What lawyers generally <strong>won't</strong> do is present you with creative ways to reach a better outcome.  As an entrepreneur, you are not only interested in minimizing your risk, but also in maximizing the upside of the deal.  This is where having experienced <strong>advisors</strong> is key.  Hopefully your advisors have done a few deals in the past and have a few tricks up their sleeve that that can be used during negotiations.  To give an example, one of our advisors was a very experienced tax accountant and figured out a way to structure the deal that helped us minimize the tax we would owe to the government.  Venture Hacks explains this well in their article <a href=\"http://venturehacks.com/articles/referees\">Lawyers are referees, not coaches.</a>\n\n<a href=\"http://venturehacks.com/articles/referees\"></a>In case you are wondering whether you can just do this yourself - why you need a team at all: first, it would be absolutely crazy not to have a legal review of the agreement you are about to sign, preferably from a lawyer experienced in dealing with these sorts of transactions (not Uncle Bob who has a small family law practice back home).  Secondly, consider that this is probably the first time you have ever sold a company.  Your acquirer may have already acquired dozens of companies this year!  The M&amp;A team you are negotiating against lives and breathes this stuff <strong>every day</strong>.  You are at a massive disadvantage if you don't bring some experienced folks to your team to even things up.  It's particularly advantageous to have advisors on your side who personally know executives on the other side.  Having a back-channel in addition to your formal negotiations can be tremendously useful in streamlining the whole process.\n\nI talked about the negotiation process above, and how moving from term sheet to definitive agreement can last a month or more.  This is the time when your lawyer really becomes engaged, and is the time you need to be very careful about where your lawyer spends his or her time (aka billable hours).  It's often joked that lawyers are the ones who make out best in an acquisition.  Legal fees are high, and lawyers just love arguing over minutiae and charging you for it.  You will have to actively manage your lawyer, keep them reigned in and focused only on what you mutually decide are the most important points.  Set an expected budget upfront.  Ask what they can get done for this amount.  Tell them not to worry about arguing over minor points that you don't care about.  Keep in mind that they are probably used to negotiating big deals where legal fees can easily run above $500K, they aren't necessarily used to your small early stage exit.  Legal fees of $50-$100K for an early stage deal are not unusual.\n\n<em><strong>The Nitty Gritty</strong></em>\n\nHere I'll outline some of the key terms you will be negotiating.  Again, I'm bound by confidentiality agreements so I won't be discussing the specifics of my deal, but just some general terms to give you an idea of what to expect.\n<ul>\n\t<li><strong>Consideration</strong> - the amount you will be paid, the form it will take (cash, stock or both), how it will be paid out (usually some percentage up-front and some percentage over time tied to continued employment, perhaps tied to milestones)</li>\n\t<li><strong>Structure of the deal -</strong> usually either a stock purchase or an asset sale.  You should consult your lawyer and tax accountant on how this will affect you.</li>\n\t<li><strong>Employment arrangements </strong>- the types of jobs founders will be offered and an indication of salaries etc</li>\n\t<li><strong>No competition -</strong> an agreement preventing the founders from competing with the acquirer for some period of time</li>\n\t<li><strong>Non-disclosure </strong>- requiring parties to keep terms of the deal (or maybe even the fact a deal exists) confidential</li>\n\t<li><strong>No-shop </strong>- preventing the company from meeting with other potential acquirers or investors for some period of time (usually the expected time for the definitive agreement to be negotiated).</li>\n\t<li><strong>Due diligence</strong> - outlining the information the acquirer will need from the company.</li>\n\t<li><strong>Indemnification</strong> - outlining the representations and warranties the company is making to the acquirer, and requiring the company to reimburse the acquirer if they are sued for any breach.</li>\n\t<li><strong>Escrow</strong> - some portion of the consideration may be held in escrow for a period of time to cover the indemnification mentioned above.</li>\n\t<li><strong>Expenses and fees </strong>- who is responsible for legal fees (usually each party pays their own, but you may be able to play the 'starving entrepreneur' card and get some help)</li>\n</ul>\nIt is important to understand all of the terms in your term sheet before signing.  I would recommend paying specific attention to the structure of the payments and possible tax consequences.  As I mentioned we were able to structure our deal in a way that helped minimize taxes owed.\n\nWhile negotiating the definitive agreement, your lawyer will really dig into the indemnification clauses and make sure you aren't signing yourself up for more risk than necessary.  To give you an idea, you will be asked to represent that you fully own all your IP, have not breached others intellectual property rights, have not made any fraudulent claims etc.  In order to satisfy these representations, and as part of the due diligence process, you should expect an audit of all the code in your product that was written by third parties, which includes all open source libraries and the licenses attached to them.  You need to make sure you clean from an IP perspective.\n\n<em><strong>Keep Working</strong></em>\n\nI'll end this post with one piece of advice that was drilled into us by <a href=\"http://www.paulgraham.com/\" target=\"_blank\">Paul Graham</a>, one of our advisors.<strong> Keep working.</strong> Assume that the deal is going to fall through (deals often do).  Keep building the company, developing new features, gaining new customers etc.  Not only will this leave you in a comfortable position if the deal actually does fall through, but it will also help with your negotiations when the acquirer sees your company continuing to grow during the process (which may be several months).  In our case we launched several new features and received a bunch of press during the negotiations, which I assume helped reassure the acquirer that they were making the right decision.\n\nI hope this post has pulled back the covers and shed a bit of light on the acquisition process.  If you are going through the process, I'm happy to answer any questions - drop me an email.",
    "type": "post",
    "path": "/2010/10/10/acquisitions-pulling-back-the-covers-part-2/"
}