{
    "title": "An Interview with a Chimp Disguised as a UX Expert",
    "slug": "an-interview-with-a-chimp-disguised-as-a-ux-expert",
    "date": "2011-09-21T01:31:41.000Z",
    "url": "http://blog.500startups.com/?p=1116715874",
    "uri": "http://500.co/2011/09/20/an-interview-with-a-chimp-disguised-as-a-ux-expert/",
    "postId": "1116715874",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/09/fabrio-150x150.jpg"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<div><a href=\"http://500.co/wp-content/uploads/2011/09/fabrio.jpeg\"><img class=\"alignnone size-thumbnail wp-image-1116715898\" title=\"fabio\" src=\"/backup/fabrio-150x150-2011-09-20-11-20-31.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a></div>\n<div><em>Fabio Carneiro is a User Experience Designer at <a href=\"http://mailchimp.com/\">MailChimp</a>.</em></div>\n<div><em>\n</em></div>\n<div><strong>1) There's a lot of email platforms out there - in terms of product features and capabilities, what makes MailChimp different?</strong></div>\n<div><strong>\n</strong></div>\n<div>Everyone talks about features, boiling their  companies and their competitors down to bulleted lists, but in the end  that's just a numbers game, and people end up being ignored when you  play it. It's the provided experience that counts. The world of email  isn't particularly exciting or interesting at its root, and for a long  time no one really bothered to challenge that. That's what makes  MailChimp different. We try very hard to focus on the user. There's a  saying here: Love what you do. MailChimp fosters creativity and  innovation in every employee, from UX Designers like myself to our  support staff, and that's an attitude that we bring into the application  and to our customers. In making their work easier, we've created an  army of people out there that actually have fun with email marketing,  and they end up loving what they do.</div>\n&nbsp;\n<div><strong>2) Many startups think of email as  secondary...but its actually one of the most important and effective  distribution platforms. What are some of the interesting and creative  ways you're seeing companies use MailChimp today?</strong></div>\n<div><strong>\n</strong></div>\n<div>The most interesting emails, to me, are the ones  that aren't trying to sell anyone anything. At least not directly. These  newsletters are all about creating a conversation between a company and  its audience. It's a gutsy move, but I think it resonates with people  and pays off in the end, because they're building a relationship that's  not strictly based on consumerism, which is a buy-and-bye kind of thing.  Instead, the emails focus on telling a story about the company, or they  highlight things that are relevant, but not necessarily related, to  what they sell. Basically, they treat people like people, instead of  walking, talking wallets. Folks tend to like that.</div>\n&nbsp;\n<div><strong>3) You're a UX pro - tell us: what are the UX and UI 'rules' in an email that actually lead to better conversion?</strong></div>\n<div><strong>\n</strong></div>\n<div>It's  all about the experience. Content is the most important part of any  email, so make sure it's something that people want and give it to them  in a format that is appealing. Start by giving your email a well  thought-out layout. Build trust with consistency in design, content, and  delivery. Snag someone's attention and pique their curiosity by  injecting something that's fun and unexpected. Personality goes a long  way, so crafting a voice and tone that fits your audience helps ensure  that you stay relevant and they keep coming back.</div>\n&nbsp;\n<div>Don't try to give everyone everything: if you have  subscribers that have a wide range of interests, and you're trying to  serve all of them in one email, you're doing it wrong. Segment your  subscribers and serve them in a more granular fashion and you'll breed  familiarity with your readers and make them feel like they have an  ownership stake in your business. Make people important and they will  make you important in turn.</div>\n&nbsp;\n<div>Lastly, an email needs to be coded correctly,  whether you do it yourself or not. This is a technical issue, but it's  pretty important. It's kind of an arcane art, because HTML email hasn't  evolved like the rest of the web has; there aren't any standards, emails  are coded with antiquated methods, and email clients like Gmail or  Outlook all render emails according to their own rules. Knowing how to  achieve consistent rendering of an email is vital.</div>\n&nbsp;\n<div><strong>4) What are the top 5 design faux-paus you've seen in emails that make you cringe?</strong></div>\n<div><strong>\n</strong></div>\n<div>The  first, and this kills me when I see it, is when I get emails composed  entirely of images. Images should be used for images, and never for the  actual textual content of your email. You can't rely on email clients to  render images automatically, so that crucial first glance that your  recipient takes shows them nothing, and your email ends up looking, to  their mind, spammy and unprofessional. Then it ends up in the trash bin  or, worse, the spam folder. The one exception, and you can go either way  on this one, is to use images for section headings of an email. My  personal preference is to avoid it, but my advice for those who do is to  make sure you set alt attribute text, for those times when images  aren't rendered.</div>\n&nbsp;\n<div>Second, when no thought is put into typography.  Email is a hugely important medium that's very reliant on text, but  typography is massively overlooked. It's critical to take care in using  typefaces well, in selecting font size, leading and kearning, and color.  Creating content hierarchy organizes makes for an easier-to-read email.  Hierarchy is doubly important if your email contains a call to action.  Finally, small font sizes should be avoided, since mobile viewing of  email has skyrocketed, and small screens are much more prevalent than in  the past. Don't make it difficult for subscribers to view your content.</div>\n&nbsp;\n<div>The third issue, while we're on the subject of text,  is an email that's entirely text and uses no images. Don't get me  wrong, an all-text email works fine in niche circles, but with email  becoming such an important marketing tool it hurts more than it helps.  Humans are visual animals, and something as simple as an attractive  header image or photos of a product are pivotal in getting a recipient's  attention. Why avoid that?</div>\n&nbsp;\n<div>Fourth, less is best. More is just more.  Increasingly, email is losing the image that it's a 'sit at your desk  and check your inbox' activity. It's become wildly mobile and, in turn,  quick. You shouldn't shoehorn huge amounts of content into your emails.  If you want people to read your two-page article, don't force them to  read it in an email. Give them a summary that can be taken in at a  glance and a link to your news site or blog. Leave people to browse the  web, not their inboxes.</div>\n&nbsp;\n<div>Finally, the fifth. Want to reach a broader  audience? Let people share emails over social networks, and make it easy  for them to do it. Design your emails with social sharing in mind. Give  people a way to share content they like with their friends, whether  it's on Twitter or Facebook or any other of the dozens of social  services floating around out there. If you're engaging, people will want  to let others know. Make it easy for them.</div>\n&nbsp;\n<div><strong>5) How can companies make sure  that their emails are actually continued conversations with their  audience? How does MailChimp enable this?</strong></div>\n<div><strong>\n</strong></div>\n<div>MailChimp  offers a boatload of tools for sharing with and engaging an audience,  and guides for everything from creating an email marketing plan to  managing subscribers lists. Ultimately, it's good, compelling content  that hooks people and keeps them coming back. There needs to be a reason  for your audience to care about what you have to say and for them to  keep coming back. Appeal to people's curiosity and make them feel like  they own and have a stake in your brand. Be engaging, every time. If you  provide people with interesting experiences, whether they're fun or  technical, everything else is logistics.</div>\n&nbsp;",
    "type": "post",
    "path": "/2011/09/20/an-interview-with-a-chimp-disguised-as-a-ux-expert/"
}