{
    "title": "An Interview With Ryan Freitas of About.Me",
    "slug": "an-interview-with-ryan-freitas-of-about-me",
    "date": "2012-01-20T00:54:38.000Z",
    "url": "http://500.co/?p=1116719271",
    "uri": "http://500.co/2012/01/19/an-interview-with-ryan-freitas-of-about-me/",
    "postId": "1116719271",
    "description": "",
    "images": [
        "http://d13pix9kaak6wt.cloudfront.net/background/ryanchris_1316642380_33.jpg"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<em><em><i><a href=\"http://about.me/ryanchris\">Ryan Freitas</a> is the Co-Founder of About.Me, which was acquired by AOL where he now serves as Director of Product Management. The full interview will be published in the Designer Founders Book. Note: We’re less than a week away from our Kickstarter deadline! Help make our nonprofit book and distribute it for free to students worldwide <a href=\"http://www.kickstarter.com/projects/785344186/designer-founders-stories-by-designers-of-tech-sta\">here</a>.</i></em></em>\n\n<img class=\"alignnone\" title=\"Ryan\" src=\"/backup/ryanchris_1316642380_33-2012-01-19-12-18-54.jpg\" alt=\"\" width=\"594\" height=\"407\" />\n\n<strong>Taking Risk</strong>\nIf you’re not putting your balls on the table, what are you doing? Why even bother being an entrepreneur?\n\n<strong>Iterations</strong>\nWe probably re-did the user experience for the signup process six or seven times before we got it to a very minimalistic two-step… You iterate and you cycle and you put it in front of people early and you test it as often as you can and use your metrics to see whether or not you’re on the right path.\n\n<strong>Post Launch</strong>\nAfter showing an <a href=\"https://about.me/\">about.me</a> prototype at SXSW we took a long, hard look at the product and we realized we hated the version of it that we had built, where we had iterated it to. And in what was one of the craziest periods of the last year, we scrapped 90 percent of [the interface] and started over. Just completely broke it down and built it back up again. We worked for six weeks and wound up with what we have now.\n\n<strong>Communicating with Designers</strong>\nSome people think of design as a utility or a commodity... We used to call it the “shut up and color” mindset. You can take that perspective in a hiring arrangement but I guarantee you, you are going to get crap work. And the reason your design will suck is not because you have a shitty designer, it will be because you're not interacting with your designer in a way that gets the best possible work out of them. It’s a collaboration. It’s not dictatorial at all.\n\n<strong>Entrepreneurial designers</strong>\nFive years ago the interaction designers were asking, \"where’s our seat at the table?\" Because in larger organizations, no one gave a shit. No one was doing what was necessary to ensure that customer experience was king. Today, some people are talking about focusing on the customer experience like it just got invented. What’s been amazing is watching this transformation of people’s perspectives around how you can bring a product to the world.\n\nA lot of people are amazed that you can be a designer and an entrepreneur. I read a post by some dude, who’s also a founder, who says in his experience that most designers don’t have an entrepreneurial mindset. Bullshit. Anybody who starts an agency, anybody who tries to build a product, anybody who sketches at home has an entrepreneurial instinct.\n\nI became an entrepreneur by accident... I thought I was perfectly happy being a consultant. I didn’t realize how much I needed to bring something into the world… until I was given the opportunity. Now that I’ve done it, I’m religious about seeing things though. I want to mature about.me to the point where it represents the idea that I had, like a platonic ideal of the product I had in my head the first day I thought about it. Because I think it’s got that potential, and I won’t be satisfied until I get it to that point.",
    "type": "post",
    "path": "/2012/01/19/an-interview-with-ryan-freitas-of-about-me/"
}