{
    "title": " A Piece of the Action: Announcing 500 Syndicates",
    "slug": "announcing-500-syndicates",
    "date": "2014-02-13T15:15:03.000Z",
    "url": "http://500.co/?p=1116731435",
    "uri": "http://500.co/2014/02/13/announcing-500-syndicates/",
    "postId": "1116731435",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "angellist",
        "announcements",
        "syndicates",
        "venture-capital",
        "women"
    ],
    "content": "<p dir=\"ltr\">With any good story, once it starts working... everybody wants a piece of the action.</p>\n<p dir=\"ltr\">Today, 500 Startups is launching our very own <a href=\"https://angel.co/help/syndicates?ref=how-it-works\">AngelList syndicates</a>. We view syndicates as a way to double down on great 500 portfolio companies AND enable other investors to co-invest with us more quickly and easily. So we’re kicking things off with two to start: the <a href=\"https://angel.co/500startups/syndicate/\">500 Startups Syndicate</a>, and the <a href=\"https://angel.co/500-women\">500 Women Syndicate</a>.</p>\n<p dir=\"ltr\"><strong>How will it work?</strong> For each syndicate, 500 Startups will allocate ~$1M to invest in ~10 companies over the next 12 months, or about $100K in one company every month. Each company will receive ~$100K investment from 500 Startups (our normal amount), and they will also get additional capital from the backers of each syndicate, depending on how much is available and how much the company wants to accept.</p>\n<p dir=\"ltr\">We believe <a href=\"https://angel.co/\">AngelList</a> (also a 500 portfolio company) is a great platform to help our startups get access to more capital and more investors, and help them build their business. And now with AngelList Syndicates, it’s also a great way for us to share some of our best companies with other investors who share our investment philosophies.</p>\n<p dir=\"ltr\">But this is just the beginning. In the future, expect to see more 500 syndicates that are focused on specific locations, industries, themes, and <a href=\"https://medium.com/philosophy-logic/d8a4ac8b1c12\">other stuff we care about.</a></p>\n<strong>Interested in being a backer for either or both of these syndicates? Visit the <a href=\"https://angel.co/500startups/syndicate/\">500 Startups Syndicate</a> and the <a href=\"https://angel.co/500-women\">500 Women Syndicate</a> pages to apply.</strong>",
    "type": "post",
    "path": "/2014/02/13/announcing-500-syndicates/",
    "backgroundImage": "/backup/piece-of-action-960x540-2014-02-13-14-09-15.png"
}