{
    "title": "Applications Are Open for Our Next Accelerator Batch! Here Are 10 Tips for Getting In",
    "slug": "applications-are-open-for-our-next-accelerator-batch-here-are-10-tips-for-getting-in",
    "date": "2014-01-22T15:38:44.000Z",
    "url": "http://500.co/?p=1116731189",
    "uri": "http://500.co/2014/01/22/applications-are-open-for-our-next-accelerator-batch-here-are-10-tips-for-getting-in/",
    "postId": "1116731189",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2014/01/logo-2-500.png",
        "http://500.co/wp-content/uploads/2014/01/BidAway-Logo-1024x258.png",
        "http://500.co/wp-content/uploads/2014/01/predictionio-banner.png",
        "http://500.co/wp-content/uploads/2014/01/doz-logo-200-noir.png"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "accelerator",
        "announcements",
        "batch-9",
        "mountain-view"
    ],
    "content": "<p dir=\"ltr\"><strong><em>We’re currently accepting applications for our next Mountain View Accelerator class. You can apply here: <a href=\"http://bit.ly/Getin500\">http://bit.ly/Getin500</a><a href=\"http://bit.ly/bein500\">\n</a></em></strong></p>\n<p dir=\"ltr\">We’re kicking off our first batch of companies in the shiny new 500 Startups San Francisco accelerator program, otherwise known as 500 Del Norte. We’d like to take this opportunity to tell you a bit about what the batch looks like, what we’re looking for, and how we select companies.</p>\n<p dir=\"ltr\">We started with over 1400 applications for 25 slots. While we’re much more concerned with quality than quantity, if you’re applying to a competitive accelerator you should understand that you will be one of many applications.</p>\n\n<h2 dir=\"ltr\"><strong>Tip 1: Apply Early</strong></h2>\n<p dir=\"ltr\">We start reviewing applications on a rolling basis as soon as the application window opens. More than half of the applications come in on the last day. If you want us to spend more time on your application, get it in early.</p>\n\n<h2 dir=\"ltr\"><strong>Tip 2: Put effort into your application and give as much detail as possible</strong></h2>\n<p dir=\"ltr\"> We don’t have the luxury of putting hours into reviewing your application. We need to see something interesting that makes us want to dig in.</p>\n<p dir=\"ltr\">We filter these applications with the help of our mentor and founder networks. Our goal is to have at least four people look at every application, ideally with expertise in the space you’re working in. We couldn’t do it without these awesome folks (Thanks 500 mentors!).</p>\n<p dir=\"ltr\">We also look extra hard at companies that are referred in by our founders and mentors. A personal recommendation from someone we trust isn’t a guarantee you’ll get an interview, but it’s pretty valuable.</p>\n\n<h2 dir=\"ltr\"><strong>Tip 3: Figure out who you know in the 500 network</strong></h2>\n<p dir=\"ltr\">Ask them if they would be comfortable recommending your company. If you don’t have this network, consider reaching out to 500 mentors who would understand your business and asking (politely) if they would give you some feedback. Don’t be a creep about it. If they dig your company, you can ask them to give us their thoughts.</p>\n<p dir=\"ltr\">Our goal is to narrow the initial applications down to about 100 companies we interview. We do these interviews over 3-4 full days. We split up into teams of two, and each company gets interviewed for 15 minutes. You’ll usually do three interviews.</p>\n<p dir=\"ltr\">We do this to avoid groupthink, and to give startups the chance to shine even if one interview doesn’t go well. Interviewers include members of the 500 Investment Team, Distribution Team, other 500 staff, and sometimes 500 mentors.</p>\n\n<h2 dir=\"ltr\"><strong>Tip 4: Come prepared. </strong></h2>\n<p dir=\"ltr\"><strong>You only have 15 minutes. </strong>You need to convey who you are, why your business is interesting, and be prepared for us to dig into everything from your unit economics  and customer acquisition strategies to long-term plans and where you met your co-founders.</p>\n\n<h2 dir=\"ltr\"><strong>Tip 4.1: Research the program. </strong></h2>\nKnow what our terms are, know how we work, talk to startups who have gone through the program, and come prepared to tell us what you want from 500. It reflects poorly on you (and is bad business) to consider selling a chunk of your company to someone without understanding deeply what you’re getting in return.\n<h2 dir=\"ltr\"><strong>Tip 5: Don’t have a script</strong></h2>\n<p dir=\"ltr\"> Go into the interview with specific questions. We don’t have much time, so remember that your job is to fill in the gaps, not to hammer home what you think is important.</p>\n<p dir=\"ltr\">After interviews are complete, we schedule a half-day team meeting to come up with a batch. We start with the companies that we all agree on, either positive or negative, and thi usually gives us the first 10-15 companies. If you have a phenomenal founding team with several exits to your name, a million dollar run rate, 50% month-over-month growth, a beautiful product, and an unsexy-but-giant market – well, you’re almost certainly in. Figuring out the other companies is where the fun (and arguing) begins.</p>\n<p dir=\"ltr\">For companies that don’t have all the boxes checked, we look to each other for a champion. We believe groupthink is a big problem in venture capital, so we encourage debate and empower anyone on the team to take a controversial position.</p>\n\n<h2 dir=\"ltr\">Tip 6: Find a champion</h2>\n<span style=\"font-size: 14px; line-height: 1.5em;\">Even if all of us don’t “get” a company, that’s OK. We all have different backgrounds and different interests. Find interviewers who are exciting about what you do, then give them the information they need to be your champion. One ‘hell yes’ usually beats out any other strong negative votes.</span>\n\nAfter hours of arguing, we end up with a list of 35-40 companies we think are really interesting. We then discuss which companies might be too early.\n\nWe believe an accelerator program should help companies refine their strategy, break through concrete bottlenecks in the business, and raise reasonable seed rounds at good valuations once they’re done with the program.\n<p dir=\"ltr\">We think a lot about companies getting their money’s (equity’s) worth out of us. If a company is too early to get ready for demo day and achieve their fundraising goals, our accelerator is probably not a good fit.</p>\n<p dir=\"ltr\">We try hard to give these companies concrete feedback on what we think they should be working on – then invite them to reapply for our next batch. This isn’t BS. Timing matters with accelerators, and we want you to get the most out of ours.</p>\n\n<h2 dir=\"ltr\"><strong>Tip 7: Tell us what you’ve learned</strong></h2>\n<p dir=\"ltr\">Markets are Darwinian. The most important skill you can have is the ability to adapt quickly. Tell us what you’ve learned. What were you wrong about? What secrets have your customers told you that give you an unfair advantage? We’re suckers for quick learners.</p>\n\n<h2 dir=\"ltr\"><strong>Tip 8: Tell us how you’ll grow</strong></h2>\n<p dir=\"ltr\">Startups grow or they die. Where are you customers? How will you reach them? Tell us what you’ve done. Unscalable growth is fine (and reflects hustle), but ultimately we’ll need to see a path scalability. If you’re small you know we can help you grow, that’s really exciting.</p>\n\n<h2 dir=\"ltr\"><strong>Tip 9: Make sure we understand your traction</strong></h2>\n<p dir=\"ltr\"> Traction comes in many forms, with the most obvious being revenue. However, revenue isn’t the only form. This may sound obvious, but we’re looking for people who have executed – not people who will execute some time in the future. Make sure we understand what you’ve done. This is way more important than what you think you can do.</p>\n<p dir=\"ltr\">I hope this is helpful. We’re grateful for all the amazing companies we received applications from, and look forward to having some of them in our first San Francisco accelerator. Hopefully this will help you if you choose to apply to our Spring batch in Mountain View. Applications open NOW, so apply here: <a href=\"http://bit.ly/Getin500\">http://bit.ly/Getin500</a><strong><em><a href=\"http://bit.ly/bein500\">\n</a></em></strong></p>\n<p dir=\"ltr\">Finally, I thought you might like learn about a few of the companies we accepted this batch and hear what we loved about them. This is just a small sample, so stay tuned for an announcement about the full batch.</p>\n\n<h2 dir=\"ltr\">Shippo</h2>\n<a href=\"/backup/logo-2-500-2014-01-22-14-09-38.png\"><img class=\"aligncenter size-full wp-image-1116731197\" alt=\"logo-2-500\" src=\"/backup/logo-2-500-2014-01-22-14-09-38.png\" width=\"500\" height=\"232\" /></a>\n<p dir=\"ltr\">Shippo is a logistics company that works with e-commerce marketplaces. When marketplaces use Shippo, customers get more accurate info on shipping times and lower prices, marketplaces get more sales, and sellers get more business and a simpler process. They applied to our last batch with a different business and pivoted into this model. We loved the team but didn’t like the original business, so when they came back with Shippo we were really interested. When we learned one of our current batch companies, Cityblis, was using them and *loved* them, it was a pretty easy decision.</p>\n<p dir=\"ltr\"><strong>What got them the interview:</strong> Known team.</p>\n<p dir=\"ltr\"><strong>What got them them in:</strong> Great customer testimonial from the 500 family.</p>\n\n<h2 dir=\"ltr\">BidAway</h2>\n<p style=\"text-align: center;\"><a href=\"http://500.co/wp-content/uploads/2014/01/BidAway-Logo.png\"><img class=\"aligncenter  wp-image-1116731191\" alt=\"_BidAway Logo\" src=\"/backup/BidAway-Logo-1024x258-2014-01-22-14-09-38.png\" width=\"717\" height=\"181\" /></a></p>\n<p dir=\"ltr\">BidAway is a Spanish company that allows consumers to buy luxury experiences at discount prices. They had no connection to the 500 network, but got an interview because of an interesting business model and good/proven unit economics.</p>\n<p dir=\"ltr\"><strong>What got them the interview:</strong> Solid product, good revenue.</p>\n<p dir=\"ltr\"><strong>What got them in</strong>: Great customer loyalty/LTV.</p>\n\n<h2 dir=\"ltr\">Prediction.io</h2>\n<a href=\"/backup/predictionio-banner-2014-01-22-14-09-38.png\"><img class=\"aligncenter size-full wp-image-1116731193\" alt=\"predictionio-banner\" src=\"/backup/predictionio-banner-2014-01-22-14-09-38.png\" width=\"778\" height=\"84\" /></a>\n<p dir=\"ltr\">Prediction.io is an open source product that makes introducing machine learning easier, which helps increase the productivity of small data science teams. This is a major pain point for many companies, and these guys have built a thriving community around a solid product.</p>\n<p dir=\"ltr\"><strong>What got them the interview:</strong> Impressive Github stats and a good referral.</p>\n<p dir=\"ltr\"><strong>What got them in:</strong> Team with deep expertise, and a champion on the team who has felt this pain acutely.</p>\n\n<h2 dir=\"ltr\">DOZ</h2>\n<a href=\"/backup/doz-logo-200-noir-2014-01-22-14-09-38.png\"><img class=\"aligncenter size-full wp-image-1116731195\" alt=\"doz-logo-200-noir\" src=\"/backup/doz-logo-200-noir-2014-01-22-14-09-38.png\" width=\"211\" height=\"143\" /></a>\n<p dir=\"ltr\">DOZ helps online businesses go international by leveraging local marketers to help them promote their product once the i18n and l10n is done.</p>\n<p dir=\"ltr\"><strong>What got them the interview:</strong> Impressive revenue.</p>\n<p dir=\"ltr\"><strong>What got them in:</strong> Great market, demonstrated execution.</p>\n\n<h2 dir=\"ltr\">We Hope You’ll Join Us</h2>\n<p dir=\"ltr\">If you’ve read this far, I have to assume you’re pretty interested in our accelerator. First off, thanks. We have secret moments of dread during our application period, but always end up being blown away by the amount interest we receive from such great companies. Want to see what it’s like to <em><strong>actually</strong></em> be in our program? Check out this video featuring our last batch of companies:</p>\n<iframe src=\"//www.youtube.com/embed/fprPAliT1LQ\" height=\"360\" width=\"640\" allowfullscreen=\"\" frameborder=\"0\"></iframe>\n<p dir=\"ltr\"><span style=\"line-height: 1.5em;\">I hope this info about how we operate helps you put together a better application. Finally, here’s what I think is the best advice you can get as you go out there to talk to VCs.</span></p>\n\n<h2><strong>Tip 10:</strong> Do what’s right for your business.</h2>\nVCs resonate with simple stories and metrics, so its natural for companies to try to play to the test. But whether you join 500 or not, success comes from being an expert in your business and doing the right thing for it and for your customers. Don’t adapt your business to our needs, but please speak slowly when explaining it. We are VCs after all.",
    "type": "post",
    "path": "/2014/01/22/applications-are-open-for-our-next-accelerator-batch-here-are-10-tips-for-getting-in/",
    "backgroundImage": "/backup/500_mediabreakfast_0401-XL-960x540-2014-01-22-14-09-38.jpg"
}