{
    "title": "Attention Seeking: A Guide For Startups",
    "slug": "attention-seeking-a-guide-for-startups",
    "date": "2011-02-04T01:56:11.000Z",
    "url": "http://blog.500startups.com/?p=1116714946",
    "uri": "http://500.co/2011/02/03/attention-seeking-a-guide-for-startups/",
    "postId": "1116714946",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/02/milo-150x150.jpg"
    ],
    "creator": "",
    "categories": [
        "attention-seeking",
        "guest-posts",
        "london",
        "marketing",
        "milo-yiannopoulos",
        "pr",
        "telegraph",
        "tips"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/02/milo.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714947\" title=\"milo\" src=\"/backup/milo-150x150-2011-02-03-11-19-56.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>This guest post comes to you from across the pond - written by <a href=\"http://yiannopoulos.net/\" target=\"_blank\">Milo Yiannopoulos</a>, </em><a href=\"http://www.telegraph.co.uk/journalists/milo-yiannopoulos\" target=\"_blank\"><em>a technology columnist for The Telegraph</em></a><em> in London who writes about the internet, copyright, privacy and start-ups. Milo is commissioning editor of The Telegraph's </em><a href=\"http://www.telegraph.co.uk/startup100\" target=\"_blank\"><em>Tech Start-Up 100</em></a><em>, the most authoritative and trustworthy ranking of promising start-ups in Europe. He's a regular speaker at tech conferences and a mentor to</em><em> start-ups, particularly those operating in media, content, publishing, advertising and social networking. </em><em>Previous attention-seeking exploits of Milo's include <a href=\"http://www.guardian.co.uk/technology/blog/2009/nov/18/london-nude-tech-calendar-buy\" target=\"_blank\">The London Nude Tech Calendar</a> and the <a href=\"http://edition.cnn.com/2009/SHOWBIZ/Music/06/26/michael.jackson.moonwalk.london/index.html#cnnSTCVideo\" target=\"_blank\">Michael Jackson tribute moonwalk</a>.</em>\n\nPeople need attention: it's a normal and healthy part of life. And getting attention is marvellous: it makes you feel smart, sassy and confident and leads you to perform better in life, at work and in the bedroom. But guess what? Your start-up is no different! It too needs nurturing to perform at peak efficiency. So how do you make your start-up feel like the prettiest girl in the room?\n\nIf you're in the early stages of building a B2C product, you know that capturing people's imaginations by explaining to them why they absolutely have to sign up to your beta is critical to your future. But there's a problem, right? At precisely the time in your company's lifecycle that you need a bunch of users to prove your model, you can least afford so-called luxuries like PR. Why shorten your runway, goes the thinking, when you could be ploughing the cash into developer time?\n\nWell, you might not have to. Later in your company's life, you will almost certainly want to retain a public relations firm. They can do wonders for your business and take a lot of the work of dealing with the press off your shoulders: after all, they're in business themselves because they know exactly what you want, and how to get you it. (That's why hiring a PR firm that is itself a start-up is often a brilliant idea: they get exactly where you're coming from.)\n\nBut even PR firms - the best ones, anyway - will tell you that PR isn't right for everyone. And in some cases, it simply isn't an option. So I'm going to share some secrets with you that will help you get to the press and get your message out there. This post is primarily relevant to product-focused B2C companies, but with a little common-sense modification, any business can market itself more effectively by thinking about these rules when they create a story around their product. All it takes is a clear head, a bit of initiative and a good nose for what people want. (And if you don't have any of those things, what the hell are you doing being an entrepreneur?)\n\nI'm not going to call it PR, or even marketing, because it isn't quite either of those things. It's more guerilla than that. I'm going to call it  what it is: good old-fashioned <strong>attention-seeking</strong>. Because the idea here is to have journalists come to you - not the other way around. And you'll find that, if you're doing something sufficiently daring and exciting, they'll be beating your door down to get the exclusive.\n\n(A note: this does not mean you shouldn't contact them initially to let them know what you're planning. Remember that journalists in the national media almost always have email addresses on the 'firstname.lastname@publication.com' model, so, if in doubt, try that. You can also try calling them by Googling their switchboard number - though only do this if your story is massive or very urgent. Never cold call a journalist on their mobile phone. Finally, don't be disheartened by tech blogs that only give a 'press@' contact address: chances are it's a distribution list that goes to almost everyone on the team, so your message is actually being read by about ten people, who can then discuss whether they want to pursue the story.)\n\nFirst thing's first - and this is the most important lesson to take away with you. There are<strong> four golden rules of attention-seeking</strong>, and the same no matter what industry you're in. Here they are:\n\n<strong>Novelty</strong>\nWhat you're doing should be new.\n\n<strong>Controversy\n</strong> What you're doing should raise eyebrows or piss someone off.\n\n<strong>Celebrity\n</strong> What you're doing should rope in, or have an impact on, high-profile people.\n\n<strong>Sex\n</strong> Self-explanatory and the most powerful tool of all.\n\nAny narrative you create around your product should tick off at least two of these. Get all four and every journalist in the world will be desperate to cover you. If your product is new, disruptive, used by someone famous and has sex appeal (or can, in some other way, create a bit of a scandal), you've basically won the battle.\n\nTo flesh out the four golden rules above, and perhaps trigger some ideas, I've put together some crucial considerations for you to share with your team. Don't put together a strategy until you've mulled over each one, and whether it might be useful to you. This stuff is like catnip to journalists: get it right, and you'll have them eating out of the palm of your hand.\n\n<strong>Be creative.</strong> This could be as simple as making up a new but catchy portmanteau with which to name your product - like <a href=\"http://www.enternships.com/\" target=\"_blank\">Enternships</a> - or as complicated as a real-world stunt. Stage a fight, mount a coup, mobilise a protest ... whatever it takes to draw attention to yourself. One half of your time should be devoted to coming up with a clever, relevant stunt; the other half to writing to every journalist who might conceivably be interested. Sometimes it only takes one blog post to get picked up by the broadcast media to make a story go nuclear. Get it on the BBC and you'll be laughing all the way to a server crash when your new army of fans topples your service. (There are worse problems, right?) Remember <a href=\"http://salesforce.com/\" target=\"_blank\">Salesforce.com</a>'s \"End of Software\" banners outside the Siebel conference? That's the sort of thing you're aiming for. Which leads me nicely on to ...\n\n<strong>Get yourself sued. </strong>A risky one, I'll grant you. But everyone loves an underdog - especially in this industry, where every company <em>de facto</em> is one. One of Europe's most successful entrepreneurs, Richard Branson, basically made his name taking on the incumbent airline BA in a high-profile media war. He did <a href=\"http://www.amazon.co.uk/Dirty-Tricks-British-Bransons-Atlantic/dp/0316908460\" target=\"_blank\">pretty well out of it</a>.\n\nIf you piss enough people off, there's a good chance they'll either sue you, buy you or inadvertently drive so much attention your way that, if your product really is as good as you think it is, you'll hoover up users. The stakes are high, but if you work in a risky area like music or publishing, the potential rewards are enormous. So go on. Pick a fight with one of the big kids.\n\n<strong>Do the journalist's work for them. </strong>It's an open secret that journalists are terrifically lazy gits. If you send us a press release that already reads like a news story, with a compelling headline, clear explanations and an understanding of why we - and our readers - should care about what you're selling or what you're doing, the chances of us writing about you go through the roof.\n\n<strong>Prey on a journalist's weak spot.</strong> Taking a journalist for lunch is one of the most effective ways to get coverage. It's time consuming, it's borderline immoral, but it's true. That's because we're all broke and consequently don't eat out much. Be strategic about who you approach, find our what they like (eavesdropping on their Twitter feed is a good way to do this) and drop them an invitation. There are other ways you can tickle a journo's sweet spot too: find out what their hobbies are and tailor your communications accordingly. The Jedi move is flattery: no journalist is immune to the \"I love your stuff\" line. Even if they don't believe it's entirely sincere, they tend to respond to it anyway.\n\n<strong>State the obvious. </strong>Is there a giant elephant in the room about a competitor of yours that others are too scared or polite to mention? Mention it! You might think the problem or omission is obvious, but there's a fair chance your customers won't even be aware of it. You have to be careful with this one: don't play dirty, be true to yourself and think through the consequences of what you're doing for your reputation. But it's a potent weapon and you should never underestimate its effect.\n\n<strong>Know your stuff.</strong> One of the best ways to get attention is to ooze authority about your specialist subject. Does your company blog show off your expertise in a clear, jargon-free way? If you're not too obnoxious in the process, you'll find journalists and others clamouring to get your opinion on the latest trends in your industry. Building your personal brand is crucial to your start-up's media profile. And remember, every time you get a quote in the press, it's another little plug for your company and a potential fresh batch of sign-ups.\n\n<strong>Look like you don't need it.</strong> You need to act cool - even if you're really panicking about your lack of traction. The faintest whiff of desperation is the kiss of death to a journalist's interest - and to user engagement. There's a balance to be struck between pleading and arrogance, but if in doubt I'd go for the latter: there's nothing more awful than a start-up CEO pleading pathetically with you to write about him. (Corollary: not answering emails is a journalist's polite way of saying, \"No, thank you.\" It is not an invitation to you to bombard them with follow-up messages asking if they received your original message. That's not what we mean by persistence!)\n\n<strong>Be shamelessly opportunistic. </strong>This is probably the most important piece of advice I can give you. Keep a constant eye of for opportunities and leap on them. Here's a great example: last week, <a href=\"http://meetup.com/\" target=\"_blank\">Meetup.com</a> made some drastic changes to their website, and users revolted, Digg-like. The Meetup faithful were looking for ways to register their disapproval, tweeting their complaints and blogging about their grievances.\n\nEnter London-based GroupSpaces, who immediately published <a href=\"http://blog.groupspaces.com/\" target=\"_blank\">this blog post</a> and started approaching disaffected Meetup users on Twitter, offering them support in migrating their groups over. GroupSpaces didn't come across as opportunistic or gleeful in the least; just fantastically helpful. The result? A huge influx of sign-ups and <a href=\"http://greentechgirl.com/internet/a-conversation-with-one-of-the-founders-of-groupspaces/\" target=\"_blank\">a major PR victory against a rival</a>. It was a masterclass in clever attention-seeking.\n\nSo there you have it. Now get out there and start attention-seeking for your own company! (Just remember to come back and <a href=\"mailto:milo@yiannopoulos.net\" target=\"_blank\">tell me how you got on</a>.)",
    "type": "post",
    "path": "/2011/02/03/attention-seeking-a-guide-for-startups/"
}