{
    "title": "Bacon Heartthrob: Why unSEXY Startups Get Us Hot & Bothered",
    "slug": "bacon-heartthrob-why-unsexy-startups-get-us-hot-bothered",
    "date": "2012-08-09T03:57:18.000Z",
    "url": "http://500.co/?p=1116721971",
    "uri": "http://500.co/2012/08/08/bacon-heartthrob-why-unsexy-startups-get-us-hot-bothered/",
    "postId": "1116721971",
    "description": "",
    "images": [
        "https://lh5.googleusercontent.com/mzt33GKe25y4YEfhKuEDPiN2PTbC0Ovu-6Ltn33kIeY5T_9svXHYGTuGlMLLCwGE2wd2-iNWI5Er-O2Hia7NSk_k3iB7cG_hy5qsqdbvLS3a9uJByqQ"
    ],
    "creator": "",
    "categories": [
        "events"
    ],
    "content": "<strong><strong>By <a href=\"https://twitter.com/christenobrien\">Christen O’Brien,</a> Partner @ 500 Startups\n<img src=\"https://lh5.googleusercontent.com/mzt33GKe25y4YEfhKuEDPiN2PTbC0Ovu-6Ltn33kIeY5T_9svXHYGTuGlMLLCwGE2wd2-iNWI5Er-O2Hia7NSk_k3iB7cG_hy5qsqdbvLS3a9uJByqQ\" alt=\"\" width=\"469px;\" height=\"245px;\" /></strong></strong>\n\n<em>In my opinion, right now there's way too much hype on the technologies and not enough attention to the real businesses behind them.\n- Mark Cuban</em>\n\nWhoever said “it’s what’s inside that counts” was only half right. Because sexy sells.\n\nTalk to any successful CEO in an “unsexy” vertical – like financial, infrastructure, communications, or data – and you can hear it in their voice: the struggle they endured as they tried to sell their big idea to folks like investors, press, partners, and customers. And even harder, as they tried to rise above the fray amidst their sexy counterparts – photosharing apps, social networks, video sites, LOL Cats, photosharing apps that overlay LOL cats and turn them into video to then share on a social network. Ya.\n\n<strong>It must be a cruel, cruel world when your baby is ugly.</strong>\n\nYet today, folks like entrepreneur Steven Boal are in demand. Why? Because Steven (who’s <a href=\"http://unsexy.co/agenda/\">speaking at unSEXY</a>) built a company which is now valued at $1 Billion (I mean, holy shit – that’s a really, really hard thing to do). And his company is continuing to grow – rapidly. He disrupted an entire industry by taking an old concept and innovating the approach. But what does his company do? Online coupons. Yes – that’s right…fu@#ing coupons! Can you even imagine the glazed eyes he must have seen for years as he was starting Coupons.com? And even more impressive, this was back in 1997…so he saw the boom, endured the bust, kept fighting the good fight, and here he is today…at the helm of a billion dollar machine.\n\n<strong>THAT is a hot, steamy, sexy story. But have you heard about it before?</strong>\n\nThis is the B-side of tech, the unSEXY underbelly that might not be the hot chic in the bar, but surely knows how to score. Like the true definition of ninjas, they quietly overturn entire business models and industries while building profitable, scalable ventures. And many in the tech community have no idea who they are. (side note: stop using the term ‘ninja’ ubiquitously. If you’re a marketing or sales ninja, it’s a really bad thing.) What do you know about Workday? Or Nicira? Service-Now? Here’s some evidence that the climate for “unSEXY” is smoldering:\n\n&nbsp;\n\n<strong>1. Service-Now</strong> – $3.5 billion valuation, makes cloud-based software to automate enterprise IT operations, expecting ~$233 million in revenues &amp; 82-85% YOY growth, <a href=\"http://www.cbsnews.com/8301-505124_162-57468506/servicenow-rescues-the-ipo-market-after-facebook/\">fantastic recent IPO</a>\n\n<strong>2. Workday</strong> –<a href=\"http://in.reuters.com/article/2012/07/18/idINL2E8IHFC220120718\">Filed for a $500 million IPO a couple weeks ago</a>, makes human resources and financial management software, has raised $250mm in capital, has the customers and revenues to back it up.\n\n<strong>3. Palo Alto Networks</strong> – Makes security software, has grown rapidly over the last 3 years, &amp; <a href=\"http://www.mercurynews.com/breaking-news/ci_21119294\">had a stunning debut on the IPO markets</a>\n\n<strong>4. Nicira</strong> – <a href=\"http://www.informationweek.com/storage/virtualization/nicira-acquisition-is-vmwares-smartest-m/240004378\">Acquired by VMWare for a sweet $1.26 billion,</a> a network virtualization platform which counts some of the world’s biggest companies as customers\n\n&nbsp;\n\nIt’s not that the B2B markets don’t know about these companies…of course they do, these guys are rock stars. It’s just that I’m not sure many up-and-coming entrepreneurs are learning about them or aware of the opportunities that go beyond the ‘sexy’ verticals.\n\n<strong>Forget the sizzle. We want the steak.</strong>\n\nAt 500 we’ve always had a major jones for unsexy companies that make money. Having a simple, clear revenue model (SaaS, subscription, freemium, lead gen, etc) is a critical part of our investment criteria. We swoon for SMB tools, productivity/cloud services, payment platforms, and financial services. We’ve invested in a gaggle of unsexiness: <a href=\"http://twilio.com/\">Twilio</a>, <a href=\"http://sendgrid.com/\">SendGrid</a>, <a href=\"http://mygengo.com/\">Gengo</a>, <a href=\"http://zencoder.com/\">ZenCoder</a>, <a href=\"http://baydin.com/\">Baydin</a>, <a href=\"http://elacarte.com/\">Elacarte</a>, <a href=\"http://recurly.com/\">Recurly,</a> <a href=\"http://lucidchart.com/\">Lucid Chart</a>, <a href=\"http://toutapp.com/\">Tout,</a> <a href=\"http://readyforzero.com/\">ReadyForZero</a>, <a href=\"http://www.talkdesk.com/\">Talkdesk</a>, <a href=\"http://happyinspector.com/\">Happy Inspector</a>, and the list goes on. And many of them are KILLING it. (or well on their way)\n\nLast year, Dave called me to share an idea he had (note: most of the bat crazy shit we do starts with an “I have an idea” call from Dave). He was sick of getting pitched by photo-sharing startups with no revenue model, and also feeling bullish on “unsexy” startups - B2B, targeting a very clear market with strong revenue potential, and actually making money (something that most companies actually did back in ye olden days)…. and the unSEXY conference was born. The conference is not our way of shunning sexy consumer apps. In fact, we’re guilty of giving money to a few of them ourselves. Rather, we just think people (especially fellow investors) are missing out on a HUGE opportunity if they overlook companies that, at first glance, make them yawn.\n\nOn that note, I’m so excited to have folks like Dave Goldberg (CEO of <a href=\"http://surveymonkey.com/\">SurveyMonkey</a>, valued at $1 billion), Aaron Levie (CEO of <a href=\"http://box.com/\">Box</a>, valued at $600 million), Rashmi Sinha (CEO of <a href=\"http://slideshare.net/\">Slideshare</a>, acquired by LinkedIn for $119 million) + a many more amazing, incredible entrepreneurs <a href=\"http://unsexy.co/speakers\">speaking @ our unSEXY conference</a>. I hope this is the beginning of an unSEXY movement in Silicon Valley.\n\nLove the unSEXY. Embrace the unSEXY. Get all hot &amp; bothered about the unSEXY. Because companies that bring home bacon are fu#%ing HOT.\n\n<strong>P.S. If you want to come to <a href=\"http://unsexy.co/\">unSEXY </a>tomorrow but weren’t able to register online, never fear! Simply show up in person tomorrow and register on-site.</strong>\n\n&nbsp;",
    "type": "post",
    "path": "/2012/08/08/bacon-heartthrob-why-unsexy-startups-get-us-hot-bothered/"
}