{
    "title": "Blogging Is Like Oxygen",
    "slug": "blogging-is-like-oxygen",
    "date": "2010-10-12T18:28:07.000Z",
    "url": "http://blog.500startups.com/?p=1116714331",
    "uri": "http://500.co/2010/10/12/blogging-is-like-oxygen/",
    "postId": "1116714331",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "blogging",
        "blogs",
        "corporate-blogging",
        "ex-googler",
        "ex-youtuber",
        "marketing",
        "musings",
        "social-media",
        "tips"
    ],
    "content": "This morning, I came across a couple blog posts today on the topic of having a blog (yes, very meta):\n<ul>\n\t<li><a href=\"http://blog.kissmetrics.com/7-awesome-corporate-blogs/#\" target=\"_blank\">What can you learn from 7 awesome corporate blogs?</a> (from KISSMetrics' blog)</li>\n\t<li><a href=\"http://technorati.com/business/gurus/article/five-reasons-why-corporate-blogs-fail/\" target=\"_blank\">Five reasons why corporate blogs fail </a>(an older post from Technorati)</li>\n</ul>\nReading these made me take a step back and reflect on the 500 Startups Blog, as well as other corporate blogs I managed while I was at Google and YouTube. Everyone seems to include a blog and/or Twitter account as part of a big launch checklist. After the big announcement, more often than not these two properties start to gather cob webs because blogging and tweeting aren't considered high priority. To me, this is a huge mistake. <strong>If you've neglected your blog, either make time for it or hire someone to be its editor-in-chief and give it the attention it deserves. If you don't have a blog, get one and start writing.</strong>\n\nCorporate blogs accomplish one or more of the following goals. In no particular order:\n<ol>\n\t<li>Be the source of company news &amp; announcements - product launches, events, etc.</li>\n\t<li>Demonstrate thought leadership - a fancy way to say that the blog will produce unique content relevant for the company's customers. This might be tips, best practices, case studies, yada yada.</li>\n\t<li>Be a channel through which the company positions itself and shows its culture... i.e. some personality!!</li>\n\t<li>Become its own micro-community. Oftentimes blogs are made that much more valuable because of the active community and commenting that happens with each post.</li>\n</ol>\nFor 500 Startups, all of these goals apply to us - especially #3. Being open and transparent is <strong>very important</strong> to us, and our blog will help us stay true to that. The type of fodder we tend to post about includes the latest news with 500 Startups, share the immense amount of experience and tips possessed in the minds of our <a href=\"http://500startups.com/mentors.php\" target=\"_blank\">mentors</a> and <a href=\"http://500startups.com/companies.php\" target=\"_blank\">startups</a>, cool things our startups are doing, the evolution of the 500 Startups work space, and much more. While we want to show the world what we're all about, I think a more important goal here is that our blog content actually be helpful to people and not just marketing fluff.\n\nI'll close with a few specific tips I've found to be useful when running a blog. There are a ton of things I could list, but I'll keep it short and tangible:\n<ul>\n\t<li><strong>Create a blog pipeline</strong> that shows upcoming posts, when they're scheduled to go out, and current status. I like to do this with Google Spreadsheets and/or Google Calendar, but whatever tool(s) you prefer is fine. Just as long as you have some sort of schedule.</li>\n\t<li><strong>Post at minimum 3xs/week</strong>.  If you're up for the challenge, then try to post every day.</li>\n\t<li><strong>Establish topics what you will/will not post on your blog. </strong>This is good to do from the beginning, before your blog is live. It helps give a sense of purpose for what you want to use your blog for and how it's going to help your company. It'll also help you curate content.</li>\n\t<li><strong>Designate an editor-in-chief. </strong>Have one person who owns the blog. It is critical to have someone serve as the editor-in-chief and manage the schedule, curate blog post topics, edit for style/tone/grammar, and grow readership.</li>\n\t<li><strong>Syndication is king! </strong>Make sure your blog RSS works, your posts have \"Tweet This\" and Facebook \"like\" buttons and other sharing mechanisms, have a email subscription feature, etc.</li>\n\t<li><strong>Don't be a robot. </strong>If people comment on your blog, respond back to them. This goes for Twitter too.</li>\n\t<li><strong>DON'T BE BORING. </strong>There are TONS of blogs out there. You're competing for people's attention. Step out of your comfort zone and don't be afraid to shake things up.  I wrote the first version of our <a href=\"blog.500startups.com/2010/10/07/extra-extra-500-startups-announce-lex-luthor-tony-stark-jean-grey-join-500-mentors-brain-trust/\" target=\"_blank\">official mentor announcement</a>. It had all the right content, but it was pretty dry and standard. Dave said, \"Let's do SUPERHEROES!!\" I thought he was crazy. But it was perfect. (It also gave me a chance to sneak in some <a href=\"http://en.wikipedia.org/wiki/The_Big_Bang_Theory\" target=\"_blank\">Big Bang Theory</a> references... did you catch them??). The best part was when mentors started tweeting out their superhero alter egos.</li>\n</ul>\nAnd with that, I'm off to find myself some lunch! Would love to hear your own blogging tips - post a comment or <a href=\"http://twitter.com/christine_tsai\" target=\"_blank\">@-reply me</a>.",
    "type": "post",
    "path": "/2010/10/12/blogging-is-like-oxygen/"
}