{
    "title": "Brazilians in the Bay: Qual Canal Shares Their #500Strong Experience",
    "slug": "brazilians-in-the-bay-qual-canal-shares-their-500strong-experience",
    "date": "2013-02-20T07:25:59.000Z",
    "url": "http://500.co/?p=1116725669",
    "uri": "http://500.co/2013/02/20/brazilians-in-the-bay-qual-canal-shares-their-500strong-experience/",
    "postId": "1116725669",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/02/qual-canal.png",
        "http://500.co/wp-content/uploads/2013/02/fabricio.jpeg",
        "http://500.co/wp-content/uploads/2013/02/andrew.png"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "brazil",
        "qual-canal",
        "who-is-500"
    ],
    "content": "<strong>Every day this month, we’ll give you an inside look at 500 Startups. Today, some of our Brazilian brethren share what it was like to be part of our last accelerator batch. If you’re part of an awesome Brazilian startup, <a href=\"http://bit.ly/Applyfor500\">apply here</a> to be considered for 500’s Spring 2013 Accelerator batch. (Deadline is March 1) </strong>\n\n<a href=\"http://500.co/2013/02/12/vai-brasil-brazils-tech-scene-sambas-onto-the-worlds-stage/\">Last week</a>, we told told you why Brazil is an amazing place for tech and innovation – and why we're so excited to invest in awesome startups from the land of <a href=\"http://en.wikipedia.org/wiki/Capoeira\">Capoeira</a> and <a href=\"http://en.wikipedia.org/wiki/Xuxa\">Xuxa</a>. Today, founding members at Qual Canal, a social TV rating and engagement platform, share what their experience was like as part of 500's latest batch of startups.\n<p style=\"text-align: center;\"><a href=\"http://www.qualcanal.tv\"><img class=\"aligncenter size-full wp-image-1116725689\" alt=\"qual canal\" src=\"/backup/qual-canal-2013-02-20-13-01-25.png\" width=\"481\" height=\"149\" /></a></p>\n<em>\"500 startups’ accelerator program was a unique experience for me and Qual Canal's team. It began with all our great batchmates from around the world and continued with the awesome mentors and attention we received! Not to mention the other founders and 500 connections who were always open to talk to and help 500 companies. It’s a Super strong network! All these things blew our minds and changed our entrepreneur mindset forever.</em>\n\n<em>500 is so International: so many cultures, so many countries! For us, 500 Startups is a strong and big worldwide family that we are happy and proud to be part of. And now that the accelerator program has ended, its time to work harder and use this knowledge to grow our company.\"</em>\n\n<a href=\"/backup/fabricio-2013-02-20-13-01-25.jpeg\"><img class=\"size-full wp-image-1116725687 alignleft\" alt=\"fabricio\" src=\"/backup/fabricio-2013-02-20-13-01-25.jpeg\" width=\"140\" height=\"140\" /></a><strong>Fabricio Nogueira Buzeto, CTO, <a href=\"http://beta.qualcanal.tv/\">Qual Canal</a></strong>\n\n<em>“500 puts itself apart from others on the American market, and other funds, on how wide it spreads its investments. Most of the Americans believe that conquering their own territory must come before going after the global market. It's very understandable, but the fact that 500 goes after many different established markets around the world, not<a href=\"http://500.co/\"> </a>only allows a diversification of their investments but other benefits. </em>\n\n<em>One of them is the richness of experience among the batch mates. When you have the opportunity to see a new market and meet people who are on top of what's happening in their respective countries, it makes you feel like one of them. This, along with the strong feeling of collaboration that was kept during the whole program only increased the value added to the companies and the connections among them.”</em>\n\n<em><a href=\"/backup/andrew-2013-02-20-13-01-25.png\"><img class=\" wp-image-1116725683 alignleft\" alt=\"andrew\" src=\"/backup/andrew-2013-02-20-13-01-25.png\" width=\"128\" height=\"182\" /></a></em>\n<strong>Andre Terra, Co-Founder and CMO at <a href=\"http://beta.qualcanal.tv/\">Qual Canal</a> </strong>(read more about Andre's experience at 500 here:<a href=\"http://blog.buzeto.com/2013/02/500-miles.html\"> http://blog.buzeto.com/2013/02/500-miles.html)</a>\n\nWe're currently looking for badass startups for our next batch, so <a href=\"http://bit.ly/Applyfor500\">apply for our Spring Accelerator program now</a> if you think you fit the bill. Keep checking back for more content on the blog every day this month!",
    "type": "post",
    "path": "/2013/02/20/brazilians-in-the-bay-qual-canal-shares-their-500strong-experience/",
    "backgroundImage": "/backup/brazil-flag-960x540-2013-02-20-13-01-25.jpg"
}