{
    "title": "Breaking Down Borders: Why Language Startups Kick Ass",
    "slug": "breaking-down-borders-why-language-startups-kick-ass",
    "date": "2013-02-15T04:09:51.000Z",
    "url": "http://500.co/?p=1116725589",
    "uri": "http://500.co/2013/02/14/breaking-down-borders-why-language-startups-kick-ass/",
    "postId": "1116725589",
    "description": "",
    "images": [
        "https://lh4.googleusercontent.com/IztNNCH0VRgA9rgOKM_gRpkbc4dLllnkmFY0O7qhHUolYkNWGvcKANEMLKtXX4dIvJgLkPpNi4MJvSOByMhWlNjUcSvo6GO-PwrSfUx_Yq42FbNQw0IpHPB4"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "chinese",
        "international",
        "language",
        "waygo",
        "who-is-500-2"
    ],
    "content": "<strong>Every day this month, we’ll give you an inside look at 500 Startups. Today, we’re going global with a spotlight on why language startups are HOT. If you’re interested in being part of our Spring 2013 Accelerator batch,<a href=\"https://angel.co/500startups\"> apply here</a> before the March 1st deadline.</strong>\n\nIf you grew up in the United States, it’s easy to think our country is the center of the Universe. Even saying “America” or “American” ignores the fact that we’re just one nation that’s part of a region made up of a whopping 36 countries – Mexico, Argentina and Brazil are just as much a part of America as we are. Here’s the reality: just over 5.5% of THE WORLD speaks English natively. And as the internet is makes the world more connected than ever, we can’t continue to operate as if the United States – and moreover, Silicon Valley – is the only place that matters.\n\nUnfortunately, not all of us were lucky enough to grow up as polyglots (like <a href=\"https://twitter.com/bedy\">our own Bedy Yang</a>, who speaks English, Spanish, Portuguese, German, Mandarin and Taiwanese), and that’s where innovative startups enter the picture. Companies like <a href=\"https://www.languagecloud.co/\">Language Cloud</a>, <a href=\"http://www.mindsnacks.com/\">MindSnacks</a> and <a href=\"http://gengo.com/\">Gengo</a> are breaking down borders by making it easy for people communicate in other languages.\n\nWe’ll not afraid to trek anywhere on the globe in search of new talent (ok, maybe not anywhere, we’ve heard Antarctica is kinda cold), so investing in language startups is a no-brainer for 500. In addition to just being plain awesome, the market for these companies is truly massive. It’s not only travelers who need to understand what they’re hearing and seeing when visiting a foreign country; entire companies now need to do business in places where only knowing their native language won't get them very far.\n\nDuring our most recent accelerator, <a href=\"http://waygoapp.com/\">Waygo</a>, an amazing instant-translation app, came into the ranks for Batch 5. Here’s a bit from Waygo Founder and CEO, <a href=\"https://twitter.com/Ryan_Rogowski\">Ryan Rogowski</a>, on what spurred his interest in language, and what his experience has been like with 500:\n<p style=\"text-align: left;\"><em>\"My interest in language started with my first trip to Europe to play soccer in high school. I was fascinated by how many languages exist in the world beyond the little we know in the US. Americans are always dinged for being ignorant of other languages, but I always thought it was only because our average American doesn't have the opportunity to  be exposed to new places. I decided to study in Spain and China for language since that was the only way I thought one could really experience a new world. Now I hope to make this possible for anyone with the technology we are building at Waygo.</em></p>\n<p style=\"text-align: center;\"><img class=\"aligncenter\" alt=\"\" src=\"https://lh4.googleusercontent.com/IztNNCH0VRgA9rgOKM_gRpkbc4dLllnkmFY0O7qhHUolYkNWGvcKANEMLKtXX4dIvJgLkPpNi4MJvSOByMhWlNjUcSvo6GO-PwrSfUx_Yq42FbNQw0IpHPB4\" width=\"550px;\" height=\"305px;\" /></p>\n<em>The 500 Startups accelerator has been really rewarding both from a perspective of progress for the company, but also from a social perspective. Being a part of the 500 network has done wonders for meeting the right people in our space. We've met decision makers at Trip Advisor, TripIt, and other big travel brands. We've also had Dave McClure pound analytics and traction into our heads to the point where it is second nature to list off our credentials. It's good for us because it makes you realize the simple fact that \"you can't improve something you don't measure,\" as Dave would say.</em>\n\n<em>From a social perspective, we have been able to meet so many people from other parts of the world. I never thought I'd be working in the same space as startups from Croatian, Argentina, Taiwan and – yup – Tennessee, all at the same time! We've had some great cultural exchanges and plenty of hilarious lost in translation moments. I'm looking forward to seeing 500 grow as not just a startup community, but and international community of the brightest people around the globe helping each other to change the world.\"</em>\n\n<strong>Get Waygo on your smartphone by <a href=\"https://itunes.apple.com/us/app/waigo-translate/id496038103?mt=8&amp;ign-mpt=uo%3D4\">downloading it now.</a></strong>\n\nFor our next batch, we plan to continue our theme of world domination through international and language-focused startups. If you’d like to apply for our Spring Accelerator program (and I’m pretty sure you do), <a href=\"https://angel.co/500startups\">head over to our page on AngelList.</a>",
    "type": "post",
    "path": "/2013/02/14/breaking-down-borders-why-language-startups-kick-ass/",
    "backgroundImage": "/backup/chinesewriting-960x540-2013-02-14-13-22-09.jpg"
}