{
    "title": "Building a Startup Is Still Hard",
    "slug": "building-a-startup-is-still-hard",
    "date": "2011-12-06T02:44:51.000Z",
    "url": "http://500.co/?p=1116718962",
    "uri": "http://500.co/2011/12/05/building-a-startup-is-still-hard/",
    "postId": "1116718962",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/11/199598_696877005757_2600396_38155395_7214711_n1-250x239.jpg"
    ],
    "creator": "",
    "categories": [
        "daily-aisle",
        "jeff-lu",
        "musings"
    ],
    "content": "<a href=\"http://500.co/?attachment_id=1116718959\" rel=\"attachment wp-att-1116718959\"><img class=\"alignleft size-thumbnail wp-image-1116718959\" title=\"199598_696877005757_2600396_38155395_7214711_n\" src=\"/backup/199598_696877005757_2600396_38155395_7214711_n1-250x239-2011-12-05-11-20-44.jpg\" alt=\"\" width=\"175\" height=\"167\" /></a>\n\n<i>Jeff is the CEO and cofounder of <a href=\"http://www.dailyaisle.com/\">Daily Aisle</a>. It's the only place where engaged couples can search for their wedding venues based on date availability, price and head count. Prior to Daily Aisle, Jeff managed the Brokers Web insurance affiliate program and was an investment banking analyst.\n\n<em>Authors Note: I originally posted this on an obscure blog that very few people follow, and it was intended for a few close friends. I didn’t notice that the “send to twitter” option was checked as I published.</em>\n\n<em>I am generally a pretty private person and wouldn’t share something so soul-bearing to the world, but I’ve received an overwhelming response from other founders after the post went viral. All of their responses have empathized with what I wrote.</em>\n\n<em>I decided to keep the blog post up and allow 500 Startups to reblog in the hopes that it might reach other founders who are struggling with the ups and downs and entrepreneurship. In light of the <a href=\"http://www.ibtimes.com/articles/250404/20111116/diaspora-founder-s-suicide-ilya-zhitomirskiy-idealist.htm\">recent tragic news of Diaspora co-founder Ilya Zhitomirskiy</a>, I think it’s a healthy thing to be honest with each other about our struggles. I was actually supposed to go to a party at his house the night he passed away.</em>\n\n<em>Despite the semi-negative tone of this post, this is not a cautionary tale against entrepreneurship. Things are hard, but what you are experiencing is “normal.” Everyone around you is experiencing something similar. It’s part of what makes the journey so rewarding.</em></i>\n\n&nbsp;\n\nIt was supposed to be easy. I keep hearing and reading that Amazon and Rackspace were making it easier and cheaper to build web apps. Social platforms like Twitter and Facebook make it easier to acquire customers. Angels and VCs are throwing money at seed stage companies.\n\nThat’s all true. But unfortunately, it’s not easy.\n\nMy co-founder, <a href=\"https://twitter.com/#%21/kimsheblue\" target=\"_blank\">Kim Dowd</a>, and I had a good laugh yesterday reading Michael Arrington’s new blog <a href=\"http://uncrunched.com/2011/11/27/startups-are-hard-so-work-more-cry-less-and-quit-all-the-whining/\" target=\"_blank\">UnCrunched</a>.\n\nWe’ve recently had a tough couple of weeks. During a server migration, our dev accidentally deleted our bridal dashboard, which set us back a couple of days. We also decided to switch to a new CSS/HTML toolkit from Twitter called <a href=\"http://twitter.github.com/bootstrap/\" target=\"_blank\">Bootstrap</a>. It made our <a href=\"http://www.dailyaisle.com/\" target=\"_blank\">site</a> look better, and it should save us time in the future, but it set us back a week because we had to backward integrate our existing pages.\n\nPersonally, I feel a bit demoralized. I find it entertaining observing other startup founders. We all ask each other how everything is going and we all answer “GREAT” and then like a PR firm, we spew the latest good news spin. I then go grab drinks with a few close founder friends and we order stiff drinks, stare off like zombies, and talk about all the things going wrong with our companies:\n<blockquote><em><em><em>“I yelled at my co-founders and called them all idiots yesterday. I think they are still mad at me.”</em></em></em>\n\n<em>“I can’t close. XYZ VC won’t invest unless we have a lead and our lead wants to give us super pro rata rights.”</em>\n\n<em>“No one likes our CEO.”</em>\n\n<em>“My co-founder won’t talk to me.”</em>\n\n<em>“I have no idea how we are going to make money.”</em>\n\n<em>“My co-founder went home with the guy I brought out to the bars… WTF!”</em></blockquote>\nThose are all real quotes from founders I know, whose companies are perceived by the tech press to be doing well. That’s why reading Arrington’s post was so comforting.\n\nWe thought this was written by someone at 500 Startups this year:\n<blockquote><em><em><em><em><em>Well the kids went out to get drunk, or rather, more drunk. I think they might have actually gone out to a strip club again. How classy is that?</em></em></em></em></em>\n\n<em>Oh good, the kids are back, and they are well hammered. None of them can walk properly, and they keep bumping into the cubicle walls and making everything on my desk shake. Since I’m not drunk, the impedance mismatch makes it impossible for me to carry on a conversation with them, so I’m just trying to block them out. But now they’re all playing networked DOOM at top volume, so in order to concentrate, I have to wear headphones with music on at top volume, and even that doesn’t quite work. Since, as I mentioned, they keep making the mistake of trying to walk, and they’re making all the shit on my desk bounce around.</em>\n\n<em>It’s a saturday night, and I’m in my cubicle surrounded by a bunch of drunken farmboys from Illinois who haven’t been more than two miles from our office in scenic downtown Mountain View in four months.</em>\n\n<em>My ears are going to be ringing after this. Fuck it, I’m going home. (Check that — my ears are ringing.)</em></blockquote>\nBut this was written in 1994 by a <a href=\"http://www.jwz.org/gruntle/nscpdorm.html\" target=\"_blank\">Netscape employee</a>. It’s kind of funny to think that someone as brilliant as <a href=\"http://en.wikipedia.org/wiki/Jamie_Zawinski\" target=\"_blank\">Jamie Zawinski</a> had similar experiences to ours but only 17 years earlier.\n\nThe past 2 months have been pretty difficult for me. We were close to raising $1M twice but couldn’t quite cross the finish line. We decided to put off fundraising until after our product launches. The product has taken longer than expected and feel helpless, watching my cofounders kick-ass, and wishing I had learned to code (we are launching the private beta sometime this week!).\n\nMy relationship is on the rocks. She’s in Boston and I’m in SF, and we’ve been doing long distance for as long as we’ve been dating in person. I didn’t mail her anything for her birthday and she’s pissed. We both want her to move here but she won’t move here without a ring. I can’t blame her. Her entire life is there and moving for someone is risky.\n\nThe problem is I can’t afford a ring, and I wonder if I’m mature enough to take care of someone else. I can barely take care of myself, eating 1.5 meals a day. I’ve taken up the same time sleep schedule as the engineers, waking up at noon… on a good day.\n\nWhy am I telling you all of this? Because I don’t want to be another startup founder that tells you that everything is going great. We are funded by <a href=\"http://www.500startups.com/\" target=\"_blank\">500 Startups</a> and most recently participated in Lightspeed Venture Partner’s prestigious <a href=\"http://www.lightspeedvp.com/summerfellowships/\" target=\"_blank\">summer program</a>. Things are still hard. My professional life is hard and so is my personal life. I can relate with you.\n\nThe problem is, most people who are not founders don’t care how hard it is. Investors don’t care, my girlfriend don’t care. I don’t tell my parents how hard it is because they would probably just tell me to quit and get a real job. No one really cares.\n\nWhich is why I think about Ben Horowitz blog post almost every day “<a href=\"http://www.lightspeedvp.com/summerfellowships/\" target=\"_blank\">Just win.</a>”\n<blockquote><em><em><em><em><em>That might be the best CEO advice ever. Because, you see, nobody cares. When things go wrong in your company, nobody cares. The press doesn’t care, your investors don’t care, your board doesn’t care, your employees don’t care, even your mama doesn’t care. Nobody cares.</em></em></em></em></em>\n\n<em>And they are right not to care. A great reason for failing won’t preserve one dollar for your investors, won’t save one employee’s job, or get you one new customer. It especially won’t make you feel one bit better when you shut down your company and declare bankruptcy.</em>\n\n<em>All the mental energy that you use to elaborate your misery would be far better used trying to find the one, seemingly impossible way out of your current mess. It’s best to spend zero time on what you could have done and all of your time on what you might do. Because in the end, nobody cares, just run your company.</em></blockquote>",
    "type": "post",
    "path": "/2011/12/05/building-a-startup-is-still-hard/"
}