{
    "title": "Can You Really Build a Great Tech Firm Outside Silicon Valley?",
    "slug": "build-a-great-tech-firm-outside-silicon-valley",
    "date": "2011-02-18T06:36:41.000Z",
    "url": "http://blog.500startups.com/?p=1116715025",
    "uri": "http://500.co/2011/02/18/build-a-great-tech-firm-outside-silicon-valley/",
    "postId": "1116715025",
    "description": "",
    "images": [
        "http://www.grpvc.com/wp-content/uploads/mark_144x200_color.jpg",
        "http://www.bothsidesofthetable.com/wp-content/uploads/2011/02/sand-hill-road.jpg",
        "http://www.bothsidesofthetable.com/wp-content/uploads/2011/02/los-angeles2.jpg",
        "http://www.bothsidesofthetable.com/wp-content/uploads/2011/02/money-tree-VC.jpg"
    ],
    "creator": "",
    "categories": [
        "guest-posts",
        "mark-suster"
    ],
    "content": "<img class=\"alignnone\" title=\"Mark Suster\" src=\"/backup/mark_144x200_color-2011-02-18-11-00-36.jpg\" alt=\"\" width=\"200\" height=\"200\" />\n\n<em>Although 500 Startups is based in Silicon Valley, we have a number of startups, mentors, and advisors outside the valley - and even outside the country. So we thought it fitting to reblog <a href=\"http://twitter.com/#!/msuster\" target=\"_blank\">Mark Suster</a>'s recent post about building startups outside of Silicon Valley. Mark is a general partner at <a href=\"http://www.grpvc.com/\" target=\"_blank\">GRP Partners</a> and is based in LA. He founded <a href=\"http://www.launchpad.la/\" target=\"_blank\">Launchpad LA</a> and runs a popular blog, <a href=\"http://www.bothsidesofthetable.com/\" target=\"_blank\">Both Sides Of The Table</a>. </em>\n\n<em>Thanks Mark for giving us permission to reblog!  (View the <a href=\"http://www.bothsidesofthetable.com/2011/02/15/can-you-really-build-a-great-tech-firm-outside-silicon-valley/\" target=\"_blank\">original post here</a>)</em>\n\n<img class=\"alignnone\" title=\"Sand Hill Road\" src=\"/backup/sand-hill-road-2011-02-18-11-00-36.jpg\" alt=\"\" width=\"383\" height=\"500\" />\n\nLast year I was on Sand Hill Road in Silicon Valley meeting with one of the most prominent venture capital firms in the country.\n\nWe were talking about a company, <a href=\"http://www.factual.com/\" target=\"_blank\">Factual</a> (disclosure <a href=\"http://www.grppartners.com/\" target=\"_blank\">my firm</a> is an investor), which was founded by one of LA’s most talented Internet entrepreneurs, <a href=\"http://www.crunchbase.com/person/gil-elbaz\" target=\"_blank\">Gil Elbaz</a>, who as co-founder of Applied Semantics (purchased by pre-IPO Google for $102 million and now Google AdSense) is responsible for a large portion of the Internet’s monetization.\n\nThe VC partner, somebody I greatly respect said, “Yeah, we like Gil and what they’re doing. I’m just not sure you can build a great technology firm outside of Bay Area.”\n\nAnd this Silicon Valley bias isn’t limited to any single meeting – it has been a recurring theme in my time as a VC.  I’ve heard it many founders of VC backed companies in LA who tell me that in their NorCal VC meetings they are told, “we might be interested but we’d want you to relocate to the Bay Area if we funded you.”\n\nSo can you really build a great tech firm outside of Silicon Valley? Sure, but it will be different than the Bay Area ones. Let me use LA as an example.\n\n<img class=\"alignnone\" title=\"LA\" src=\"/backup/los-angeles2-2011-02-18-11-00-36.jpg\" alt=\"\" width=\"417\" height=\"288\" />\n\n<strong>Los Angeles</strong>\n\nI live in the city of Santa Monica. My daily coffee meetings are not surrounded by the Hollywood elite with discussions of scripts, scenes and casting. In my LA I often see computer screens open with entrepreneurs talking about digital media. I grant you, it’s not like <a href=\"http://www.coupacafe.com/\" target=\"_blank\">Coupa Cafe</a> in Palo Alto – but there is a burgeoning tech community much as you’d find in NYC these days.\n\nIt is the second largest city in the country with <a href=\"http://en.wikipedia.org/wiki/Los_Angeles\" target=\"_blank\">(18 million inhabitants)</a> (vs. <a href=\"http://en.wikipedia.org/wiki/San_Francisco_Bay_Area\" target=\"_blank\">7.5 million in SF Bay Area</a>). In my mind, Randy Newman said it best, “<a href=\"http://www.youtube.com/watch?v=le5aIqn_MfE\" target=\"_blank\">I love LA</a>” – idyllic weather, a mélange of cultures and big industry. We have world-class universities like Caltech, UCLA, USC and more.\n\nBut LA is not Silicon Valley and we don’t need to aspire to be so.\n\n<strong>1. Funding is different outside of Silicon Valley</strong>\nThere is no region in the country that comes close to having the sheer number of angels &amp; VCs that Silicon Valley has as well as the dollars that flow into the region (40% of all dollars, <a href=\"https://www.pwcmoneytree.com/MTPublic/ns/print.jsp?page=region&amp;\" target=\"_blank\">PwC Moneytree report</a>). So it would be unwise to say that funding outside of Silicon Valley will be easier. If you are talented, of course, you can get funded in any region with enough venture capital and obviously in markets outside of the Valley it is easier to get noticed and get access.\n\n<img class=\"alignnone\" title=\"PWC\" src=\"/backup/money-tree-VC-2011-02-18-11-00-36.jpg\" alt=\"\" width=\"496\" height=\"233\" />\n\nIn Silicon Valley you have mega venture capital funds who have a history of giving $20 million to early-stage technology companies hoping to swing for the fences and become the next Google, Facebook or Twitter.  The funds not only have gotten bigger but they have an amazing track record of funding the biggest names in the sector: Cisco, Apple, Google, Facebook.  As a result many funds are OK with big bets.\n\nWhen you’re one fund and have $600 million to invest it’s easier to take that kind of risk.  There are no $600 million funds in Los Angeles. My fund – at $200 million – is the largest in Southern California.\n\nLA generally doesn’t have an appetite for this kind of ‘swing-for-the-fences’ investment at early stages – and neither does your town.  LA investors are more pragmatic.  We tend to do more $2-3 million “A” rounds and we look for companies that have an early monetization strategy. Once we see proof of performance then raising $10-15 million is achievable.\n\n<strong>2. “Necessity is the mother of all invention” and drives business outside the Valley</strong>\nI like to repeat this phrase, which means that because investors have different expectations you find entrepreneurs that focus on nearer term monetization. You have no choice.\n\nThe result is that we’ve had a lot of innovation coming from LA and other regions outside Silicon Valley in terms of making money on the Internet. Many of the Valley tech firms saw advertising as “beneath them” and many VCs in the first boom encouraged people to focus on eyeballs rather than dollars. That’s convenience when your VC is hoping to write the next $20 million check. In our regions? Fuggetaboutit – <a href=\"http://movieclips.com/sy73x-jerry-maguire-movie-show-me-the-money/\" target=\"_blank\">show me the money</a>!\n\nSo as a region we created sponsored search (Overture), affiliate search (Applied Semantics, now AdSense), lead generation (LowerMyBills, ShopZilla, PriceGrabber), affiliate networking (Commission Junction, ValueClick, Fast Click), local merchant portals (CitySearch), Social Media advertising (MySpace), mobile games (JAMDAT),  local Internet advertising (ReachLocal), and content generation (DemandMedia). Each of these companies exited for more than $500 million and several north of $1 billion.\n\nLook beyond California and you have group purchasing (GroupOn in Chicago, LivingSocial in Washington DC), private sales (Gilt Groupe in NY, HauteLook in LA), artisan marketplaces (Etsy in NY), eCommerce (Amazon in Seattle) and on and on.\n\nTo be clear – nobody builds bigger “pure tech” firms than Silicon Valley. I don’t see this changing much like I don’t see you building blockbuster movies outside LA or shift the media buying center of gravity out of NY.  But you can build valuable Internet businesses outside of Silicon Valley.\n\n<strong>3. Recruiting &amp; retention will be different outside the Valley</strong>\nI meet with Bay Area entrepreneurs all the time and am actively looking to make investments there. But one common theme I’m hearing from there in 2011 is that it’s impossible to recruit. You have huge hiring volume coming from the new growth firms (Twitter, Zynga, Facebook) and huge retention battles &amp; hiring from Google, Apple, Cisco, Yahoo!, eBay and others.\n\nI talked to one startup CEO who told me, “you have young engineers who want to make $200,000 or more to work for me. It’s hard to get people to take a risk at a startup or for a reasonable salary with all this competition.  And many of the ones that do want to do startups are plotting their one YCombinator company. It’s fucking hard hiring right now.”\n\nAnd this is a prominent company that raised nearly $10 million and a CEO who is ex Google. Imagine<em>your</em> company hiring in the Valley.\n\nNow let’s think about retention. In the beautiful creative destruction that is produced in Silicon Valley (as a capitalist I admire this as a system), imagine what it does to staff retention. Every developer, biz dev person, marketeer or sales rep on your team will be surrounded by scores of companies calling them like Sirens to switch teams. Hit some bumps in the road? Good luck.\n\nOutside the Valley we have struggles, too. In LA you can attract a great team to build out your first 30-50 employees. If you hit a groove on funding and customer growth it does become a challenge to ramp quickly. Let’s be honest – we’re not Silicon Valley. Great companies like <a href=\"http://www.jewelmint.com/how-it-works/\" target=\"_blank\">BeachMint </a>that are growing at a rapid clip have to dig deep into their networks to meet hiring needs.\n\nYou don’t have a pool of thousands of Google engineers to hire when they’re ready to leave the mother ship.  You don’t have the founders of eBay, LinkedIn, Salesforce.com and Yahoo!.  You just don’t.  Get over it. I’ve talked with many great NYC startups facing the same problem.\n\nBut we do have great technology developers.  You can build a team of 100+ people in LA without needing to hire outside of LA.  If you want to scale to become a “huge” company you will find it difficult to scale to the level of the Valley sized companies.  But if you grow to be that big it would be a very nice problem to deal with.\n\nAnd as I’ve argued many times, if we can manage to build a “patron” company – one which grows large and build an ecosystem around it – it will have the ability to attract all of the best university talent graduating from Southern California. As an investor, this is a focus area for me.\n\nWhat you do have here – and in many regions around the country – is more loyalty.  You’re not in the grind of your staff being constantly approached by every other start-up within 10 miles.  So it’s always a trade-off.\n\n<strong>4. There are many strategic assets outside of Silicon Valley</strong>\nIn New York you have access to fashion, media, art and of course, financial services. You also have the headquarters of many of the countries largest companies. In Washington DC you have government &amp; defense. In San Diego you have Qualcomm so an entire mobile industry has been spawned. In Los Angeles you have large industries in garment industry, defense, games (both physical like Mattel and virtual like Activision) and music. And of course you have Hollywood.\n\nThat sets us up nicely for the next phase of the web. Everybody knows about <a href=\"http://www.businessinsider.com/the-aol-way\" target=\"_blank\">the leaked memo of AOL’s Tim Armstrong</a> saying he wants to up his content from 4% video to 70% video. The Internet is now faster, more dynamic and less about text. That sets LA &amp; NY up nicely for a number of emerging content creation industries.\n\nWhile nobody has yet “cracked the code” on production quality video over the Internet (YouTube won UGC video), there is a lot of innovation happening in LA from places like Eqal, Deca.TV, ThisWeekIn, Machinima &amp; <a href=\"http://www.youtube.com/user/Yourfavoritemartian#p/u/1/IoVb6-s-wEA\" target=\"_blank\">Maker Studios</a>.  These last two companies between them produce more than 500 million video views per month. That’s million, with an “M”. LA is producing content at scale.  So if you’re out to create content businesses there is no better time and no better place than here.\n\nAnd despite what I keep hearing from others – these are not content “hit businesses” they are “content production platforms” that are producing scale like I’ve never seen and at a cost structure that is astounding.\n\nWho is going to produce all the videos that we want to watch in the future about travel, cooking, film, culture, music and the like? Some of it will be UGC. Most of the good stuff will be produced in LA &amp; NY just like the tech firms of the past came from Silicon Valley. We have the actors, directors, producers, lighting specialists, writers, agents, post-production editors, etc.\n\nI’m “all in” on the future of TV and the longer it takes other investors to get on board the better.\n\n<strong>5. Communities outside the Valley have matured</strong>\nThe LA / Southern California market has many people who are now on their second and third companies. It’s true that MySpace didn’t become Facebook, but it did spawn 7 or 8 great LA companies run by founders with experience.  Zorik Gordon built &amp; IPO’s ReachLocal. Douglas Merrill, the former CIO of Google, is building his next company, <a href=\"https://www.zestcash.com/\" target=\"_blank\">ZestCash</a> in LA. <a href=\"http://en.wikipedia.org/wiki/Scott_Painter\" target=\"_blank\">Scott Painter</a>, founder of CarsDirect has created TrueCar (backed by GRP Partners).\n\nBrett Brewer has AdKnowledge. There is Adconian, Intelligent Beauty, LegalZoom, Burstly, ShoeDazzle and so many more I can barely name them all. All second or third time entrepreneurs.  Hautelook, Gogii, Magento.  My point is – great companies are being built here like they are in in New York, Boston and elsewhere.\n\nThere is a lot of talent here.  We’re not all about the beach and sun – although we enjoy that, too.  We have started to build initiatives like <a href=\"http://www.launchpad.la/\" target=\"_blank\">Launchpad LA</a> to help bring this community together and make it easier for first time entrepreneurs.  For those that are here – it’s time to stop comparing ourselves to Silicon Valley.  We have much to be proud of in our own right.  And there is still much work to be done. Now go build your patron company.\n\n<em>Sand Hill Road photo courtesy of <a href=\"http://www.flickr.com/photos/markcoggins/80003807/\" target=\"_blank\">Mark Coggins on Flickr</a>.</em>\n\n<em>To check out guest posts from folks also outside of the valley, check out <a href=\"http://500.co/2010/11/03/livin-la-vida-startup-in-beantown/\" target=\"_blank\">Roy Rodenstein's post on Boston</a> and <a href=\"http://500.co/2011/01/24/how-to-create-a-successful-startup-in-japan-in-10-easy-steps/\" target=\"_blank\">Robert Laing's post on Japan</a>.</em>\n\n<em>\n</em>",
    "type": "post",
    "path": "/2011/02/18/build-a-great-tech-firm-outside-silicon-valley/"
}