{
    "title": "Can You Picture That?",
    "slug": "can-you-picture-that",
    "date": "2011-01-29T01:16:31.000Z",
    "url": "http://blog.500startups.com/?p=1116714892",
    "uri": "http://500.co/2011/01/28/can-you-picture-that/",
    "postId": "1116714892",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/01/May2008_Alexa_Final_MEDIUM-150x150.jpg",
        "http://500.co/wp-content/uploads/2011/01/foodspotting-vision-full-662x1024.png"
    ],
    "creator": "",
    "categories": [
        "alexa-andrzejewski",
        "foodspotting",
        "guest-posts",
        "soraya-darabi",
        "startups",
        "startups",
        "ted-grubb",
        "women-2-0"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/01/May2008_Alexa_Final_MEDIUM.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714906\" title=\"Alexa Andrzejewski\" src=\"/backup/May2008_Alexa_Final_MEDIUM-150x150-2011-01-28-11-19-16.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>This post was written by <a href=\"http://twitter.com/#!/ladylexy\" target=\"_blank\">Alexa Andrzejewski</a>, co-founder and CEO of <a href=\"http://foodspotting.com\" target=\"_blank\">Foodspotting</a> (a 500 company). Based in San Francisco, Foodspotting is an interactive visual guide to good food and where to find it around you. Recently, Foodspotting <a href=\"http://www.foodspotting.com/blog/posts/71-foodspotting-raises--3-million-series-a-\" target=\"_blank\">announced</a> that they raised $3MM in Series A funding.</em>\n\nIn building my first startup, Foodspotting, I've realized that I've been given an incredible gift: For the first time in my life as a User Experience designer, I've found that<strong> if I can picture something, my team can make it real.</strong> Coming from the consulting world, where my designs rarely saw the light of day, this newfound power has been refreshing. But with great power comes great responsibility, because I've also found the reverse to be true:<strong> If I can't picture something, chances are it won't happen. </strong>And thus I've realized that diligently cultivating and communicating a concrete vision to my team is the most important thing I can do as a startup founder and CEO.\n\nSome of the best things that happened in 2010 were vision-driven:\n\n<a href=\"http://500.co/wp-content/uploads/2011/01/foodspotting-vision-full.png\"><img class=\"alignnone size-large wp-image-1116714899\" title=\"foodspotting-vision-full\" src=\"/backup/foodspotting-vision-full-662x1024-2011-01-28-11-19-16.png\" alt=\"\" width=\"500\" height=\"773\" /></a>\n\n<strong>Foodspotting began with a vision:</strong> The 6 months it took me to find my technical cofounder, <a href=\"http://twitter.com/#!/teddyg\" target=\"_blank\">Ted Grubb</a>, gave me all the time in the world to craft, visualize, validate and refine my vision for Foodspotting. The very first thing I did, before I ever opened up Photoshop or put down a line of prototyping code, was to capture the core ideas behind Foodspotting in a one-page poster (above). I used this poster to do some \"customer discovery\" (I ate out a lot and shared my poster with anyone who would listen), which enabled me to validate and refine my ideas. Over the course of these 6 months, as I solidified my vision through paper prototypes and image map prototypes, what began as a literal \"Yelp for Dishes\" evolved into the \"Visual guide to food and where to find it\" that it is today, and by the time I found my cofounder Ted, who also happens to be the world's fastest, or at least most fearless, coder, we were able to hit the ground running and launch a beta within a month.\n\n<strong>We launched with an epic food scavenger hunt:</strong> \"What if you turned your list of 100 Things to Try Before You Die into a citywide photo scavenger hunt?\" I cold called 7x7 Magazine, a glossy known best for its list of San Francisco's 100 best dishes, with this idea and some 7x7-branded mockups when Foodspotting was less than a month old. Given how much informal competition was already happening around the list, the idea struck a chord with 7x7, and we launched the 7x7 scavenger hunt and our location-based guides platform soon thereafter. We owe our early success in San Francisco to this partnership.\n\n<strong>We got Anthony Bourdain's recommendations on Foodspotting:</strong> \"Wouldn't it be great if you could launch Foodspotting and immediately see the nearest dishes that Anthony Bourdain has eaten?\" When <a href=\"http://twitter.com/#!/sorayadarabi\" target=\"_blank\">Soraya Darabi</a> joined us as our Head of Partnerships, I immediately expressed this dream to her. While she didn't know anyone at the Travel Channel at the moment, within a week, Soraya was having dinner with the President of the Travel Channel. In a matter of weeks, the location-based guides I'd wished for were live, and the Travel Channel was airing promo spots inviting viewers to \"Eat where Tony eats!\"\n\n<strong>Vision even helped us build a founding team to execute it: </strong>Of course, the vision was only part of the equation -- both of my cofounders have an amazing ability to execute, which has been what's made this experience so magical. But having a clear vision helped to attract these cofounders in the first place. The first time I met Ted, I pulled out that one-page poster. Even finding the right team members involved visualizing the ideal people, so that when we found them, we'd just know they were the ones. (Soraya actually WAS our vision of the ideal Head of Partnerships -- after we met her, we knew we wanted to find a third cofounder like her -- a vision that ultimately led us to recruit her.)\n\n<strong>We closed our seed and Series A based on a vision:</strong> In raising two rounds of funding, I took the advice of UX-minded angel [and 500 Startups Mentor] <a href=\"http://twitter.com/dshen\" target=\"_blank\">David Shen</a> to heart: David advises founders not to focus on what they can build today, but instead to \"construct the ultimate product for a given need, and then see if you can get there via your startup's evolution.\" The big idea I pitched to investors was that \"Foodspotting makes it easy to stumble upon good things in the world around you -- it's food today, but could easily be special dishes, special offers and even other products besides food in the future. We could be the Pandora for Food -- or the Pandora for Anything.\"\n\nNow not all of our projects at Foodspotting have come together quite so easily. Product ideas we spent good time on ended up half-baked and back-burnered (Cartspotting, the Japanese iPhone app), and few of our partnerships have rivaled 7x7 and the Travel Channel in their success. Looking back, I'll admit that my vision for some of these projects and partnerships was lacking or unclear.\n\nBut behind our biggest successes was a concrete idea with contagious appeal:\n<ul>\n\t<li>Find dishes, not just restaurants.</li>\n\t<li>A citywide food scavenger hunt.</li>\n\t<li>See where Anthony Bourdain eats wherever you go.</li>\n\t<li>A cofounder like Soraya.</li>\n\t<li>A Pandora for Food.</li>\n\t<li>10,000 Twitter followers by Christmas.</li>\n\t<li>500,000 users by the end of the year.</li>\n</ul>\nThese \"visions\" took the form of sketches, mantras, metaphors, mockups, photos and illustrations, but because all were articulated in a concrete, memorable way, they were easy to share, test, refine and execute.\n\nAs Foodspotting grows, it will be critical that everyone on the team has a role in shaping the vision for Foodspotting. We began 2011 with a \"visioning\" workshop, where I asked everyone to list the \"TechCrunch headlines they'd like to see in 2011\" -- as a way of forcing people to think beyond broad goals like, \"Partner with a TV network\" towards concrete missions like, \"Foodspotting partners with the Travel Channel so that you can eat where Tony eats wherever you go!\" We filled a wall with concrete ideas, and look forward to making them real in 2011.\n\nThis old adage is true for startups:<strong> \"If you can dream it, you can do it.\"</strong> The trick is taking the time to dream and making your dreams concrete.\n\n--\n<em> More food for thought…</em>\n\n<strong><a href=\"http://www.madetostick.com/excerpts/ \" target=\"_blank\">Made to Stick (Chip and Dan Heath)\n</a></strong>\"Take John F. Kennedy's famous 1961 call to \"put a man on the moon and return him safely by the end of the decade.\" Simple? Yes. Unexpected? Yes. Concrete? Amazingly so. Credible? The goal seemed like science fiction, but the source was credible. Emotional? Yes. Story? In miniature. Had John F. Kennedy been a CEO, he would have said, \"Our mission is to become the international leader in the space industry through maximum team-centered innovation and strategically targeted aerospace initiatives.\" Fortunately, JFK was more intuitive than a modern-day CEO; he knew that opaque, abstract missions don't captivate and inspire people. The moon mission was a classic case of a communicator's dodging the Curse of Knowledge. It was a brilliant and beautiful idea — a single idea that motivated the actions of millions of people for a decade.\"\n\n<strong><a href=\"http://www.core77.com/reactor/06.07_merholz.asp \" target=\"_blank\">The Experience is the Product (Peter Merholz)\n</a></strong>\"Experience strategy serves as 'a star to sail your ship by.' It's a clearly articulated touchstone that influences all the decisions made about technology, features, and interfaces. An experience strategy can take many forms. At heart it is a vision, an expression of the experience you hope customers will have. The user experience strategy is George Eastman's slogan for Kodak, 'You press the button, we do the rest.'\"\n\n<strong><a href=\"http://www.dshen.com/blogs/business/archives/the_ultimate_product.shtml \" target=\"_blank\">The Ultimate Product (David Shen)\n</a></strong>\"If you can imagine the ultimate product in your mind, I think it can give you guidance on how to build it. But if you don't know what that is, how can you know if you're on the right path to get there?\"\n\n<strong><a href=\"http://venturehacks.com/articles/vision \" target=\"_blank\">What's the vision? (Babak Nivi)\n</a></strong>\"Vision is aspirational. Google couldn’t claim to organize the world’s information when they wrote their first line of code. But they could aspire to it. Vision is free. Unlike your product, team, and traction, you can literally make it up.\" -Nivi from VentureHacks\n\n<strong><a href=\"http://www.adaptivepath.com/blog/2010/05/04/the-ux-driven-startup/ \" target=\"_blank\">The UX-Driven Startup (Me)\n</a></strong>For more on the early days of Foodspotting and some tools you can use to come up with, communicate and validate your vision, check out these slides from my UX-Driven Startup presentation.\n<div id=\"__ss_3959494\" style=\"width: 425px;\"><strong><a title=\"The UX Driven Startup: Crafting an Experience Vision\" href=\"http://www.slideshare.net/ladylexy/the-ux-driven-startup\">The UX Driven Startup: Crafting an Experience Vision</a></strong><object id=\"__sse3959494\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"425\" height=\"355\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowScriptAccess\" value=\"always\" /><param name=\"src\" value=\"http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=slidesv4-100504023549-phpapp02&amp;rel=0&amp;stripped_title=the-ux-driven-startup&amp;userName=ladylexy\" /><param name=\"name\" value=\"__sse3959494\" /><param name=\"allowfullscreen\" value=\"true\" /><embed id=\"__sse3959494\" type=\"application/x-shockwave-flash\" width=\"425\" height=\"355\" src=\"http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=slidesv4-100504023549-phpapp02&amp;rel=0&amp;stripped_title=the-ux-driven-startup&amp;userName=ladylexy\" name=\"__sse3959494\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object></div>",
    "type": "post",
    "path": "/2011/01/28/can-you-picture-that/"
}