{
    "title": "Celebrate The Small Victories",
    "slug": "celebrate-the-small-victories-2",
    "date": "2011-06-14T23:46:18.000Z",
    "url": "http://blog.500startups.com/?p=1116715387",
    "uri": "http://500.co/2011/06/14/celebrate-the-small-victories-2/",
    "postId": "1116715387",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/01/lion-o-150x150.jpg",
        "http://500.co/wp-content/uploads/2011/01/brendenmulligan-150x150.png"
    ],
    "creator": "",
    "categories": [
        "guest-posts",
        "mentors",
        "tips",
        "uncategorized"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/01/lion-o.jpg\"><img title=\"lion-o\" src=\"/backup/lion-o-150x150-2011-06-14-11-18-46.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2011/01/brendenmulligan.png\"><img title=\"brendenmulligan\" src=\"/backup/brendenmulligan-150x150-2011-06-14-11-18-46.png\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em><em>Meet Lion-O aka SuperMentor Brenden Mulligan (<a href=\"http://twitter.com/#!/bmull\">@bmull</a>). Brenden founded <a href=\"http://www.artistdata.com/us/\">ArtistData</a>, a music industry startup that enables artists to easily keep their content up-to-date across multiple marketing channels and consumer touch points, which was acquired in May 2010 by Sonicbids. More recently, he built <a href=\"http://www.photopile.me/\">PhotoPile</a> and <a href=\"http://www.morningpics.com/\">MorningPics</a>, two ways to revisit previously published Instagram memories. </em></em>\n\nStartups aren't easy. They are a never-ending series of extreme ups and downs.\n\nYour product launches! No one uses it. You get unexpected press and the user base spikes! The servers go down and all those users are pissed. You get funded by top-tier investors! A major tech blog claims a competitor will make your startup irrelevant. You strike an amazing partnership with the biggest company in the industry! The partner re-prioritizes and cancels the deal. Your company goes viral and the mainstream starts using it! Another company sues you for some stupid reason. You spin the lawsuit to generate international press! The legal fees bleed your company dry. Google wants to acquire you for tons of money! Then they acquire that competitor the tech blogs said would make you irrelevant. Oh, and the dog pissed all over your bed. And it smells.\n\nYou get the point.\n\nAlthough this scenario is extreme, it's not that exaggerated. It's different for every company but inevitably, you will go through some of the most intense joys and disappointments. It happens to everyone, even seasoned entrepreneurs. It's part of the process and why living this life is so exciting (and why having a supportive team/family is so important.)\n\nUnfortunately, the gaps between the cycles might (and usually do) contain more downs that ups. And often the downs are more extreme than the ups. So overall, especially at the beginning, the good times don't come as often as the challenging ones. It's rough, but there is one thing I learned to do to make this whole process easier (and more fun): celebrate the little victories.\n\nNow, I'm not encouraging entrepreneurs to get ahead of themselves, but I want to remind everyone that creating a business from an idea and having people express any interest in what you're doing is an insanely huge accomplishment. Be proud of it. Be excited when things go well.\n\nSome ideas of little victories to celebrate:\n*First employee hire\n*First time you see or hear about someone who you didn't talk to directly about your product, using it\n*When the first major company emails you about partnering\n*Someone expresses interests to acquire you\n*You get an email from a customer whose life is better because of what you created\n\nRemember, these are little victories, so the celebrations should be as well. Don't overdo it. The point is to do something just a little out of the ordinary and special. Take your team to go see a movie some afternoon when you'd normally be working. Or go eat taco's together away from your desks. Buy a new (reasonably priced) TV for the office. Bring in donuts one morning. Take everyone to go kart racing. Go to the supermarket and get them to make a $10 \"congratulations\" cake and bring it to the office. Hell, go buy a piñata and give your team a bat. Again, it's just a small, fun activity to reward yourself and your team for doing something great.\n\nAs important as it is to celebrate with your team is, it's equally important to share these little victories with your spouse. Most likely, whoever you share your life with hears you bitch more than they hear you celebrate. So make sure to share the good news with them too. Take them on a date. And again, make sure you're reinforcing how rewarding your career is. When you share good news, it makes it a lot easier for them to support you through the not-so-good news.\n\nWith my first startup, I would make sure to tell my wife every exciting thing that happened. For example, the first time we got an email showing serious acquisition interest, my wife and I went out to dinner to celebrate. Although we knew the deal probably wouldn't happen (it didn't), it was a huge accomplishment just to have someone express interest. That was worth raising a glass to.\n\nCelebrating these victories is healthy, and will make it easier to make it through the times when things seen dismal (incidentally, it's not nearly as dismal as you think). Everyone celebrates the big victories (the product launches, the funding, the user and revenue milestones, the exits). But make sure to take the time to celebrate the little ones too.",
    "type": "post",
    "path": "/2011/06/14/celebrate-the-small-victories-2/"
}