{
    "title": "Choosing The Right Metrics for Your Startup",
    "slug": "choosing-the-right-metrics-for-your-startup",
    "date": "2013-03-05T03:20:37.000Z",
    "url": "http://500.co/?p=1116726167",
    "uri": "http://500.co/2013/03/04/choosing-the-right-metrics-for-your-startup/",
    "postId": "1116726167",
    "description": "",
    "images": [
        "https://lh3.googleusercontent.com/682MDUSiTtJreWlr-3mu6Y4tIwBwohzn2AzkcBc47WxfiKNNCi2kjdxAxPSkj52mJc9-AuTTO9AuweLbGT1BRl2YDBEfZ47j43IVfxgmFKU24i6sTaXfdVUG1w",
        "http://500.co/wp-content/uploads/2013/03/Screen-Shot-2013-03-04-at-1.08.32-PM.png"
    ],
    "creator": "",
    "categories": [
        "analytics",
        "data",
        "data-2",
        "geckoboard",
        "guest-posts",
        "mentors",
        "metrics",
        "paul-joyce",
        "startups"
    ],
    "content": "<p style=\"text-align: left;\"><strong>In February 2013, <a href=\"https://www.geckoboard.com/\">Geckoboard</a> teamed up with Econsultancy to survey 368 startups about how they use data and what challenges they face in developing a culture of data. What follows is a brief synopsis of one of the more interesting themes – you can find the full report here: <a href=\"http://www.slideshare.net/geckoboard/data-drivenculture\">http://www.slideshare.net/geckoboard/data-drivenculture</a></strong><b><b>\n</b></b></p>\n\n<h3 dir=\"ltr\" style=\"text-align: left;\">On choosing the right metrics</h3>\n<p dir=\"ltr\">\"Human nature is such that if you show someone a metric, they will automatically work to try to improve it.\"</p>\n<p dir=\"ltr\">- <a href=\"http://www.forentrepreneurs.com/\">David Skok</a>, Matrix Partners</p>\n<b><b> When you choose a metric or set of metrics to collect and communicate, you’re making a statement and, knowingly or not, setting the priorities for those who see it. Make a bad choice and you risk skewed priorities and worse.</b></b>\n\nNearly a fifth (18%) of respondents to the survey said that they used more than 10 different services to gather data, revealing the wealth of data that can be collected. The list of potential metrics available to decision makers represents a constant challenge when it comes to executing a focused assessment of business performance. Google Analytics alone offers over 200 predefined dimensions and metrics to choose from and combine. Choosing the right metrics in the right context is one of the most crucial tasks for data driven organisations.\n\nAlmost half of the respondents to the survey do not feel confident about the metrics they are tracking. When viewed in the context of a startup culture, these results are not all that surprising. Most of the respondent’s comments on this question are around the need to be flexible and open minded to changes. It is part of the lean startup culture to avoid making assumptions without having a way to prove them. Being confident about the current metrics could be, to some companies, like declaring that the organisation has stopped learning.\n<img alt=\"\" src=\"https://lh3.googleusercontent.com/682MDUSiTtJreWlr-3mu6Y4tIwBwohzn2AzkcBc47WxfiKNNCi2kjdxAxPSkj52mJc9-AuTTO9AuweLbGT1BRl2YDBEfZ47j43IVfxgmFKU24i6sTaXfdVUG1w\" width=\"484px;\" height=\"234px;\" />\nWhat would you say is the top challenge in choosing the right metrics? [respondents could select more than one option]\n\nThe majority of respondents said that a key challenge in choosing the right metrics to measure was in understanding what the key drivers of the business are (61%), followed by having the right tracking in place (42%) and defining priorities and business goals (39%).\n\nThe nature of startups implies that historic data is not always available, so it is challenging to identify the key drivers of the business when, in some cases, the business model has not been fully defined or implemented.\n\nHowever, concentrating on one key metric can help to minimize ‘analysis paralysis’. This is what the authors of <a href=\"http://leananalyticsbook.com/\">Lean Analytics</a> call ‘The One Metric That Matters’. They explain:\n<p dir=\"ltr\">“The One Metric That Matters is the one number you’re completely focused on above everything else for the stage you’re at. Looking at CLV (customer lifetime value) isn’t meaningful when you’re validating a problem, but it might be the right metric to focus on as you’re approaching product/market fit. It most certainly is not a vanity metric!”</p>\n<p style=\"text-align: left;\"><b id=\"internal-source-marker_0.8899643649347126\"> Uncertainty is at the core of startups so being flexible to test and try different approaches to measurement is more a survival practice than an option.</b></p>\n<p style=\"text-align: left;\">So you've chosen the right metrics, you're collecting the stats and communicating them with your team, what now? Change them. Maybe not straight away, but depending on the stage your business is at and your goals, key metrics will change – and it's important to recognise that this is an organic part of developing a culture of data in your organisation. Challenging the efficacy of a metric to deliver the against your plan–  while being open and fleet-footed enough to swap them out for something better – is crucial to ensuring everyone if focused on the right thing.</p>\n<em><strong><a href=\"/backup/Screen-Shot-2013-03-04-at-1-08-32-PM-2013-03-04-13-21-20.png\"><img class=\"alignleft  wp-image-1116726169\" alt=\"Screen Shot 2013-03-04 at 1.08.32 PM\" src=\"/backup/Screen-Shot-2013-03-04-at-1-08-32-PM-2013-03-04-13-21-20.png\" width=\"168\" height=\"207\" /></a>Post contributed by <a href=\"https://twitter.com/paulmjoyce\" target=\"_blank\">Paul Joyce</a>, 36,  co-founder and CEO at Geckoboard. </strong>Geckoboard is a London based SaaS company that makes it easy for any business to see all of their key metrics in one elegant real-time dashboard.</em>\n\nGeckoboard connects to popular web services out of the box and their API makes it easy for customers to include data from their own sources too. Geckoboard has a team of 12 people based in London supporting over 1,800 customers from around the world.\n\n<em>Prior to starting Geckoboard Paul worked for financial institutions, designing and building data warehouses.</em>",
    "type": "post",
    "path": "/2013/03/04/choosing-the-right-metrics-for-your-startup/"
}