{
    "title": "Co-founding Love: Living the Childhood Dream ",
    "slug": "co-founding-love-living-the-childhood-dream",
    "date": "2012-09-08T01:44:44.000Z",
    "url": "http://500.co/?p=1116722893",
    "uri": "http://500.co/2012/09/07/co-founding-love-living-the-childhood-dream/",
    "postId": "1116722893",
    "description": "",
    "images": [
        "https://lh4.googleusercontent.com/D6ukgaIBRLVtrmKpX2RtlZpISL7j9sWWwaV8U85NB3uvRW5dMujvrv1_r4J_oAT_r_pDtoSd7UKrNZdK7gBIfrY4RMolSJiU_1fjRF8DWkqxCxe1Ttc",
        "https://lh5.googleusercontent.com/jgPuLjQ8EClebgsoweegrZcK2Fcz5aSZQ9jtrj6h_JHrtnqcv9ZKFMGw7cNv_x8A0GWmEOzCT_JdOfcpNNqZ2zh8A8HTBvJXHuefr1A9VYL4EeOum7Q"
    ],
    "creator": "",
    "categories": [
        "co-founders",
        "co-founding-love",
        "startups",
        "startups"
    ],
    "content": "Elizabeth Yin tells us how she met Jennifer Chin and started <a title=\"http://www.launchbit.com/\" href=\"http://www.launchbit.com/\">LaunchBit</a>, an ad network for email. It helps advertisers reach their target demographics through email channels, and helps email publishers monetize their emails. They were part of our 2nd accelerator batch. Follow LaunchBit on <a title=\"https://twitter.com/launchbit\" href=\"https://twitter.com/launchbit\">Twitter</a> and <a title=\"http://www.facebook.com/LaunchBit\" href=\"http://www.facebook.com/LaunchBit\">Facebook</a>.\n<p style=\"text-align: center;\"><img class=\"aligncenter\" src=\"https://lh4.googleusercontent.com/D6ukgaIBRLVtrmKpX2RtlZpISL7j9sWWwaV8U85NB3uvRW5dMujvrv1_r4J_oAT_r_pDtoSd7UKrNZdK7gBIfrY4RMolSJiU_1fjRF8DWkqxCxe1Ttc\" alt=\"\" width=\"516px;\" height=\"475px;\" />Winning a competition senior year</p>\nI met Jennifer the day before 6th grade.  We were eating popsicles quietly, as all our other classmates chatted about.  I was nervous about whether I’d make any new friends at my new school, but from that day on, Jennifer and I were inseparable.\n\nJennifer loved solving challenging problems, so we became friends quickly.  In 6th grade, she read some book on how to do complex square roots by hand, so for weeks, we entertained ourselves by making up large numbers and computing their square roots.  We spent the next several years building robots together.  For one competition, we entered a water-powered robot that sprayed the crowds, the judges, and ruined the course each time our bot moved forward.  We shared a quirky, techy sense of humor that no one else thought was funny.\n\nIn 9th grade, Jennifer asked me if I wanted to help her cousin with his internet startup during winter break.  We took the Caltrain up to San Francisco and helped them make ethernet cables from scratch and build tables and chairs.  I think we were largely unhelpful.  But, I left that experience so inspired -- it was awesome that a group of friends could get together, eat all the pizza they wanted, and build something.  That was what I wanted to do when I grew up.\n\nSo, Jennifer and I got really into building websites.  We even started a web business.  (which failed -- we had no idea how to do sales).  And, during junior year, we formed a pact -- that we would start a real company together someday.  We graduated and went to opposite coasts for college.  Over the next almost decade, we continued to tag-team on various software projects despite the distance.  But, the timing was never right to actually start a company together.\n<p style=\"text-align: left;\">In 2009, Jennifer was wrapping up her PhD at MIT and decided she was tired of the academic scene.  I was just wrapping up a failed startup with a different co-founder, so the timing was perfect.  I convinced her to move to Berkeley so we could experiment with different web ideas in-person.  Over the next few months, she got married and did long-distance to Boston with her new husband.  About a year in, my husband took a job in Boston, so the three of us moved back there, and Jennifer was reunited with her husband.  A few months later, we learned that we’d gotten into the second 500 accelerator batch, so I moved back to the Bay Area with Jennifer and her husband.  Right after Demo Day, Jennifer gave birth to her first son.  A couple weeks later, Jennifer was back to work, and her whole family lives with her parents to make childcare easy.\n<img class=\"aligncenter\" src=\"https://lh5.googleusercontent.com/jgPuLjQ8EClebgsoweegrZcK2Fcz5aSZQ9jtrj6h_JHrtnqcv9ZKFMGw7cNv_x8A0GWmEOzCT_JdOfcpNNqZ2zh8A8HTBvJXHuefr1A9VYL4EeOum7Q\" alt=\"\" width=\"NaN\" height=\"NaN\" />\nWith the LaunchBit team at an offsite</p>\nIn reflecting back on the last three years, things <a href=\"http://www.launchbit.com/blog/how-startups-really-survive/\">could’ve fallen apart really easily</a> through all the crazy moving, marriages and a kid, juggling of our two families’ schedules and their jobs.  I am grateful for all the sacrifices both of our families have made.  But, the amazing thing is I’ve never once thought that things would fall apart.  You can’t control the chaos and complications that are inevitable with starting a company, but, when you have worked with your best friend for nearly  two decades, you know things will just somehow work out.  Finding the right co-founder to work through all the challenges in starting a company is super important.  I feel really lucky to have met Jennifer on that fateful day before sixth grade.",
    "type": "post",
    "path": "/2012/09/07/co-founding-love-living-the-childhood-dream/"
}