{
    "title": "Co-founding Love: Looking Backwards",
    "slug": "co-founding-love-the-tweet",
    "date": "2012-08-04T00:16:14.000Z",
    "url": "http://500.co/?p=1116721671",
    "uri": "http://500.co/2012/08/03/co-founding-love-the-tweet/",
    "postId": "1116721671",
    "description": "",
    "images": [
        "https://sphotos-b.xx.fbcdn.net/hphotos-ash4/483189_453425738011785_2106658890_n.jpg",
        "http://500.co/wp-content/uploads/2012/07/Screen-shot-2012-07-26-at-2.30.05-PM.png",
        "http://500.co/wp-content/uploads/2012/08/IMG_3100-1024x768.jpeg"
    ],
    "creator": "",
    "categories": [
        "500-startups",
        "accelerator",
        "co-founders",
        "co-founding-love",
        "fashion-2",
        "startups",
        "startups"
    ],
    "content": "<div id=\":rp\">\n<div id=\":rr\">\n<blockquote>\n<div>\n<div>\n<blockquote>This story is by <a title=\"https://twitter.com/LeoAlmighty\" href=\"https://twitter.com/LeoAlmighty\" target=\"_blank\">Leo Chen</a> and how he, his co-founders <a title=\"https://twitter.com/junyulive\" href=\"https://twitter.com/junyulive\">Josh Chen</a><strong> </strong>and <a title=\"https://twitter.com/kristenslowe \" href=\"https://twitter.com/kristenslowe \">Kristen Slowe</a> came together to work on <a title=\"http://www.getmonogram.com/\" href=\"http://www.getmonogram.com/\" target=\"_blank\">Monogram</a>, a personalized shopping &amp; discovery app for the iPad. Monogram is part of our current 4th Accelerator Batch. Check out <a title=\"http://www.getmonogram.com/\" href=\"http://www.getmonogram.com/\" target=\"_blank\">Monogram</a> and follow them on Twitter <a title=\"https://twitter.com/monogram\" href=\"https://twitter.com/monogram\" target=\"_blank\">here</a>.</blockquote>\n</div>\n<div>\n\n[caption id=\"\" align=\"alignnone\" width=\"576\"]<img src=\"/backup/483189_453425738011785_2106658890_n-2012-08-03-12-19-16.jpg\" alt=\"\" width=\"576\" height=\"397\" /> Leo &amp; Kristen at 500 Startups Demo Day SF[/caption]\n<blockquote>\n<div></div>\n<strong>2010..</strong></blockquote>\n</div>\n</div>\n<div>\n<blockquote>In April 2010, I failed my first startup in Seattle after 2 years of non-stop grinding only to find myself nearly broke with a beaten self-esteem and what seemed like 2 years of my life down the drain. As much as people like to portray a failure as a badge of honor in the startup world, I certainly felt nothing but shame.  That same month, a friend recommended me to the Geeks on a Plane China trip and I immediately bought a ticket to China to join Dave McClure &amp; company. It was a completely spontaneous decision and given my financial health at the time, it was a rather irresponsible move.</blockquote>\n</div></blockquote>\n<blockquote>\n<div>\n<blockquote>\n<div>\n\nJosh was working in Beijing at the time and took a 1 day emergency flight from Beijing to Shanghai then back to Beijing. He almost missed his return flight but ended up sitting next to the Geeks on a Plane group on the plane. After landing in Beijing, Dave McClure invited him to a Startup2Startup the group was headed to so Josh grabbed his luggage and hopped onto the Geeks bus. We met at the event and stayed in touch via Twitter &amp; Facebook… After the trip, I ended up moving to Beijing to work for Amazon indirectly as a result of Geeks on a Plane.\n\nMeanwhile in San Francisco, my high school friend Justin Kan (<a href=\"http://justin.tv/\" target=\"_blank\">Justin.tv</a> /<a href=\"https://iamexec.com/\" target=\"_blank\">Exec</a>) began working on a men's fashion line with his long time friend Kristen. Kristen had been a merchandiser at TJX and Williams-Sonoma for 10yrs prior to attending FIDM. After graduating from FIDM, Justin and Kristen launched their men's apparel line, Sabøteur, and I helped make intros to apparel manufacturers in Asia.\n\n</div>\n<div>\n\n<strong>Come 2011..</strong>\n\nI was going to a concert in Beijing in April and sent out a tweet looking to borrow a telephoto camera lens. Josh replied and lent me his lens.\n\n<a href=\"http://500.co/?attachment_id=1116721319\" rel=\"attachment wp-att-1116721319\" target=\"_blank\"><img title=\"Screen shot 2012-07-26 at 2.30.05 PM\" src=\"/backup/Screen-shot-2012-07-26-at-2-30-05-PM-2012-08-03-12-19-16.png\" alt=\"\" width=\"492\" height=\"255\" /></a>\n\n</div></blockquote>\n</div>\n<div>\n<blockquote>That tweet led us to meet up and sparked conversation on startup ideas. In August, Josh and I got together to moonlight on some side projects mostly to get a feel for compatibility; turned out we really complimented each other on all levels and our motivations for doing startups were well aligned. In November, we decided to quit our jobs, came back to the US and worked full-time on what would become Monogram. With my experience at Amazon and Josh's expertise building e-commerce platforms at Newegg and Yintai.com, we knew we were both passionate about e-commerce. Initially our ideas were vague, we knew we wanted to be in e-commerce and saw the iPad as a huge opportunity. Beyond that, our ideas were mostly half baked and we spent the next couple of months running experiments to find a focus.</blockquote>\n</div>\n<div>\n<blockquote><strong>Finally in 2012..</strong></blockquote>\n</div>\n<div>\n<blockquote>We were in SF looking for funding in January and I sent Dave a DM on Twitter to chat about 500 Startups. Dave was kind enough to invite us to a 500 Startups happy hour and subsequently referred us to Christine Tsai (partner at 500).  After Josh and I joined 500 Startups, I reached out to Kristen to see if she was interested in working with us on Monogram. Kristen immediately understood our idea and was excited to help out part-time. Her expertise in fashion design and merchandising was the missing piece to our puzzle. She was so awesome we quickly brought her on as a co-founder to lead content strategy.</blockquote>\n</div></blockquote>\n<blockquote>\n<blockquote>It took a lot of serendipity, failure, rejections and persistence to bring our team together and build something we're proud of. Had I shutdown my first startup a few weeks later, I wouldn't have gone on Geeks on a Plane; had Josh missed his flight or sat in a different seat I'd probably still be in China; had my parents not sent me to private school, I wouldn't have met Justin and subsequently Kristen. Not to be overly sentimental and cliché, but Jobs said it best, \"you can't connect the dots looking forward; you can only connect them looking backwards.\"\n\n[caption id=\"attachment_1116721689\" align=\"aligncenter\" width=\"574\"]<a href=\"http://500.co/2012/08/03/co-founding-love-the-tweet/img_3100/\" rel=\"attachment wp-att-1116721689\"><img class=\" wp-image-1116721689  \" title=\"IMG_3100\" src=\"/backup/IMG_3100-1024x768-2012-08-03-12-19-16.jpeg\" alt=\"\" width=\"574\" height=\"430\" /></a> Josh and Leo working late at 500's office.[/caption]</blockquote>\n</blockquote>\n</div>\n</div>",
    "type": "post",
    "path": "/2012/08/03/co-founding-love-the-tweet/"
}