{
    "title": "Co-Founding Love: Giant Pig, Ham ",
    "slug": "co-founding-love-series-giant-pig-ham",
    "date": "2012-07-21T01:59:50.000Z",
    "url": "http://500.co/?p=1116721054",
    "uri": "http://500.co/2012/07/20/co-founding-love-series-giant-pig-ham/",
    "postId": "1116721054",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/07/sqoot-copy3.jpg"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<p style=\"text-align: left;\">This story is by Mo Yehia on how he met Avand Amiri. <a title=\"https://twitter.com/esmomo\" href=\"https://twitter.com/esmomo\">Mo</a> and <a title=\"https://twitter.com/avand\" href=\"https://twitter.com/avand\">Avand</a> are  co-founders of <a title=\"https://www.sqoot.com/\" href=\"https://www.sqoot.com/\">Sqoot</a>, a local ad network &amp; analytics tool. Sqoot is part of our current Spring 2012 accelerator batch.<strong></strong> Follow Sqoot on Twitter <a title=\"https://twitter.com/sqoot\" href=\"https://twitter.com/sqoot\">here</a>.</p>\n<em> <a href=\"http://500.co/2012/07/20/co-founding-love-series-giant-pig-ham/sqoot-copy-4/\" rel=\"attachment wp-att-1116721082\"><img class=\"size-full wp-image-1116721082 aligncenter\" title=\"sqoot copy\" src=\"/backup/sqoot-copy3-2012-07-20-12-20-59.jpg\" alt=\"\" width=\"434\" height=\"301\" /></a>\n</em>\n\nAfter quitting my job in finance in favor of playing polo in Argentina, a friend introduced me to TechStars. I applied to the Boulder program &amp; was asked to fly out as one of the top few dozen companies. After the day long event, the group strolled over to a local watering hole to drown its' sorrows. There, I met another \"contestant.\" He wore a sports coat and a tee-shirt with a giant pig logo. The pig's name was Ham, the contestant, Avand (in no particular order).\n\nThe next week, I met Avand in Chicago over dinner at Blackbird (it was the most I spent on dinner in 6 months). I pitched this crazy idea most easily described as \"Priceline for restaurants.\" He was skeptical (justifiably), but we stayed in touch. A month later we were both rejected from TechStars, and a month after that we were both accepted into competing incubators. Despite a competing offer, I somehow convinced Avand to join me at Dreamit Ventures. Fast forward 2 years, 3 cities, and 4 failed businesses, and we're still together, under the tutelage of the maestro, Dave McClure, &amp; The Greatest (Freak) Show on Earth, 500 Startups (booyah!). We wouldn't have it any other way.\n\n\"Timing, perseverance, &amp; ten years of trying will eventually make you look like an overnight success.\" - Biz Stone\n\n&nbsp;",
    "type": "post",
    "path": "/2012/07/20/co-founding-love-series-giant-pig-ham/"
}