{
    "title": "Co-Founding Love: Lifelong Business Partners",
    "slug": "co-founding-love-lifelong-business-partners",
    "date": "2012-09-25T06:41:14.000Z",
    "url": "http://500.co/?p=1116723274",
    "uri": "http://500.co/2012/09/25/co-founding-love-lifelong-business-partners/",
    "postId": "1116723274",
    "description": "",
    "images": [
        "http://blog.limk.com/wp-content/uploads/2012/09/oguz_ozer-blog.jpg"
    ],
    "creator": "",
    "categories": [
        "co-founding-love"
    ],
    "content": "<em>This story is by <a href=\"http://angel.co/oguzserdar\">Oguz Serdar</a>, co-founder of <a href=\"http://angel.co/limk\">Limk</a>. This story is on how he met his fellow co-founder <a href=\"http://angel.co/ozerdolekoglu\">Ozer Dolekoglu</a>. Limk aims to cut through web noise intelligently by checking the social graph of every single user and offer them related deals or goodies. Follow them on <a title=\"https://twitter.com/limk\" href=\"https://twitter.com/limk\">Twitter</a> and <a title=\"http://www.facebook.com/limkcom\" href=\"http://www.facebook.com/limkcom\">Facebook</a>.\n</em>\n\n<a href=\"/backup/oguz_ozer-blog-2012-09-25-12-01-41.jpg\"><img title=\"Ozer Dolekoglu and Oguz Serdar, co-founders of Limk\" src=\"/backup/oguz_ozer-blog-2012-09-25-12-01-41.jpg\" alt=\"\" width=\"420\" height=\"286\" /></a>\n\n<a href=\"http://angel.co/ozerdolekoglu\">Ozer Dolekoglu</a>, Product Guy (left) and <a href=\"http://angel.co/oguzserdar\">Oguz Serdar</a>, Chief Hustler (right)\n\nIn early 2009, I was trying to learn more about the tech scene of Adana (a southern city in Turkey that I moved for my civil engineering major). After few months of non-stop searching for individuals by attending related university clubs, participating online communities, etc., I was getting nervous whether I’d find any new people who are into startups at my new city. The moment when I was ready to quit that search, I decided to take a look at Twitter (it was really unpopular in Turkey) by listing accounts from Adana. Surprisingly, I noticed one of my favorite bookmarking services name: Limk. That was a moment of surprise when I found out that Ozer, the founder of Limk, was living in Adana like me. After checking his social networks, I also noticed that he was <a href=\"http://www.youtube.com/watch?v=o5QKAqrKXlk\" target=\"_blank\">rocking</a> with his band as a hobby.\n\nI sent him a message explaining my situation. We met, talked about lots of stuff after his performance. From that day on, as two guys (with 14 year age gap!), who earned their life on various internet businesses became inseparable.\n\nWe started Adana chapter of Likemind events to fix  the lack of attention. It was our first attempt together. Turns out, not a lot of tech people exist in our city and we decided to let it go. We focused our attention on implementing new ideas to Limk and hosted the first WordCamp Turkey event by bringing <a href=\"http://televidyon.com/p/2669/matthew-c-mullenweg---wordpress\" target=\"_blank\">Matt Mullenweg</a> and <a href=\"http://televidyon.com/p/2672/timothy-ferriss-%26Atilde%3B%26cent%3B%26acirc%3B%82%26not%3B%26acirc%3B%80%9C-the-4-hour-workweek\" target=\"_blank\">Tim Ferriss</a> to Istanbul. We hustle hard! Later, we contacted big players of the startup scene including TheNextWeb Blog.  After long conversations over Skype with the founders, we launched a local TNW Blog in Turkish. That later led the blog team to scale growth by focusing on different channels &amp; languages. After working six to seven months together for TNW, we plunged into developing the new idea forming the media network Limk. Shortly after deferring my enrollment for Civil Engineering (Cukurova University) and Business Administration (Anadolu University), I found myself in Chile with no time to lose in the Start-Up Chile program. Graduating from the program, Limk is almost ready to launch with over 70,000 users on the waiting list, and we’re definitely relocating to San Francisco.\n\nReflecting back on the last three years, we're definitely believers in the saying “being co-founders is like being married without sex”. We experienced a lot of ups and downs together. I saw Ozer cry when he became a dad for the first time, and he has helped me so many times through my personal struggles. We have our share of fights along the way too. Solid relationships are built on trust, clear communication, and compassion over an extended period of time. It’s a very difficult journey, but having co-founders that believe in you and share your vision, that makes the journey more manageable. I feel really lucky to have Ozer as a lifelong friend, business partner, and I am grateful for that day we met.",
    "type": "post",
    "path": "/2012/09/25/co-founding-love-lifelong-business-partners/"
}