{
    "title": "Co-founding Love: 2 Husbands",
    "slug": "co-founding-love-2-husbands",
    "date": "2012-09-14T23:56:30.000Z",
    "url": "http://500.co/?p=1116723021",
    "uri": "http://500.co/2012/09/14/co-founding-love-2-husbands/",
    "postId": "1116723021",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/09/ion_founders_seated-1024x681.jpg"
    ],
    "creator": "",
    "categories": [
        "co-founding-love",
        "startups"
    ],
    "content": "<div>\n<div>\n\n<em>This story is by Anna Talerico, co-founder of <a href=\"http://www.ioninteractive.com/liveball-marketing-software/\" target=\"_blank\">LiveBall</a>. Her story is on how she met her fellow co-founders Justin Talerico and Scott Brinker. Liveball is a cloud-based platform used by hundreds of global brands to create and optimize post-click web experiences. They also offer a wide-range of strategic services for companies who need help in the planning, execution and optimization of their post-click programs. Follow LiveBall on <a title=\"https://twitter.com/ioninteractive\" href=\"https://twitter.com/ioninteractive\">Twitter</a> and <a title=\"http://www.facebook.com/ioninteractive\" href=\"http://www.facebook.com/ioninteractive\">Facebook</a>.</em>\n<div></div>\n&nbsp;\n<div><a href=\"http://500.co/2012/09/14/co-founding-love-2-husbands/ion_founders_seated/\" rel=\"attachment wp-att-1116723047\"><img class=\"size-large wp-image-1116723047\" title=\"ion_founders_seated\" src=\"/backup/ion_founders_seated-1024x681-2012-09-14-12-18-56.jpg\" alt=\"\" width=\"500\" height=\"332\" /></a></div>\n<div>Justin, CEO (left), Scott President and CTO (middle), with Anna, EVP (right).</div>\n<div></div>\n&nbsp;\n<div>I love my co-founders! Justin, Scott and I are 'married' to our company—bound together in holy entrepreneurship (Justin and I also happen to be bound together in holy matrimony too).</div>\n<div></div>\n&nbsp;\n<div>We joined forces about 14 years ago. Justin and I were designing websites,  but we didn't have any backend software expertise. We met Scott through a mutual customer, and started to partner on large-scale web development projects. It was a match made in heaven—Justin would design high-end sites for companies like Siemens and Fujistu, I was managing the client relationships and Scott's company would bring them to life with sophisticated functionality. After several projects we decided to form a company together.</div>\n<div></div>\n&nbsp;\n<div>For many years we were a small, boutique, bootstrapped web development company. It was a great business. The three of us would travel frequently, spending most of our time together, working and playing. Around 2000, Scott moved to New York to purse a degree at Columbia and take a bite out of the big apple. We continued growing our business and work together despite the distance. And throughout our time together,  we knew there was more to accomplish together.  The three of us started to become focused on helping our customers get better results from their online marketing campaigns. We heard over and over from our web development customers that they needed an easier way to produce effective pages for their campaigns and run tests on them to optimize for better ROI. In 2007 we decided to leave behind the web development work and launch a software-as-a-service that would help marketers create and test conversion-focused web experiences.</div>\n<div></div>\n&nbsp;\n<div>We launched our product, LiveBall, that same year, and never looked back. We're still bootstrapped (I prefer \"self-funded\"), and we've been growing 60-100% each year. We have aggressive goals for growth over the next couple of years and are well-positioned to take advantage of what's going on across the online marketing landscape.</div>\n<div></div>\n&nbsp;\n<div>Our joint aspirations are big and our work is intense. The great thing about what we are doing is how well the three of us work together. What makes it work is our differences. We each focus on separate aspects of the business. It allows us to use each other as sounding boards and collaborate, with little concern for stepping on each others toes. Our individual domains are very well defined—Scott leads product development and evangelism, Justin leads operations, marketing and partnerships, and I head up the sales and service teams.</div>\n<div></div>\n&nbsp;\n<div>All three of us are only children, but we share and compromise well. Some people say the fact that all three of us are only children meant we were doomed to fail together—that we would each be too self-centered having not learned the lessons that come with sibling relationships. I disagree. I think it's another commonality that brings us together and helps us take our shared responsibility even more seriously.</div>\n<div></div>\n&nbsp;\n<div>\n<div>I often tell people I have two husbands—my co-founders Scott and Justin.  I don't say that lightly. Co-founding a company takes a serious commitment to each other. To work through things, to dig deep and to share the good and bad times together. It's a wild ride, and we love it.</div>\n</div>\n&nbsp;\n\n</div>\n</div>",
    "type": "post",
    "path": "/2012/09/14/co-founding-love-2-husbands/"
}