{
    "title": "Co-founding Love: Skydiving",
    "slug": "co-founding-love-skydiving",
    "date": "2012-09-01T03:49:46.000Z",
    "url": "http://500.co/?p=1116722619",
    "uri": "http://500.co/2012/08/31/co-founding-love-skydiving/",
    "postId": "1116722619",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/08/RGQGO3P.jpg",
        "http://500.co/wp-content/uploads/2012/08/WanderIDcofounders.jpg"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<em>This story is by Mary Haskett, Co-founder of Tactical Information Systems the creators of WanderID. WanderID lets parents upload information about their child into a database. With it is a complementary smart phone app that uses biometric face matching technology. This technology allows police or hospital personnel to take a photograph of a lost child, find them in their database, and then connect them back to their parents in minutes. You can learn more at <a href=\"http://www.wanderid.com/\" target=\"_blank\">www.wanderid.com</a>. Follow WanderID on <a title=\"https://twitter.com/Wander_ID\" href=\"https://twitter.com/Wander_ID\">Twitter</a>  and on <a title=\"www.facebook.com/wanderid\" href=\"www.facebook.com/wanderid\">Facebook</a>.</em>\n\nI met Alex Kilpatrick when we were undergraduates in college (it was the 80s). I was a member of the Texas A&amp;M Skydiving Club and working at a skydiving school and he wanted to learn how to skydive. We became friends and he kept jumping and got his jump master certification when I got my instructor certification. When he graduated he went to California and joined the Air Force and I got a degree in Applied Math, stayed in Texas and kept skydiving.\n<p style=\"text-align: center;\"><a href=\"http://500.co/2012/08/31/co-founding-love-skydiving/rgqgo3p/\" rel=\"attachment wp-att-1116722765\"><img class=\"aligncenter  wp-image-1116722765\" title=\"$RGQGO3P\" src=\"/backup/RGQGO3P-2012-08-31-12-22-49.jpg\" alt=\"\" width=\"403\" height=\"302\" /></a></p>\nI kept in touch with Alex, we would talk once a year or so and exchange email and holiday cards. After graduate school, my husband and I sold the skydiving school and started a training company -- my first “real” startup. I bootstrapped that company and one day Alex contacted me – he had his Ph.D. in Computer Engineering, had been managing the Air Force’s basic research in Computer Science but was ready to leave the Air Force and do something else. We decided to see if we could sell immersive, simulation based training and he moved his family to Texas and started working for me. Turns out not many people want to pay for very high-end training and eventually Alex left and started doing research for DARPA and then started working for a defense contractor in biometrics.\n\nLater, he was working on a biometrics project for a foreign government and realized that they needed really good training. He called me and his company hired me as a vendor to produce training for his project. Of course, Alex supervised my team. Eventually that defense company bought my company and Alex became my boss. The company grew rapidly and eventually we both knew we wanted to do something else. Alex had worked for me and I had worked for him, so after twenty years it just seemed like it was time to start something new and be co-founders. We brainstormed and considered and thought and eventually quit our jobs to start WanderID – an ID service for young children. Almost nothing about the startup went the way we planned, and we have had our share of fights along the way.  However, our long-time friendship and compatible values has allowed us to handle the fights and move on. I do believe that if you aren’t occasionally fighting with your co-founder, you aren’t communicating.  You just have to be able to move past the fights and get on with the mission.\n<p style=\"text-align: center;\"><a href=\"http://500.co/2012/08/31/co-founding-love-skydiving/wanderidcofounders/\" rel=\"attachment wp-att-1116722767\"><img class=\"aligncenter  wp-image-1116722767\" title=\"WanderIDcofounders\" src=\"/backup/WanderIDcofounders-2012-08-31-12-22-49.jpg\" alt=\"\" width=\"480\" height=\"360\" /></a></p>",
    "type": "post",
    "path": "/2012/08/31/co-founding-love-skydiving/"
}