{
    "title": "Cohort Metrics For Startups Revealed - Part I: Plain English",
    "slug": "cohort-metrics-for-startups-revealed-part-i-plain-english",
    "date": "2011-07-13T10:01:09.000Z",
    "url": "http://blog.500startups.com/?p=1116715682",
    "uri": "http://500.co/2011/07/13/cohort-metrics-for-startups-revealed-part-i-plain-english/",
    "postId": "1116715682",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/02/fantastic4silversurfer-150x150.jpg",
        "http://500.co/wp-content/uploads/2011/02/danmartell-150x150.jpg",
        "http://farm1.static.flickr.com/36/116220689_438039ddb3.jpg",
        "http://farm5.static.flickr.com/4074/4869860909_2c68df46bf.jpg",
        "http://farm4.static.flickr.com/3016/2879482838_951ccf3277.jpg"
    ],
    "creator": "",
    "categories": [
        "guest-posts",
        "mentors",
        "uncategorized"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/02/fantastic4silversurfer.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714955\" title=\"fantastic4silversurfer\" src=\"/backup/fantastic4silversurfer-150x150-2011-07-13-11-05-01.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2011/02/danmartell.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714956\" title=\"danmartell\" src=\"/backup/danmartell-150x150-2011-07-13-11-05-01.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet Silver Surfer aka 500 SuperMentor Dan Martell (<a href=\"http://twitter.com/danmartell\" target=\"_blank\">@danmartell</a>).  Dan is the Co-Founder of <a href=\"http://www.flowtown.com\" target=\"_blank\">Flowtown</a>, a social marketing application for businesses.  Self diagnosed as having intense ADHD, you can either find him hosting dinners, speaking about marketing or jumping off cliffs around the world.</em>\n\n<em>Authors note: This post was written in collaboration with <a href=\"https://github.com/assaf\">Assaf Arkin</a>, Flowtown’s lead engineer and the creator of <a href=\"http://vanity.labnotes.org/rails.html\">Vanity</a> - a ruby framework for experiment driven development (EDD).</em>\n\nEvery time I speak at a conference and present how we do weekly cohorts for our product metrics, everyone wants an explanation.  They kind of get it, but don’t fully understand it.  The following 2 part series is going to try and define what a cohort is and then how to understand aged groups.  If you have any subsequent questions - please ask in the comments.\n\n<strong>Cohorts in plain English\n</strong>\n<a title=\"Our Direction by B Tal, on Flickr\" href=\"http://www.flickr.com/photos/b-tal/116220689/\"><img src=\"/backup/116220689_438039ddb3-2011-07-13-11-05-01.jpg\" alt=\"Our Direction\" width=\"500\" height=\"360\" /></a>\n\nA cohort is a group of people who share a common characteristic or experience within a defined period. For example, all the people who signed up for our service on a given week, or all the people who signed up from Facebook, Twitter or other channels, or all the people who signed up for our basic, premium or supreme plans.\n\nI'm going to start with a simpler examples, and then work to describe age cohorts, which seems to confuse more people. Let's start by dividing our customers based on the channel from which they came through.\n\n<strong>Grouping activity into cohorts\n</strong>\n<a title=\"Salutation Nation - 137 by lululemon athletica, on Flickr\" href=\"http://www.flickr.com/photos/lululemonathletica/4869860909/\"><img src=\"/backup/4869860909_2c68df46bf-2011-07-13-11-05-01.jpg\" alt=\"Salutation Nation - 137\" width=\"500\" height=\"333\" /></a>\n\nSay we run ads through several channels. A conversion analysis may tell us something like this:\n[table id=1 /]\n\nWe don't care how many impressions we got, as you can seen they're not correlated with number of signups.  It's a vanity metric.  We don't care how many signups we got either, we can always get more by spending more on a given campaign.  What's more interesting is, which channel should we double down on to get the best customers for the least amount of money.\n\nAnd you would think the answer is A.  At $1.11/signup, channel A is %13 cheaper than channel B and 20% cheaper than channel C.  Clearly we should be doubling down on channel A and forgetting about the under performing channels B and C. But is that the truth?\n\n<strong>Aligning the channel</strong>\n\n<strong><a title=\"Rush by urish, on Flickr\" href=\"http://www.flickr.com/photos/urish/2879482838/\"><img src=\"/backup/2879482838_951ccf3277-2011-07-13-11-05-01.jpg\" alt=\"Rush\" width=\"500\" height=\"375\" /></a></strong>\n\nOur business is based on subscriptions, so let's have a look at the life time value of each channel:\n[table id=2 /]\n\nAs you can see, customers that came through channel C remained customers for an average of 8 months, 45% longer than customers who came through channel A. More customers that came through channel C choose the $10 and $20/month subscription plan, whereas customers coming through channel A opted for the $5 and $10/month plans.\n\nAs a result the customer life-time value of channel C is more than double that of channel A.  It may be 20% more expensive to acquire customers through channel C, but that $4 cost translates into $51 more revenue.\n\nWhat we've done here is segment out customer base into cohorts, each cohort representing a group of customers we acquired through a given channel, and then looked at their behavior over time.  That's a typical cohort analysis.\n\nIf you have any questions, please don’t hesitate to leave a question in the comments.\n\nUPDATE: Part II continues <a href=\"http://500.co/2011/07/14/cohort-metrics-for-startups-revealed-part-ii-aged-groups/\" target=\"_blank\">here.</a",
    "type": "post",
    "path": "/2011/07/13/cohort-metrics-for-startups-revealed-part-i-plain-english/"
}