{
    "title": "Congrats Team CardMunch!",
    "slug": "congrats-team-cardmunch",
    "date": "2011-01-27T13:09:26.000Z",
    "url": "http://blog.500startups.com/?p=1116714879",
    "uri": "http://500.co/2011/01/27/congrats-team-cardmunch/",
    "postId": "1116714879",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/01/cardmunchlinkedin_logo-1024x153.png",
        "http://www.k9ventures.com/wp-content/uploads/2011/01/BusinessCardPile.jpg",
        "http://www.k9ventures.com/wp-content/uploads/2011/01/PrivilegeTweet.jpg"
    ],
    "creator": "",
    "categories": [
        "announcements",
        "cardmunch",
        "guest-posts",
        "k9-ventures",
        "linkedin",
        "manu-kumar",
        "mentors"
    ],
    "content": "<em>This post was written by 500 Mentor <a href=\"http://twitter.com/manukumar\" target=\"_blank\">Manu Kumar</a> and originally published on his <a href=\"http://www.k9ventures.com/2011/01/congrats-team-cardmunch/\" target=\"_blank\">blog at K9 Ventures</a>.\n</em>\n\n<em><a href=\"http://500.co/wp-content/uploads/2011/01/cardmunchlinkedin_logo.png\"><img class=\"alignnone size-large wp-image-1116714880\" title=\"cardmunchlinkedin_logo\" src=\"/backup/cardmunchlinkedin_logo-1024x153-2011-01-27-11-07-09.png\" alt=\"\" width=\"500\" height=\"74\" /></a></em>\n\n<a href=\"http://www.cardmunch.com/\">CardMunch</a> <a href=\"http://cardmunch.posterous.com/big-news-from-cardmunch\">announced today</a> that it has been acquired by <a href=\"http://www.linkedin.com/\">LinkedIn</a>! The CardMunch acquisition marks the debut exit for K9 Ventures. A huge congratulations to the team: <a href=\"http://www.linkedin.com/in/boweigai\">Bowei Gai</a>, <a href=\"http://www.linkedin.com/in/sidviswanathan\">Sid Viswanathan</a>, and <a href=\"http://www.linkedin.com/pub/sudeep-yegnashankaran/4/bb8/8b7\">Sudeep Yegnashankaran</a> for having built an outstanding product, service and team, that attracted the attention of the world’s largest professional network.\n\n(Disclosure: I am a co-founder of CardMunch. K9 Ventures invested in CardMunch on “day zero” as K9’s first concept-stage investment, and up until the acquisition I served as the Chairman of the Board at CardMunch. So yes, I have a very biased view)\n\nWhen Bowei Gai, Sid Viswanathan, and I first met to discuss the concept that eventually became CardMunch, we talked about how we wanted to build a company that helped business users manage their contacts, and leverage those contacts and connections for doing business. Most of all we were trying to solve the problem of the pile of business cards that has become a constant fixture on my desk.\n\n<a href=\"/backup/BusinessCardPile-2011-01-27-11-07-09.jpg\"><img class=\"alignnone\" title=\"Business cards about to be CardMunched\" src=\"/backup/BusinessCardPile-2011-01-27-11-07-09.jpg\" alt=\"\" width=\"480\" height=\"360\" /></a>\n\nN.B. Image intentionally distorted.\n\nWhile we spent most of the time discussing how this is still an unsolved problem, which done right could be a huge business; we also talked about which companies this could be interesting to. The first name that came up was of course that of LinkedIn. It’s been an amazing experience to have worked so closely with the CardMunch team over such a short period of time to come full circle to that first conversation.\n\nCardMunch, Inc. started in December, 2009. We had an alpha version of the product in March, 2010, beta in June, 2010 and launched on the <a href=\"http://bit.ly/cardmunchfree\">AppStore</a> in August 2010. In December, 2010 the team released CardMunch 2.0, and today <a href=\"http://lnkd.in/cardmunch\">CardMunch 2.1</a> goes live concurrently with the announcement of this acquisition. Needless to say we’ve had a very very exciting 13 months.\n\nWe were fortunate to pull together an outstanding, all <a href=\"http://www.cmu.edu/\">Carnegie Mellon</a> team for CardMunch. Bowei was previously the co-founder of <a href=\"http://www.snapturelabs.com/\">Snapture Labs</a> – a company that built a camera application on the iPhone. Sid’s passion for the contact management space runs deep. He previously started <a href=\"http://www.rolotrak.com/\">Rolotrak</a>, with the aim to help maintain their relationships with their most valuable contacts. Sudeep is a shockingly sharp engineer, that we were *so* fortunate to have join the team. The team worked together amazingly well, pulled long hours (unlike startups who work late into the night, these guys decided amongst themselves they would start work every morning at 8:00 AM!), and delivered an amazing product/service.\n\nAlong the way CardMunch was fortunate to win the support of angel investors <a href=\"http://500hats.typepad.com/500blogs/about-dave-mcclure.html\">Dave McClure</a> of <a href=\"http://500startups.com/\">500 Startups</a>, <a href=\"http://www.kapor.com/bio/index.html\">Mitch Kapor</a>, and <a href=\"http://tydanco.com/\">Ty Danco</a> who joined <a href=\"http://www.k9ventures.com/people\">me</a> (<a href=\"http://www.k9ventures.com/\">K9 Ventures</a>) in participating in the Seed round for the company.\n\nI would like to recognize the <strong>entire</strong> team at LinkedIn that worked with us on this transaction, with a special mention for <a href=\"http://www.linkedin.com/in/emiliechoi\">Emilie Choi</a> and <a href=\"http://www.linkedin.com/pub/lora-blum/1/ab9/b70\">Lora Blum</a>. LinkedIn is fortunate to have some of the best people I’ve ever met working there, and my respect for the company has only increased through this interaction with them. I’d also like to thank the legal teams at <a href=\"http://www.wsgr.com/\">WSGR</a> and <a href=\"http://www.siliconlegal.com/\">Silicon Legal</a> for all the hard work that they put in bringing this transaction to a close.\n\nWe all see so many acquisition announcements, but we sometimes forget all the hard work that goes in behind the scenes to make these happen. As I mentioned in a <a href=\"http://twitter.com/\">recent tweet</a>: “it’s been a privilege to work with all these high caliber people in the Valley.”\n\n<img class=\"alignnone\" title=\"manu twitter\" src=\"/backup/PrivilegeTweet-2011-01-27-11-07-09.jpg\" alt=\"\" width=\"480\" height=\"223\" />",
    "type": "post",
    "path": "/2011/01/27/congrats-team-cardmunch/"
}