{
    "title": "Copywriting: Conversions or Thought Leadership?",
    "slug": "copywriting-conversions-or-thought-leadership",
    "date": "2012-04-23T23:40:32.000Z",
    "url": "http://500.co/?p=1116719886",
    "uri": "http://500.co/2012/04/23/copywriting-conversions-or-thought-leadership/",
    "postId": "1116719886",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/04/Steph-Hay-Headshot-300x199.jpg",
        "http://500.co/wp-content/uploads/2012/04/poisonivy.png"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<img class=\"alignleft  wp-image-1116719893\" title=\"Steph-Hay-Headshot-300x199\" src=\"/backup/Steph-Hay-Headshot-300x199-2012-04-23-12-18-40.jpg\" alt=\"\" width=\"131\" height=\"131\" /><a href=\"http://500.co/2012/04/23/copywriting-conversions-or-thought-leadership/poisonivy/\" rel=\"attachment wp-att-1116719892\"><img class=\"alignleft size-full wp-image-1116719892\" title=\"poisonivy\" src=\"/backup/poisonivy-2012-04-23-12-18-40.png\" alt=\"\" width=\"133\" height=\"133\" /></a>\n\n<i>SuperMentor <a href=\"http://www.stephaniehay.com\" target=\"_blank\">Steph Hay</a> (AKA Poison Ivy) is known at 500 Startups for her content expertise, UX skills, and giant hair. By day, as co-founder of <a href=\"http://www.fastcustomer.com\" target=\"_blank\">FastCustomer</a>, Steph works to rid the world from ever having to wait on hold again. By night, she co-organizes the DC Lean Startup Circle and learns Ruby so she can one day finish <a href=\"http://www.cakerock.com\" target=\"_blank\">CakeRock</a>.</i>\n\nA thread in my inbox: \"We have a lot of ideas on topics to write about that are relevant to our industry. But <em>how</em> should we go about producing content? Hire a copywriter?\"\n\nTwo primary follow-up questions I'd ask:\n\n1. Do you want to find the messages that convert users to buyers?\n2. Do you want to establish yourself as an authority on certain topics?\n\nTo which you'd likely answer \"Both.\" But <em>how </em>to achieve each relies on different goals, people, tools, and timelines.\n\n<strong><span style=\"text-decoration: underline;\">COPYWRITING FOR CONVERSIONS</span></strong>\n\nTo directly convert users to buyers using words alone, I mentioned trying an <a href=\"http://www.stephaniehay.com/blog/lean-content/\" target=\"_blank\">adwords-based test</a> as a starting point. That 3-step process yields only one thing: a short-list of words or phrases that make people click.\n\nWith that data, you now have a jumping-off point for producing more content like it on a landing page that we can tweak to get conversions up.\n\nBut at least you'll know that content-wise, you're using the terminology users need to see to arrive on the page in the first place.\n\n<strong>This route is all about the sprint: finding the individual words that directly drive users to you, then using analytics-based UX design to close the deal. Whee!</strong>\n\nPeople involved:\n-AdWords Expert (for placing/managing ads)\n-Copywriter (for coming up with the language to test in ads, status messages, email; then for optimizing the landing page once the most-clicked messages are nailed down)\n-Social Media or Email Marketing Expert (for testing messages in the best way possible across social media platforms or email)\n-Visual Designer (for designing the landing page once you're got the most-clicked messages nailed down)\n-UX Designer (for optimizing the landing page to test/iterate for maximum conversions)\n\nTools involved:\n\n-Facebook, Google, LinkedIn ads (for testing clicks; limited by daily ad budgets)\n-Twitter or Facebook updates (for testing clicks/shares; limited by network)\n-Email (for testing subject lines to opens, and opens to clicks; limited by list size)\n-WordPress (for landing pages if w/o a front-end developer)\n-MixPanel and/or Google Analytics (to track click-to-conversions)\n-Other tools you'd recommend? Tell me!\n\nSummary:\n\nIt's all about running fast -- content can be up and iterated upon in a matter of days, discovering the messaging that makes people click immediately thereafter, then building and refining landing pages until the magic content-then-UX formula is discovered.\n\nThen blow'd up.\n\n<span style=\"text-decoration: underline;\"><strong>COPYWRITING FOR THOUGHT LEADERSHIP</strong></span>\n\nStartups-as-thought-leaders is a great way to:\n-Get invited to conferences and speak on panels\n-Create a repository of SEO-friendly landing pages\n-Be the go-to expert for press\n-Close deals with customers who need to see papers to say \"yes\"\n-Create newsletter fodder (which make for nice investor updates, too)\n-Direct inquiries to posts that answer common questions\n-Keep super fans engaged over the long-haul\n\nBut if none of these are pressing goals, then your time and energy (and runway) might be better spent on the first approach of finding conversions fast.\n\n<strong>This route is all about the marathon: STRATEGICALLY finding the topics people care about, then using consistent production of content on these topics to establish credibility over time.</strong>\n\nPeople involved:\n\n-Content Strategist (who likely is also an excellent writer)\n-Social Media Strategist (to be consistently researching topics)\n-Product Manager or Business Analyst (to keep posts relevant to business efforts)\n\nTools involved:\n\n-A CMS or blog platform on your domain that isn't a complete bitch to use and also includes some way for users to share posts easily via social media and email\n-Email list (for distribution of said posts, either as published or on a specific timetable)\n-Whatever text editor is preferred (I'd suggest a Google doc if doing collaborative writing) but IA Writer is badass.\n\nSummary:\n\nBuilding thought leadership over time takes planning, regular research, a confidence in voice and direction, consistent publishing, and -- above all else -- <a href=\"http://www.stephaniehay.com/blog/content-signals-finding-clickable-goodness/\" target=\"_blank\">an audience of users who give a shit about what you're saying</a>.\n\nBut if you (like 37signals or Woot.com) can achieve this goal, it's gold.",
    "type": "post",
    "path": "/2012/04/23/copywriting-conversions-or-thought-leadership/"
}