{
    "title": "Creating #500STRONG (Part 2)",
    "slug": "creating-500strong-part-2",
    "date": "2012-08-27T22:05:11.000Z",
    "url": "http://500.co/?p=1116722549",
    "uri": "http://500.co/2012/08/27/creating-500strong-part-2/",
    "postId": "1116722549",
    "description": "",
    "images": [
        "http://media.tumblr.com/tumblr_m92e2hV3ff1qzd6wg.png",
        "http://media.tumblr.com/tumblr_m91kzoMWK71qzd6wg.png"
    ],
    "creator": "",
    "categories": [
        "mentors"
    ],
    "content": "<img src=\"/backup/tumblr_m92e2hV3ff1qzd6wg-2012-08-27-12-17-05.png\" alt=\"\" />  **\n\n<em>(This post was originally published <a href=\"http://christinetsai.tumblr.com/post/29975092303/creating-500strong-part-2\" target=\"_blank\">here</a>)</em>\n\nIn my <a href=\"http://500.co/2012/08/20/creating-500strong-part-1/\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">last post</a>, I covered how we built a strong community at 500 Startups among our companies. In this post, I will focus on how we built the 500 Mentor network. (Fun factoid: <a href=\"http://en.wikipedia.org/wiki/Mentor\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">“Mentor”</a> is a character in Greek mythology)\n\nThe <a href=\"http://500.co/mentors\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">500 Mentors</a> are a tribe of 180 people (and growing) who commit time and energy to help our startups. They...\n\n- are based all over the world\n- work at startups\n- work at big companies\n- have founded startups\n- have domain/operational expertise in one or more functional areas and verticals\n- do this all on a volunteer basis\n- may or may not invest in startups\n- are opinionated (I mean this in a good way)\n- LOVE helping entrepreneurs\n- LOVE 500 Startups\n- are LOVED by 500 Startups and our founders\n\nGiven mentors at a fund or accelerator program aren’t typically compensated for their time, there’s got to be something else that motivates them. From the beginning, we knew the 500 Mentors would be a very unique group. We wanted them to be as excited about helping our startups as we were, but we also were counting on them to help shape the direction of 500. To be able to come on board as a mentor to a brand new seed fund/accelerator program and actually help steer its direction was definitely a big motivator for the early mentors.\n\nThe following slide provides insight into how we approach mentoring. (screen shot from an internal team presentation I created for a recent partner offsite)\n<img src=\"/backup/tumblr_m91kzoMWK71qzd6wg-2012-08-27-12-17-05.png\" alt=\"\" />\n\nHow it all got started, and what we’ve done so far:\n\n1. We compiled a<strong> HUGE list of potential mentors from our networks</strong> - PayPal, Facebook fbFund, Google, YouTube, Mint, SimplyHired, and the list goes on. We categorized everyone w/ their areas of expertise, how we knew them, their location, and then rated each person by priority. (e.g. likely to be involved, maybe, not likely)  We extended invitations to a small number of individuals to join us on this crazy journey and be one of the first 500 Startups mentors. In those days, I actually met with every single mentor in person or by phone. Given we were so new, it was a great way to get their feedback on what a successful mentor program should entail. I will never forget meeting <a href=\"http://twitter.com/commagere\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">Blake Commagere</a> at SBUX and him warning me that I’d most likely be late for my next appointment due to his incessant chattering.\n\n2. We created a<strong> charter </strong>in the form of a Google Doc that captured the goals and objectives for the 500 Mentor Program, the 500 Culture, and 500’s expectations and requirements of any mentor. Every new mentor received this doc when invited to join as a mentor.\n\n3. We created a<strong> community.</strong> We felt this was key in getting mentors motivated. While helping startups was already a big motivator, for mentors to feel like they were part of a ‘tribe’ and develop relationships with fellow mentors was just as important. Similar to the 500 portfolio, we also created a Google Groups mailing list and encouraged interaction on that platform. We also kicked things off with the first ever mentor meetup (even before mentors actually started meeting w/ any companies). At the meetup, we gave an overview of 500 Startups and then had mentors split into breakout groups where everyone discussed topics like what good mentoring is/isn’t, how 500 could differentiate ourselves with our mentor program, etc.\n\n4. We <strong>actively communicate with mentors </strong>and kept them abreast of the latest with 500 Startups, even if it wasn’t directly related to mentoring. In being open and transparent with the overall fund strategy, that in turn made mentors feel like we were entrusting them with important information and thus really valued the relationship.\n\n5. We offer <strong>numerous ways to mentor</strong>. Given mentors all have different schedules and in many cases actual day jobs, we wanted the mentoring options to be flexible. So we offered numerous options - having mentors give talks to the accelerator batch, hold office hours, participate in 1:1 formal mentor/mentee relationships, assist with pitch prep, etc. In the last few months, we revamped the mentor program and instituted a monthly time commitment. Going back to one of the beginning of the post and one of the bullets being “opinionated” (about our mentors), we certainly did hear from them about this time commitment - both good and bad. But as the saying goes, there is a thin line between love and hate, and neither is as bad as indifference.\n\n6. We hold <strong>quarterly meetups at the 500 office for all our mentors</strong>. It’s a chance for them to mingle, for us to share updates on 500 Startups, and hold “townhall” discussions for them to tell us what’s working, what’s not, etc. The big challenge of these meetups is that they’re only accessible to the mentors in the local area. Mentors outside of Silicon Valley aren’t able to participate as easily (unless they happen to be in town). To that end, we’ve encouraged mentors in other areas to self-organize 500 meetups in their local geo. And of course if someone from the 500 team happens to be in town at that time, we’ll most certainly join in.\n\n7. We try to <strong>differentiate the mentor experience</strong> such that being a mentor for 500 is something unique. In addition to everything I already mentioned, we also come up with creative ways to engage mentors. With the last accelerator batch, we launched a mentor co-investment program where mentors could invest an accelerator company via $5,000 convertible notes. We pushed it out a bit hastily and have more work to do to make the process smoother, but we plan to do more stuff like that.\n\n8. We’ve even <strong><a href=\"http://gigaom.com/2010/10/07/mcclure-adds-500-mentors-to-500-startups/\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">announced the mentors in press</a></strong>.\n\nIt really is amazing that we’ve recruited such an amazing group of people. I’m honored that they take time out of their busy schedules to mentor our companies and, in many ways, mentor us.\n\n<i>**From L-R, T-D: Andy Johns, Jenny Gove, Dror Shimshowitz, Blake Commagere, Hong Quan, Rebecca Meissner, Michal Kopec, James Levine, Natala Menezes, Jennifer Lum, Mike Greenfield, Christine Herron. They are 12 of our amazing mentors.</i>",
    "type": "post",
    "path": "/2012/08/27/creating-500strong-part-2/"
}