{
    "title": "Creating #500STRONG (Part 1)",
    "slug": "creating-500strong-part-1",
    "date": "2012-08-20T22:58:34.000Z",
    "url": "http://500.co/?p=1116722365",
    "uri": "http://500.co/2012/08/20/creating-500strong-part-1/",
    "postId": "1116722365",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/08/Screen-shot-2012-08-20-at-10.55.57-AM-300x88.png"
    ],
    "creator": "",
    "categories": [
        "family"
    ],
    "content": "<a href=\"http://500.co/2012/08/20/creating-500strong-part-1/screen-shot-2012-08-20-at-10-55-57-am/\" rel=\"attachment wp-att-1116722381\"><img class=\"alignnone size-medium wp-image-1116722381\" title=\"Screen shot 2012-08-20 at 10.55.57 AM\" src=\"/backup/Screen-shot-2012-08-20-at-10-55-57-AM-300x88-2012-08-20-12-17-58.png\" alt=\"\" width=\"300\" height=\"88\" /></a>\n\n<i>(This post was originally published <a href=\"http://christinetsai.tumblr.com/post/29652007366/creating-500strong-part-1\" target=\"_blank\">here</a>)</i>\n\nThe number one reason that entrepreneurs are attracted to <a href=\"http://500.co/\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">500 Startups</a> is our <strong>community</strong>. I call it the “500 Family” because it really is a family. Everyone helps each other, is quick to jump in and provide help, gives tough love, and gets into squabbles (or downright fighting). At the end of the day, there is always a sense of unity, of something bigger that connects us all. We call it #500STRONG.\n\nOver 600 founders and 180 mentors make up the 500 Family. Recently, people have asked me how we went about creating and nurturing this tight-knit community. So I’m sharing part I of it in this post. Before I get into any specific tactics, I will take a step back and explain why the notion of #500STRONG matters to us.\n\n<strong>Community must be in your DNA.</strong>\n\nIn the early days of 500, we thought long and hard about the 500 brand and what our identity and culture should be. <strong>Fun at all costs. Move quickly, make mistakes, fall down, and get back up again. Willingness to teach others and learn from each other. “Open” rules, stealth drools. Diversity wins. </strong>But we didn’t just want this to be the staff’s culture. We wanted it to embody the entire portfolio and mentor network. We knew we’d be investing in a high volume of companies but we didn’t want the value of our resources to be inversely proportional to the size of our portfolio. Rather, we wanted them to scale together. Our solution? Help our founders help each other and build a community for them. We also worked tirelessly to personify all those tenets of our culture in how we engaged with our companies, mentors, etc.\n\n<strong>Create a brand that people are proud to be part of.</strong>\n\nMeet any 500 Startups founder or mentor and I guarantee that they will tell you how proud they are to be part of 500. In building 500 Startups from the ground up, we relied heavily on our founders and mentors to help us shape the direction of the fund and the accelerator - possibly more than other funds do. In the early days, much of 500’s brand was still closely intertwined w/ <a href=\"http://twitter.com/davemcclure\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">Dave</a>’s personal brand. People knew of him, but not of 500. In the last 2 years, 500 alone has become a force to be reckoned with. Some call us edgy and rebellious, fighting tooth and nail for our startups. Others call us crazy, chaotic, and spread too thin. However we are perceived, there’s no denying that people are drawn to the 500 brand.\n\n<strong>How you support your startups speaks volumes. </strong>\n\nEveryone says they’re founder friendly and that they help their startups. I’m sure there are many ways that we fall short in our founders’ eyes, but I still think we do a pretty awesome job (and sacrifice a lot of sleep while we’re at it). Beyond offering our own time and attention, we work really hard to help our founders. When startups announce funding, we tweet out that they’ve joined the 500 Family. In many cases, we help behind the scenes, connecting them w/ reporters and advising them on how they craft their launch announcements. We constantly play match maker, introducing companies and mentors to each other. We’re actively building out resources in areas like Design and Distribution, including <a href=\"http://500.co/2012/07/23/mike-greenfield-growth-hacker-in-residence/\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">our recent Growth Hacker-in-Residence hire</a>. Our accelerator batches devise <a href=\"http://www.youtube.com/watch?v=NLTriRxzShQ&amp;feature=plcp\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">wacky videos</a> to announce themselves (partly due to our encouragement), which we amplify with press outreach and social media. All of this helps to truly align the 500 brand with founders. Similar to what I said earlier, an ounce of action is worth a ton of theory.\n\nNow - the actionable stuff. Once you have the foundation set, what are some key tactics in building an engaged community?\n\n<strong>1. Create and nurture an ACTIVE communication channel</strong>. A Google Groups mailing list might sound trivial at first, but it can make a huge difference. That’s what we started with. In the beginning, founders would still come to us directly with questions and I would direct them to email the list. I even “seeded” the list with questions to get conversations going. The first couple months were pretty quiet. Eventually, founders started to make more use of it, and the rest is history. The archives of our mailing list contain nuggets of wisdom that have benefitted everyone in the 500 portfolio. Now we have evolved into an awesome internal tool called dashboard that <a href=\"http://twitter.com/paulsingh\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">Paul</a> is building - a hybrid of mailing lists, Quora, events calendar, directory, and messaging system. All for the 500 Family.\n\n<strong>2. Create opportunities for the community to interact</strong>. We have the “luxury” of running an accelerator program and a physical office space that’s conducive to gatherings. So there’s ample opportunity for the 500 Family to participate and connect with each other — speaking or attending weekly talks, self-organizing meetups, attending one of our founder or mentor meetups, office hours, etc. <a href=\"http://twitter.com/christenobrien\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">Christen</a> heads up all our events and conferences, which are also an amazing platform for our companies to get visibility as well as connect with folks inside and outside of the 500 community. Even if you don’t run a formal program, explore the idea of hosting a few workshops, talk series, or meetups for your companies. Many funds hold founder/CEO summits or events specifically for the [marketers/designers/engineers] of these companies, which is also a great way to increase connections among the portfolio.\n\n<strong>3. We are all human. Don’t be afraid to be vulnerable to your community.</strong>  I can’t tell you the number of times we’ve screwed up or dropped the ball on our companies because it’s far too many. For example, there was a big stink among the 500 Family about the fact that some of them never hear back from the 500 team when they refer/intro a prospective investment to us. In the end, we were pretty frank in acknowledging that we weren’t doing a good job and were open to ideas on how to fix it. And we really meant it.\n\n<strong>Why does community matter for a VC fund/accelerator?</strong>\n\nTruth be told, it may not matter. It really depends on what type of investor you want to be. If you’re only interested in writing checks, then community probably isn’t important to you. However, venture capital has gone through some dramatic changes in the last 10 years. To quote <a href=\"http://500hats.com/VC-evolution-geeks-got-next\" target=\"_blank\" data-bitly-type=\"bitly_hover_card\">Dave’s recent post</a>,<em>“funds that offer serious expertise and mentorship in these areas have a substantial advantage – both in being able to attract higher quality founders and companies who want access to those resources, as well as the potential to improve financial outcomes by amplifying traction.”</em>\n\nAnother key reason to foster community - practicing the concept of paying it forward, something that pervades startup culture (at least in Silicon Valley). Building a company is a challenge like no other. It’s impossible to do it on your own. Knowing that you have access to a community that will be there for you, even if it’s just to bounce off ideas with, can help make the journey easier. That is what the 500 Family is.\n\n<em>In Part II, I will talk about building a strong mentor network as part of the community.</em>",
    "type": "post",
    "path": "/2012/08/20/creating-500strong-part-1/"
}