{
    "title": "Distribution for Noobs By A Noob",
    "slug": "distribution-for-noobs-by-a-noob",
    "date": "2013-07-30T18:55:15.000Z",
    "url": "http://500.co/?p=1116728951",
    "uri": "http://500.co/2013/07/30/distribution-for-noobs-by-a-noob/",
    "postId": "1116728951",
    "description": "",
    "images": [
        "http://2.bp.blogspot.com/-3_pqjBQID5A/TZKrcA1ttFI/AAAAAAAAAGI/vHhiNxRRpUE/s1600/CastAway.gif",
        "http://media.tumblr.com/951561a928a2c152992de4a42b6198e4/tumblr_inline_mpbyfabSy01qz4rgp.gif",
        "http://media.tumblr.com/01f1d11f0569eb93d257ffa3905e7d5d/tumblr_inline_mp9gd3On1A1qc9lhz.gif",
        "http://24.media.tumblr.com/326765959ac468cd2e2e4adb383eec8b/tumblr_ml8dbxcFEM1qmr7rho1_500.gif",
        "http://media.tumblr.com/38ab3d7db5f92aa6532a3b4be23c5456/tumblr_inline_mppb7q62YF1qz4rgp.gif",
        "http://24.media.tumblr.com/bc120b7efead7c5f9d8fad771ca8beeb/tumblr_mlz5towo8g1rcy99do1_500.gif"
    ],
    "creator": "",
    "categories": [
        "beginners",
        "distribution",
        "distribution",
        "distribution-tuesdays",
        "growth",
        "intern",
        "marketing",
        "noob",
        "user-acquisition"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup and today's featured post is by our summer distribution intern, <a href=\"https://twitter.com/samanthassiow\" target=\"_blank\">Samantha</a>. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>. </em>\n\n<i>Want to join our next batch of startups? <a href=\"http://bit.ly/Batch7Apply\" target=\"_blank\">Apply NOW</a> for our Fall Accelerator. </i>\n\n<strong>Day 56 of my summer internship at 500:</strong>\n\nThe past 56 days have been a haze of free flow espresso and fruit snacks. Everyone seems to have forgotten my name. They call me Intern now. Is that my name? I don't even know anymore. SEND HELP.\n\n<img class=\"alignnone\" alt=\"\" src=\"/backup/CastAway-2013-07-30-13-13-55.gif\" width=\"400\" height=\"218\" />\n\nBut seriously, it's been nearly two months since I started working at 500 and I can't believe it! Batch 6 has reached the final level of the accelerator and are taking on the Demo Day boss battles. I'm two out of three months in and I've probably learned more than I have in the past four semesters at school; I've met the AWESOME 500 team (even though they've forgotten my name), mentors from all over the 500 family, the super swag <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">Distribution team</a> (REPRESENT!), the \"f-ckin' awesome\" Batch 6 and many, many others. It's been a heck of a ride and it'll be hard to head back to school after such an amazing summer.\n\nBut that's enough of that story.\n<h2><strong>What the heck is distribution? A story by me.</strong></h2>\nBefore I came to 500, I had absolutely NO knowledge about distribution. I was a level 1 Distribution noob, dropped headfirst into a world filled with things I had no idea about. Landing pages, Facebook Ads, Google Adwords and Sponsored tweets were unexplored lands. There were these weird monsters with names like SEO, SEM, LTV, CPA, CPM, CR and the weapon store included things like funnels (I thought these were only used for SCIENCE?!), Webmasters, graphs, charts, eye tracking heat maps and so much more for higher level Distribution warriors and wizards.\n\n<img alt=\"\" src=\"/backup/tumblr_inline_mpbyfabSy01qz4rgp-2013-07-30-13-13-55.gif\" width=\"350\" height=\"197\" />\n\nSo what was a noob to do?\n<h3>ANSWER: Spend my days killing chickens*.</h3>\nThis was essentially reading <strong>EVERYTHING</strong> about distribution that I could. What's amazing is that growth hackers are CRAZY about sharing their experiences and knowledge. To fit into the RPG analogy, they'd be the NPCs (non-player characters) who stand around and tell you how to punch chickens or give you boxing gloves to punch chickens. Notable growth hackers like <a href=\"http://www.okdork.com\" target=\"_blank\">Noah Kagan</a>, <a href=\"http://andrewchen.co/\" target=\"_blank\">Andrew Chen</a>, <a href=\"http://www.quicksprout.com/\" target=\"_blank\">Neil Patel</a>, metrics companies like <a href=\"http://moz.com/blog\" target=\"_blank\">Moz</a>, <a href=\"http://blog.mixpanel.com/\" target=\"_blank\">Mixpanel</a>, <a href=\"https://blog.kissmetrics.com/\" target=\"_blank\">KISSmetrics </a>and <a href=\"https://keen.io/blog\" target=\"_blank\">Keen.io</a> are goldmines for information about distribution.\n\nBut if you know anything about RPGs, you know that these NPCs won't baby you till you become a level 100 Distribution Jedi. They'll point you in the right direction, recommend some tools then send you on your way. I quickly learned this after reading blog post after blog post and listening to podcasts, videos, talks, anything I could get my hands on… and I also realized that I'd plateaued.\n\n<strong>I was stuck at level 10 and I was going nowhere.</strong>\n\n<img alt=\"\" src=\"/backup/tumblr_inline_mp9gd3On1A1qc9lhz-2013-07-30-13-13-55.gif\" width=\"384\" height=\"216\" />\n\nWhy? After speaking to all these growth hackers in person, trying to steal some of their experience and knowledge in exchange for coffee, I found one thing that all of them had in common. They didn't study \"growth hacking\" in school. They didn't get to where they were by reading TechCrunch or watching Growthhacker.tv. They were all thrown into the water, told to \"GROW\" something and then left to their own devices.\n\nAnd that's exactly what they did. They cold called dozens of people to gain users or contributors to the product. They A/B tested landing pages countless times to optimize their funnels. They tried out a BAJILLION keywords before finding the right few.\n\nAnd that was how they became awesome. There's no secret to growth hacking. You can read as much as you want, but you never actually start learning until you try it out for yourself. There is no set landing page that will get a 100% conversion rate. A one page conversion funnel doesn't always mean a 90% click through rate. Changing your button from red to green doesn't always give you a 20% increased conversion rate.\n<h3><strong>Case Study:</strong></h3>\n<p style=\"padding-left: 60px;\"><a href=\"http://www.twitter.com/randfish\" target=\"_blank\">Rand Fishkin</a> at Moz said that their content marketing strategy was to educate people on their blog about SEO. This showed their expertise and helped them gain many high value users.</p>\n<p style=\"padding-left: 60px;\"><a href=\"https://twitter.com/michellewetzler\" target=\"_blank\">Michelle Wetzler</a> at keen.io said that their most effective content marketing strategy was to blog about their own personal content and to tell a story. A post about her journey from consulting to the world of startup drives more traffic than an educational post on their blog.</p>\n<p style=\"padding-left: 60px;\">?????????</p>\n<p style=\"padding-left: 60px;\">Conclusion: There are no set rules to growth hacking. Find out what works for YOU.</p>\n<strong>You're on your own, man.</strong>\n<img alt=\"\" src=\"/backup/tumblr_ml8dbxcFEM1qmr7rho1_500-2013-07-30-13-13-55.gif\" width=\"400\" height=\"232\" />\n<h2>How can YOU Get Started Growth Hacking?</h2>\nI could write an article about Distribution for Noobs like I was supposed to. But I'm not going to. (YOLO) I'm going to tell you to stop reading this article and to go out there and start a blog. Open a Shopify account. Dust off your twitter feed. And DO SOMETHING. Grow your user base to 200. Get 300 followers on Tumblr. Sell a bunch of shit. Get to work, dammit!\n\nGrowth hacking as a process is simple. It's finding a problem. It's testing to optimize. It's finding what works. That's it! Of course, it's not going to be easy to achieve that elusive magical growth unicorn, but it's your job as the growth hacker to look for it's trail and hunt it down. It's as simple as finding out which tweets are receiving the most engagement. What time are you releasing these tweets? Is there specific content within these tweets that seems to be interesting to a large percentage of your user base? What blog titles get the most views? How are you wording your blog titles? Is there a specific font in your email marketing campaign that has the highest click through rate? <strong>TEST.</strong>\n<h2>And Now, A Word From The Masters.</h2>\n<a href=\"https://twitter.com/gaganbiyani\">Gagan Biyani</a>, co-founder of Udemy and the Growth Hackers Conference and mentor at 500, told me that growth hacking is marketing with a LOT of analytics. You'll need to know the technical basics (things like what drives SEO, how to set up Google Analytics, Adwords, etc. all of which you can find on the internet), but the most important thing is that you need to analyze your target market. You need to know what they're thinking, where they are and how to access them most effectively.\n\nIf you're starting a Shopify account to sell your grandma's knitted sweaters, Facebook Ads targeted at boys aged 10-14 aren't going to be effective. \"<strong><em>But there are only 15 people who liked the page 'knitted sweaters'!</em></strong>\" You say. Be creative! Try people who liked \"Hipster fashion\" or \"KnitZy Handmade Fashion Accessories\". Provided you're selling something that people actually want (RULE #1 of the Startup Handbook), your target market is out there and you're going to need to figure out what channels are most effective.\n\n<a href=\"https://twitter.com/andrewchen\" target=\"_blank\">Andrew Chen</a>, the super blogger who made the term \"growth hacker\" fashionable and mentor at 500, told me, the poor intern who just wanted some small contribution to the <a href=\"http://twitter.com/500Distribution\" target=\"_blank\">Distrosnack bar</a>, that he hates tips and tricks about growth hacking. He asked me if I had a blog. I said yes. He asked me how many followers I had. Where was I going to get followers? Have I posted on Dashboard yet? How many followers did I have on twitter? Did I have an email campaign?\n\n<img alt=\"\" src=\"/backup/tumblr_inline_mppb7q62YF1qz4rgp-2013-07-30-13-13-55.gif\" width=\"180\" height=\"136\" />\n\nMY FIRST MEETING WITH A GROWTH HACKER AND I HAD FAILED MISERABLY.\n\nJust kidding. Kind of.\n\nWhat he meant was that ANYONE can growth hack. <strong>Start a blog</strong>. Share the link with all your friends! Write about something interesting people would want to read about (but it should also be something you enjoy writing about). Install Google Analytics (It's free!). Spread the word via twitter. Interact with people who have many twitter followers and get them to retweet you. Get 1000 page views. Celebrate with cake.\n<h2>Now you ain't a noob no' mo'!</h2>\nSo, to all those distribution noobs out there looking to become full grown growth hackers: What I learnt from all these amazing people is that growth hacking is all about learning from experience. Read blog posts and tips from the internet as a foundation but don't expect to get a 50% conversion rate from following everything you've read. You need to try it out for yourself and fail and FAIL HARD before you find out the secret to growth for your product. Try out different channels to grow, whether it's views on your Wordpress blog, Twitter followers, Facebook page likes, or sales on a Shopify account selling your grandma's knitted sweaters… Whatever works for you! Just remember to test smart, analyze A SH!T TON, and then test more!\n\n\"What doesn't kill you makes you stronger.\" - A wise man once said and that wise man isn't Kelly Clarkson, it's Friedrich Nietzsche. PSYCH.\n\nSO GO FORTH, GROWTH HACKERS-IN-TRAINING. AND GOOD LUCK.\n\nIntern, out!\n\n<img class=\"alignnone\" alt=\"\" src=\"/backup/tumblr_mlz5towo8g1rcy99do1_500-2013-07-30-13-13-55.gif\" width=\"400\" height=\"226\" />\n<h6>* Chickens are normally the lowest level creatures in RPGs. So you go around and punch them until you get enough EXP to become AWESOME.</h6>",
    "type": "post",
    "path": "/2013/07/30/distribution-for-noobs-by-a-noob/",
    "backgroundImage": "/backup/Yoda-960x540-2013-07-30-13-13-55.jpg"
}