{
    "title": "Don’t Drink Your Own Kool-Aid",
    "slug": "dont-drink-your-own-kool-aid",
    "date": "2010-12-01T06:17:16.000Z",
    "url": "http://blog.500startups.com/?p=1116714549",
    "uri": "http://500.co/2010/12/01/dont-drink-your-own-kool-aid/",
    "postId": "1116714549",
    "description": "",
    "images": [
        "http://www.blog.altosventures.com/.a/6a00d8341cb88953ef0134896acccb970c-800wi"
    ],
    "creator": "",
    "categories": [
        "altos-ventures",
        "anthony-lee",
        "culture",
        "friends",
        "guest-posts",
        "metrics",
        "objectivity",
        "startups",
        "tips"
    ],
    "content": "<em>This is a <a href=\"http://www.blog.altosventures.com/vc/2010/11/dont-drink-your-own-kool-aid.html\" target=\"_blank\">cross post</a> from the Altos Ventures Blog, authored by <a href=\"http://twitter.com/aplee\" target=\"_blank\">Anthony Lee</a>. Thanks Anthony for letting us reblog!</em>\n\n<a href=\"http://www.blog.altosventures.com/.a/6a00d8341cb88953ef0134896acccb970c-pi\"><img title=\"Koolaid\" src=\"http://www.blog.altosventures.com/.a/6a00d8341cb88953ef0134896acccb970c-800wi\" border=\"0\" alt=\"Koolaid\" width=\"184\" height=\"150\" /></a>\n\nIn my twenty years of working in and with startups, I’ve continually tried to figure out what makes some work and others not.  There are myriad factors of brilliance, determination, luck and timing that go into the success equation.  One of the most important and overlooked characteristics of successful entrepreneurs is <strong>objectivity</strong>: the ability to see and deal with reality in making decisions.\n\nBy their nature, startups are driven by passion, optimism, persistence, hope and dreams.  All these traits are essential to fueling the process of inventing a product and innovating a business model.  The beautiful thing about startups is that they are emotional and intellectual creations brought to life through shared vision and hard work.\n\nCompany founders and CEOs get employees, customers and investors to take innumerable leaps of faith on the way to fulfilling their entrepreneurial visions. Mixing the Kool-Aid is an essential part of building a company (see also: <a href=\"http://www.investopedia.com/terms/e/eatyourowndogfood.asp\" target=\"_blank\">eating your own dogfood</a>).<strong><em> But drinking your own Kool-Aid is the enemy of sound decisions. </em></strong>\n\nHere are three signs that you might be doing it:\n\n1. <strong>Illusion:</strong> Some would say that most of the factors that drive success are outside of an entrepreneur’s control.  But most entrepreneurs suffer from the <a href=\"http://en.wikipedia.org/wiki/Illusion_of_control\" target=\"_blank\"><strong>illusion of control</strong></a> - “the tendency for people to overestimate their ability to control events.”  This is as true for CEOs of small companies launching new products as it is for large companies planning corporate takeovers.  It is critically important to understand the difference between things you control and the things you don’t – and be clear and objective about that.\n\n2. <strong>Hope</strong>:  Closely related to the illusion of control is <a href=\"http://en.wikipedia.org/wiki/Optimism_bias\" target=\"_blank\">optimism bias</a>, or the \"tendency for people to be over-optimistic about the outcome of planned actions.\"  While optimism is a fundamental part of entrepreneurism, its evil twin is hope.  The more desperate a company’s situation, the more you hear the word “hope” driving business decisions.  In a company meeting last week, my Spidey senses perked up when the CEO described the company’s next product launch in all-too-hopeful language.  He was “hoping” for vast improvements in four separate metrics (traffic, registration, engagement and conversion) to click in just the right way.  Did I want it to happen?  Absolutely.  Did I think it would?  Absolutely not.  As the old saying goes, “hope is not a plan.”\n\n3. <strong>Spin</strong>: Good spin is essential to marketing your product to the world, but behind closed doors with your team or your board, you have to be brutally honest about the facts.  Startups are all about learning, and if there’s even one degree of spin on the data, it’s hard to learn the right lesson.  If your board meeting agenda looks like an actuarial recitation of facts and metrics, you’re on the right track.  If your board meeting agenda looks like a pitch deck, you’re not being objective.  Beware of underestimating competitors.  Beware of <a href=\"http://orangepunch.ocregister.com/files/2010/08/bush-mission-accomplished.jpg\" target=\"_blank\">prematurely declaring victory</a>.  Beware the phrase “conservative projections.”\n\nHow can you avoid drinking too much of your own Kool Aid?  Here are a few ideas:\n\n1. <strong>Metrics</strong>:  My investor friend Dave McClure is <a href=\"http://www.slideshare.net/dmc500hats/startup-metrics-for-pirates-long-version\" target=\"_blank\">piratically</a> fanatic about metrics.  Follow his advice: get religious about metrics.  Bad decisions thrive on incomplete data, speculation and opinion.  My favourite companies post their metrics up on big screens for everyone to see. The more you can instrument your business, the fewer places there are for bad decisions to hide.\n\n2. <strong>Culture</strong>:  As a leader in a company, it is critical to create a culture that allows for open, fact-based dialogue and dissent.  Highlight team members who get it right while being honest and self-deprecating about your own bad decisions.  Celebrate unconventional ideas.  Designate someone on your team to take the devil’s advocate role.  Beware groupthink.\n\n3. <strong>Friends</strong>: Friends don't let friends drive drunk.  And your good friends, your real supporters in the entrepreneurial enterprise, should not let you fool yourself either.  Don't surround yourself with people who just reinforce your worldview.  Surround yourself with advisors and investors who are honest enough to call bullshit.  But don't confuse brutal honesty with a lack of enthusiasm for you or your business.  It is absolutely necessary.\n\nEvery entrepreneur needs to mix some pretty strong Kool-Aid to persuade employees, customers and investors to come along for the fantastic ride of building a new company.  But the really great entrepreneurs know not to drink their own.\n\n<em>And just for fun... the following video was added by <a href=\"http://twitter.com/#!/christine_tsai\" target=\"_blank\">Christine</a> :)</em>\n\n<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"480\" height=\"385\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"http://www.youtube.com/v/N3NbpJyGz6c?fs=1&amp;hl=en_US\" /><param name=\"allowfullscreen\" value=\"true\" /><embed type=\"application/x-shockwave-flash\" width=\"480\" height=\"385\" src=\"http://www.youtube.com/v/N3NbpJyGz6c?fs=1&amp;hl=en_US\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "type": "post",
    "path": "/2010/12/01/dont-drink-your-own-kool-aid/"
}