{
    "title": "Don’t Be Awkward: Making the Most of a Networking Event",
    "slug": "dont-be-awkward-making-the-most-of-a-networking-event",
    "date": "2013-05-13T22:58:41.000Z",
    "url": "http://500.co/?p=1116727281",
    "uri": "http://500.co/2013/05/13/dont-be-awkward-making-the-most-of-a-networking-event/",
    "postId": "1116727281",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/05/creepyassgirl.gif"
    ],
    "creator": "",
    "categories": [
        "advice",
        "entrepreneurs",
        "events",
        "events",
        "musings",
        "networking"
    ],
    "content": "<p dir=\"ltr\">A few weeks ago, I did something that truly scared me.</p>\n<p dir=\"ltr\">I went to a tech networking event.</p>\n<p dir=\"ltr\">While there are many people out there – especially in Silicon Valley – who live for building their network, it's not something I spend a lot of time doing or particularly enjoy. I know a lot of people feel the same way I do, especially since it can get pretty awkward if you don't do it right.</p>\n<p dir=\"ltr\">But even if you despise the word \"networking,\" it's an extremely important skill to have – especially if you're working at a startup. If you’re a founder, your startup will die – or have a very, very tough time – if you don’t develop this skill early on. It’s critical to build relationships with potential investors, partners, customers, employees, and so on. Everyone in the startup community is connected to everyone else, so you'd be surprised what opportunities will pop up simply by knowing someone. It’s an oft-repeated platitude, but many times it all comes down to <em>who</em> you know.</p>\n<p dir=\"ltr\">Now, I'm by no means an expert at this, but thought I'd share some common-sense tips based on my recent experience.</p>\n<p dir=\"ltr\"><strong>Be Humble</strong></p>\n<p dir=\"ltr\">This one's obvious, but you'd be surprised how many people forget that simply being a nice person will open up many doors. Don't go into an event acting like you're the shit because you work for a well-known company, or because your small startup just raised  ton of money from a well known VC. Be confident about what you do, but don’t be annoying about it.</p>\n<p dir=\"ltr\">Heck, maybe you're awesome or infamous enough that people already know who you are – congrats. You should still introduce yourself like a normal person. It's fairly obvious, but bears repeating: people will be way more likely to help you out later – be it with an intro, job offer, referral or something else – if they remember that you were a nice person. Most people don't want to help someone who turns any get-together into a 2-hour #humblebrag.</p>\n<p dir=\"ltr\"><strong>Don’t Make it all about You</strong></p>\n<p dir=\"ltr\">When you see an investor you want to meet, don't corner them and give them a 15-minute pitch about your company. If you talk  for 5 minutes straight without coming up for breath, that’s NOT effective networking.</p>\n<p dir=\"ltr\">#Protip: if the person you’re talking to whips out their phone and starts refreshing their Twitter feed or awkwardly checking for new texts, you’ve lost them. At that point, it’s best to just give them your business card and move on to the next person you want to meet. Remember that other people are there to network too, so don’t suck up all their time.</p>\n<p dir=\"ltr\"><strong>Don't Be Creepy</strong></p>\n<p dir=\"ltr\">It's great to go up to someone and say you know each other through a mutual friend. It's also great to tell them how great their app/startup/Twitter feed is. What isn't great is reciting your 10 favorite tweets from their feed, or recalling creepily specific details about their Facebook photos.</p>\n<p dir=\"ltr\">Do your research, but don’t make it sound like you’ve been studying their online presence for hours on end. At the event I attended, I made this mistake after meeting someone whose work I’ve admired for a long time; seeing his facial expression change from \"that's neat\" to \"you're f'in creepy\" was pretty much the worst thing ever. If he remembers me, it’ll probably be because I was the “weird guy who stalks people online.”</p>\n<p dir=\"ltr\"><a href=\"/backup/creepyassgirl-2013-05-13-13-17-58.gif\"><img class=\"size-full wp-image-1116727283 alignnone\" alt=\"creepyassgirl\" src=\"/backup/creepyassgirl-2013-05-13-13-17-58.gif\" width=\"500\" height=\"281\" /></a></p>\n<p dir=\"ltr\"><strong>Be Ready</strong></p>\n<p dir=\"ltr\">Have enough business cards. Duh. Besides the obvious, scan the list of attendees (if it's public) and make a note of who you want to meet and why. It's much better going into a networking event with a plan of attack than walking around idly while trying to make eye contact.</p>\n<p dir=\"ltr\">Also, be ready to talk about yourself and what your startup does –  in detail. Don't just say that you’re  doing \"awesome stuff\" at your company when someone asks;<a href=\"http://blogs.hbr.org/cs/2013/05/every_entrepreneurs_least_favo.html\"> have interesting details to talk about and share your accomplishments</a> (ESPECIALLY metrics) – without bragging too much, of course.</p>\n<p dir=\"ltr\">Don't be afraid of telling people about some of the interesting challenges you’re dealing with. Running or working at a startup isn’t easy, so don’t pretend you have everything figured out. Sharing the stuff you’re grappling with will make for good conversation, and you may find someone who's willing offer advice or even meet later to help.</p>\n<p dir=\"ltr\"><strong>Don’t Go Alone</strong></p>\n<p dir=\"ltr\">Going to networking events alone – especially if you're not an extrovert –  is pretty much like trying to do expert mode. Don't do it unless you're confident you won't end up wandering around being awkward. It's way easier to approach someone if a friend is already chatting them up, and if you take someone else with you, you’ll probably end up making 2x as many friends/contacts.</p>\n<p dir=\"ltr\">If you’re not technical, it’s good to bring someone from your team who is – they’ll be able to explain to the coding geeks why what you’re doing is cool. This is a must if one of your networking goals is to recruit developers. Someone who does marketing usually isn’t great at explaining the interesting technical challenges of your startup.</p>\n<p dir=\"ltr\"><strong>Above all, remember to have fun</strong>. Most of these events have free alcohol (and snacks if you’re lucky), so make use of that and loosen up a bit. Even for hermits, meeting new people  – especially people who might help your startup – can be surprisingly refreshing and invigorating.</p>\n<p dir=\"ltr\">Though many of these tips seem like “common sense,” you’d be surprised how many people don’t follow them. Just remember: <strong>be nice, be interesting, and don’t be awkward.</strong></p>",
    "type": "post",
    "path": "/2013/05/13/dont-be-awkward-making-the-most-of-a-networking-event/",
    "backgroundImage": "/backup/napoleon-960x540-2013-05-13-13-17-58.jpg"
}