{
    "title": "给力! 500 Goes BIG and Takes on China’s Trillion-Dollar Market",
    "slug": "e7bb99e58a9b-500-goes-big-and-takes-on-chinas-trillion-dollar-market",
    "date": "2013-02-23T05:18:02.000Z",
    "url": "http://500.co/?p=1116725855",
    "uri": "http://500.co/2013/02/22/%e7%bb%99%e5%8a%9b-500-goes-big-and-takes-on-chinas-trillion-dollar-market/",
    "postId": "1116725855",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/02/RuiPicSite.jpg"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "beijing",
        "china",
        "guangzhou",
        "shanghai",
        "shenzhen",
        "who-is-500",
        "%e7%bb%99%e5%8a%9b"
    ],
    "content": "<strong>This month, we’re showing you where the biggest startup innovation is happening all around the globe. Today, check out insights from <a href=\"https://twitter.com/ruima\">Rui Ma,</a> 500’s Chinese Venture Partner, about why the largest nation in the world is ready to shake things up in the global tech scene. Want to be part of 500 Startups’ next batch? <a href=\"https://bit.ly/Applyfor500\" target=\"_blank\">Apply now before the March 1st deadline. </a></strong>\n\nI went to high school and college in the United States, but was born and raised in China. I have always maintained a deep cultural connection to the country, both in terms of the language and the culture. Over the past few years, Chinese society has gone through (and continues to go through) big changes; people in China are collectively beginning to realize their massive influence in the world. As 500’s Beijing-based venture partner, I am incredibly excited to spread the #500Strong belief that technology can make the world a kinder, easier, smarter and more enjoyable place for everyone.\n\nSo why is China the place to be right now for investors and entrepreneurs? For starters, every single statistic you can think of is on a completely different scale when it comes to China. Populations are counted not in the millions, but in BILLIONS. And at nearly 500 million, the number of internet users dwarfs any number you could come up with in the West.\n\nThe fabled huge market potential in China is no longer a myth; it has arrived. The four first-tier cities – Beijing, Shanghai, Shenzhen and Guangzhou – have more than 100 million residents, and the surge in wealth in these areas over the past few years has been huge. Alone, these population centers make up one of the BIGGEST markets on the planet; there is an incredible amount of opportunity here for tech companies as China’s growing consumer population has the same needs for quality content, apps, and services as their Western counterparts.\n\nI have seen firsthand as China’s urban population has changed dramatically over the last few years. While failure is still shunned culturally (as it still is in many parts of the USA and other countries), the stigma isn’t nearly as bad as it used to be. The prevailing wisdom is still to work for a large, stable, state-owned enterprise or conglomerate, but that is changing quickly. As more Western culture finds its way into Chinese media, many the well-educated, globally-aware youth are starting to take on new challenges – like startups.\n\nThe rapid economic development of the past three decades has lifted many people out of poverty. With the combination of newfound market opportunity, lower cost of starting a business, and plentiful examples of wealth creation in the form of such industry titans as <a href=\"http://en.wikipedia.org/wiki/Robin_Li\">Robin Li</a> of <a href=\"http://en.wikipedia.org/wiki/Baidu\">Baidu</a>, <a href=\"http://en.wikipedia.org/wiki/Ma_Huateng\">Pony Ma</a> of <a href=\"http://en.wikipedia.org/wiki/Tencent\">Tencent</a>, and <a href=\"http://en.wikipedia.org/wiki/Jack_Ma\">Jack Ma</a> of <a href=\"http://en.wikipedia.org/wiki/Alibaba_Group\">Alibaba</a>, attitudes about work, life and self-fulfillment are shifting.\n\n500 is betting that these trends will continue to shape China over the next few years, and we hold a long-term view on investing in the Chinese entrepreneurship ecosystem. We want to nurture the growing tech community and find partners who share our desire to see an increasingly collaborative, open, smart, and most importantly, global startup scene. We’re excited to bring the 500 philosophy to China, and to also bring some of China to 500 in the process.\n\nAre you a Chinese entrepreneur who’s <a href=\"http://knowyourmeme.com/memes/gei-li-%E7%BB%99%E5%8A%9B\">gelivable</a> enough to take on this incredible market? <a href=\"http://angellist.co/500startups\">Apply now for our Spring Accelerator batch</a> by March 1!\n\n<em><strong><a href=\"/backup/RuiPicSite-2013-02-22-13-23-18.jpg\"><img class=\"alignleft  wp-image-1116725421\" alt=\"RuiPicSite\" src=\"/backup/RuiPicSite-2013-02-22-13-23-18.jpg\" width=\"180\" height=\"180\" /></a>Post Contributed by Rui Ma, Venture Partner and Stealth Assassin at 500 Startups.</strong> Previously, Rui was under deep cover at corporations such as Merrill Lynch, Morgan Stanley, and most recently the Raine Group. When she is not on active assignment, she can be found brewing vegetable poisons and learning the covert arts from her cats.</em><b id=\"internal-source-marker_0.9278834341093898\">\n</b>",
    "type": "post",
    "path": "/2013/02/22/%e7%bb%99%e5%8a%9b-500-goes-big-and-takes-on-chinas-trillion-dollar-market/",
    "backgroundImage": "/backup/bejing-960x540-2013-02-22-13-23-18.jpeg"
}