{
    "title": "Email Marketing for Fun and Profit – a Talk by Patrick McKenzie at 500 Startups",
    "slug": "email-marketing-for-fun-and-profit-a-talk-by-patrick-mckenzie-at-500-startups",
    "date": "2013-06-14T18:50:19.000Z",
    "url": "http://500.co/?p=1116727927",
    "uri": "http://500.co/2013/06/14/email-marketing-for-fun-and-profit-a-talk-by-patrick-mckenzie-at-500-startups/",
    "postId": "1116727927",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "accelerator",
        "email",
        "marketing",
        "patrick-mckenzie",
        "saas"
    ],
    "content": "<i>In this post, 500's distribution intern Samantha Siow summarizes <a href=\"http://twitter.com/patio11\" target=\"_blank\">Patrick McKenzie's</a> recent talk on how to boost your startup's email efforts. Follow her at <a href=\"https://twitter.com/samanthassiow\" target=\"_blank\">@samanthassiow</a></i>\n\nTake a chill pill with the spending on random marketing biz, bro, and take a look at these awesome tips to up your SWAG MONEY FACTOR*.\n\n*I regret using this term already.\n\nOn Wednesday, Patrick McKenzie, a mentor at 500, came by the office to give a talk titled “Email Marketing for Fun and Profit.”  The talk focused on educating B2B and/or SaaS businesses on how to educate, persuade and sell their products via email and eventually improve customer acquisition, decrease cost per acquisition, decrease churn, and increase average revenue per account.\n\nMcKenzie started his talk by stating that there are <b>two ways to sell software</b>.\n<ul>\n\t<li><b>Low Touch Sales:</b> These are demand driven and tend to convert customers at scale via web, email, etc. The end user is often the buyer. Lower price points are characteristic of this type of sales.<b></b></li>\n\t<li><b>High Touch Sales:</b> These are demand driven and tend to convert customers one at a time. The end user is probably not the buyer and there are most likely multiple decision makers in the buying process. Higher price points (see: EXTREMELY HIGH) are characteristic of this type of sale.<b></b></li>\n</ul>\n<b>Modern Software as a Service Models</b>\n<ul>\n\t<li>Monthly billing is a core innovation</li>\n\t<li>Thousands of dollars worth in customer lifetime values can be acquired at low-touch.</li>\n\t<li>Hybrid models are possible (E.g., your initial plan may state $200/month for small businesses, but if you were to semi-pivot once it proves value at this self-serve volume to fit enterprise sales, you could make the big bucks!)</li>\n</ul>\n<b>Types of Email Marketing</b>\n<ul>\n\t<li>Newsletters\n<ul>\n\t<li>Pros: Hit the entire subscriber list biweekly/monthly</li>\n\t<li>Cons: Passive (there’s little you can do to optimize how many users open the email), and not very targeted at the user.</li>\n</ul>\n</li>\n\t<li>Drip Email\n<ul>\n\t<li>This is where a user chooses to give you their email address and in return, you give them a time-released series of content (e.g. 6 emails over the course of one month).</li>\n\t<li>Pros: Users will have a predictable relationship with the company. Over time, they will become higher trust, higher engagement, higher revenue users.</li>\n</ul>\n</li>\n\t<li>Lifecycle emails\n<ul>\n\t<li>These emails are specific to customer behavior in terms of the relationship between customer and company.</li>\n\t<li>Cons: The content must constantly meet the needs of the customer.</li>\n\t<li>Pros: Extremely high open rates and conversion rates; No abusive emails.</li>\n</ul>\n</li>\n</ul>\nMcKenzie then went on to give his “single most actionable tip”…\n\n<b>OFFER ANNUAL BILLING!</b>\n\nWith any SaaS or B2B-type company, there is a 10-20% organic signup through direct visits. By using email, you can gain another 10-20%, thereby doubling your signups through the magic of email!\n\nHow? Let me show you the ways—\n<ul>\n\t<li>Send a single one time email offering a discount (e.g., 1 month free if there’s a switch to annual billing)</li>\n\t<li>Offer it to loyal customers over email</li>\n\t<li>One click + confirmation that completes the switch</li>\n\t<li>Conversion rate of 10-25%!</li>\n</ul>\nThis results in an immediate revenue of $200 per email sent! Thus, you can greatly decrease churn rate while increasing money over the year! <strong>IS THIS TOO GOOD TO BE TRUE?! NO.</strong> This is a great option for startups that are often capital constrained as it allows them to gain immediate payment from the customer.\n\n<b>Permission</b>\n\nEthics! You have permission to:\n<ul>\n\t<li>Send emails to people you have a pre-existing business relationship with</li>\n\t<li>Send people exactly the email they affirmatively ask for (with a double opt-in option, where the user has to confirm twice that they are subscribing)</li>\n</ul>\n<b>Drip emails</b>\n\nProblem: Low conversion to trial?\n\nSolution: Sell via email!\n<ul>\n\t<li>Conversions via visitor -&gt; customer signup = 1% (users are skeptical of payment on the internet—think of the last time you gave your credit card number to some random website!)</li>\n\t<li>Conversions via visitor -&gt; email submission = 20-40%, particularly if you offer a decent incentive! (giving someone your email is consideredmore “safe” in comparison to giving them a credit card number)</li>\n\t<li>Therefore, the best option would be to send people a drip campaign. This might consist of a one month long free course, delivered over 6-8 emails. This course should serve to educate, persuade and eventually sell the product.</li>\n</ul>\n<b>Keys to Landing Page Design</b> (different from your homepage because it should explain the product and have a focused pitch to increase the conversion rate)\n<ul>\n\t<li>Offer an immediate incentive. Immediacy = High value! This can include reports/white papers or one-off tools that are tangible to the user.</li>\n\t<li>Have one clear call to action! Use action-related wording to capture the viewer and make them DO SOMETHING.</li>\n\t<li>Provide social proof! This can come in the form of other customers you’ve had in the past that are well known (people like big names, Google, Walmart, Samuel L. Jackson!) or testimonials from satisfied users.</li>\n\t<li>Sell the value of taking this action. Teach them what they’d gain from using your product! TIP: put this as the sign-up button!</li>\n</ul>\n<b>UX Improvements for a Double Opt-In</b>\n\nBecause 40-60% of viewers will not continue after the verification (and even higher on mobile devices), it’s important to add a note to give incentive. McKenzie stated that the following phrase worked very well for him, “Thanks for your email, but we’re very serious about not spamming our subscribers so please verify if you’re interested!” and it has halved the number of people lost by the double opt-in.\n\nA great tip is to guess their email provider (from their sign up address) and provide a link to that website.\n\n<b>Drip Marketing</b>\n\nCustomers often lack trust to immediately get into a commercial relationship. When you choose provide them with time-released content, you can increased their trust and demonstrate your knowledge!\n\n<b>Scheduling the Drip Campaign</b>\n<ul>\n\t<li>Start by building credibility!\n<ul>\n\t<li>Begin with 2 emails to keep you at the top of their mind for the 1st week.</li>\n\t<li>Engagement close</li>\n\t<li>Introduce your solution. Tie it to problems they may have and state how you would address it with YOUR AMAZING SERVICE.</li>\n\t<li>Return back to education. You are the master!</li>\n\t<li>Down sell. If they haven’t bought your product by now, they may have problems with the pricing or product. By down selling, you can capture the market with a cheaper product that may be more appropriate for their needs.</li>\n\t<li> Transition to a long term relationship. (BFFs for life! Except with money.)</li>\n</ul>\n</li>\n</ul>\n<b>What should I write about in the email?</b>\n<ul>\n\t<li>Anything that would make a decent blog post would make an excellent email.</li>\n\t<li>Most users are not experts (and don’t target the experts!)</li>\n\t<li>Play up the exclusivity angle.</li>\n\t<li>Recycle things you’ve used elsewhere (e.g. older blog posts)</li>\n</ul>\n<b>Writing non-salesy emails!</b>\n<ul>\n\t<li>Target consumption time of 5-15 minutes. (Less is more, unless your users are extremely interested in your content.)</li>\n\t<li>3 elaborated points via linked pages.</li>\n\t<li>Use the engagement close. (e.g.  “I love talking to our customers, hit reply and tell me one thing you learned in this email or one thing you’d like to hear about! I read everything and respond to most.”) Guaranteed to pull in customers!</li>\n</ul>\n<b>Writing sales emails!</b>\n<ul>\n\t<li>Tie the email to previous educational content.</li>\n\t<li>Pitch the benefits of your product, not the feaures.</li>\n\t<li>Never try to sell more than one decision at once.</li>\n\t<li>Send them to a dedicated purchase page.</li>\n\t<li>Offer an incentive if they take action on it immediately.</li>\n</ul>\n<b>Lifecycle emails!</b>\n\nThe Basic Principles:\n<ul>\n\t<li>Right person. Right email. Right time.</li>\n\t<li>People perceive outsized value from personalized advice.</li>\n\t<li>You’ll get double the deliverability/open rates/click virtually for free!</li>\n\t<li>Mapping each email to one specific “small sell” makes it much more likely that you’ll successfully influence their behavior! Small sells are easily accomplishable to the viewer and after that, you can ask for bigger actions to be taken!</li>\n</ul>\nAt a one time production cost, you can provide something specific to the needs of each customer.\n\n<b>Examples of lifecycle email</b>\n<ul>\n\t<li>A personalized welcome from the CEO when the client starts using the software.</li>\n\t<li>If the client looks like they’ll cancel, send them a rescue email.</li>\n\t<li>If the client doesn’t use a particular feature, send a getting started guide.</li>\n\t<li>If the client is getting to a decision point, send them an ROI calculation (e.g. how much you’re saving them!)</li>\n</ul>\nAim for your lifecycle emails to be simple and short. Use a HTML template for the emails (branded by you) and aim to have a targeted reading time of 1 minute or less with exactly one desired action. It’s also very important that you write the email as if it’s from one person to another! Don’t be a bot!\n\nSeveral situations of a lifecycle email:\n\nWelcome:\n<ul>\n\t<li>Establish expectation for trial</li>\n\t<li>Getting Started guide</li>\n\t<li>Introduce yourself and ask for them to email you with questions!</li>\n</ul>\nPersonalized welcome:\n<ul>\n\t<li>Styled to look like it’s sent from a person to another</li>\n\t<li>Announce your availability to chat!</li>\n</ul>\nFree trial’s going well? GREAT!\n<ul>\n\t<li>Simple heuristic</li>\n\t<li>Do an ROI calculation</li>\n\t<li>Close sale (or mention that it is automatic, and if not, give an immediate incentive!)</li>\n</ul>\nFree trial’s not going well? RESCUE!\n<ul>\n\t<li>Simple heuristic</li>\n\t<li>Figure out why they aren’t doing well and try to fix it!</li>\n\t<li>Set up a dialogue to find out what are their problems and integrate into the product roadmap if it agrees with general demand.</li>\n\t<li>Great opportunity for customer development.</li>\n</ul>\nWeekly checkup\n<ul>\n\t<li>High perceived value</li>\n\t<li>Great engagement</li>\n\t<li>Creates “ongoing earned media” via the option to embed announcements, links, etc.</li>\n\t<li>Makes ROI discussion academic. Tell them how great they’re doing because of you! It’s all because of your AMAZING PRODUCT that their lives are now 110% better! (Or make it seem that way.)</li>\n</ul>\nEmail Optimization\n<ul>\n\t<li>Subject Lines!!!!! Very, VERY important in the performance of email campaigns, particularly drip/newsletters. A/B test this<i>after you reach scale</i>.</li>\n\t<li>Everything else (e.g. time of day, to/from, mail copy, collateral) is less important but should still be considered.</li>\n</ul>\nMetrics that Matter!\n<ul>\n\t<li>Sign up conversions (e.g. views of squeeze page, conversion rate to email submit)</li>\n\t<li>Open rates</li>\n\t<li>Clicks (e.g. of tagged URLS, google analytics within parameters)</li>\n\t<li>Actions taken subsequent to email (e.g. dedicated landing pages, kissMetrics, etc.)</li>\n</ul>\nPricing SaaS!!\n<ul>\n\t<li>Price based on your value to the customer, not on the cost to you! Anchors are very important (e.g. know your worth within the market and price accordingly.) One way to use this is with the phrase “pays for itself in one saved appointment” which has a value anchored in the customer’s minds.</li>\n\t<li>Segment to capture customer value. (e.g. price higher for enterprises, lower for small businesses_</li>\n\t<li>The 4-plan pricing page</li>\n\t<li>Always remember, it’s not their money that they are spending so it’s easier for them to spend it!</li>\n</ul>\nAnd lastly, <strong>CHARGE MORE!</strong> Most SaaS-based companies tend to under charge but people (should) need your product, so abuse the heck out of that fact!",
    "type": "post",
    "path": "/2013/06/14/email-marketing-for-fun-and-profit-a-talk-by-patrick-mckenzie-at-500-startups/"
}