{
    "title": "Distro Case Study: The Engagement Habit with Doorman App",
    "slug": "engagement-habit-with-doorman-app",
    "date": "2014-04-10T16:00:29.000Z",
    "url": "http://500.co/?p=1116732059",
    "uri": "http://500.co/2014/04/10/engagement-habit-with-doorman-app/",
    "postId": "1116732059",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2014/04/img-iphone-150x300.png",
        "http://500.co/wp-content/uploads/2014/04/IMG_38112-300x290.png",
        "http://500.co/wp-content/uploads/2014/04/IMG_3815-171x300.png"
    ],
    "creator": "",
    "categories": [
        "distribution",
        "startups",
        "tips"
    ],
    "content": "<strong><em>This interview and case study is part of our Distribution series, presenting actionable material your startup can use today. </em></strong>\n\n<em><strong>More marketing tips @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and via <a title=\"Join the Distrosnack newsletter\" href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">Distrosnack</a>, our daily email of bite-sized marketing tips and mind-blowing GIFs.</strong></em>\n<p dir=\"ltr\"><strong>Drop-off points</strong> are the leaks in your conversion funnel, the spots where your users should skip right along the shiny path towards diehard fandom but, for various reasons, just don’t.</p>\n<p dir=\"ltr\">They’re more than just weak links. Drop-offs can tell you what your product is missing -- and where -- and offer a cheap and actionable insights for reducing customer acquisition costs, increasing customer retention, and even driving feature development.</p>\n<p dir=\"ltr\"><a href=\"http://500.co/wp-content/uploads/2014/04/img-iphone.png\"><img class=\"alignright size-medium wp-image-1116732095\" align=\"right\" alt=\"doorman iphone cropped\" src=\"/backup/img-iphone-150x300-2014-04-10-14-11-00.png\" width=\"150\" height=\"300\" /></a> For this case study, we looked at some recent work that <a title=\"Andrei Marinescu Twitter\" href=\"http://twitter.com/malaparte\" target=\"_blank\">Andrei Marinescu</a> from the <a title=\"500 Startups Distribution Team\" href=\"http://500.co/distribution\" target=\"_blank\">500 Distribution Team</a> did with <a title=\"Doorman the End of Missed Deliveries\" href=\"http://doorman.it\" target=\"_blank\">Doorman.it</a>, the on-demand package delivery startup that lets users schedule deliveries whenever they can be home to receive them.</p>\n<span style=\"line-height: 1.5em;\">Identifying 3 known drop-off points was more actionable to Doorman than staring up at a wall of churn.</span>\n\nHere are those key drop-off points:\n<ol>\n\t<li>Signup.</li>\n\t<li>Signup, send 1 package.</li>\n\t<li>Sign up, send 2 packages.</li>\n</ol>\nHow did they pinpoint these drop-off risk zones? Is there a framework that other startups can adapt?\n<p dir=\"ltr\"><em><strong>Andrei Marinescu:</strong></em></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">Doorman identified these drop-off points early based on engagement data they were seeing, but yes there's a takeaway in here for any early-stage company.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">It's critical for teams at early-stage start-ups to walk through the on-boarding process regularly <em>themselves </em>to make sure there are no obvious UX or engagement cliffs. This process means <a title=\"How to Define Your User Engagement Cycle\" href=\"http://500.co/2013/11/19/when-and-how-to-define-your-user-engagement-cycle/\" target=\"_blank\"><span style=\"color: #808080;\">defining your user engagement cycle</span></a>.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">You have to make sure that your users are always clear on what they should/can do next.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">Tangential to that is the notion of working towards establishing your product or service as a part of user's relevant routine(s).</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">For example, the Doorman team and I discussed the idea of prompting new users in the welcome email to add their Doorman address to their Amazon, eBay, or other dominant e-commerce accounts. This simple action cuts down on friction and makes it that much easier to deepen their \"Doorman Habit.\"</span></p>\n<p dir=\"ltr\"><em><strong>Zander Adell, co-founder @ Doorman:</strong></em></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">I used to work in a video games company, where you look at the product you’re building in terms of levels.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">This breaks down something big and all-encompassing like “user engagement” into discrete conversion events. So, you have defined framework for knowing if user is higher level or not. This lets you identify chapters of usage behavior.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">With Doorman, we realized that our usage chapters are defined by the number of deliveries a person gets:</span></p>\n\n<ul style=\"padding-left: 30px;\">\n\t<li style=\"padding-left: 30px;\"><span style=\"color: #808080;\">1 package requires a big leap of faith and trust that Doorman will do it right</span></li>\n\t<li style=\"padding-left: 30px;\"><span style=\"color: #808080;\">2 packages means they like the service</span></li>\n\t<li style=\"padding-left: 30px;\"><span style=\"color: #808080;\">2+ packages gets us into habit zone, which is where we want to be for as many users as possible.</span></li>\n</ul>\nNext, we’ll look at Doorman’s drop-offs and what they’ve done about them.\n<h2 dir=\"ltr\"></h2>\n<h2 dir=\"ltr\">Drop-off 1: Sign up for Doorman. THE END.</h2>\n<p dir=\"ltr\">Out of 100 users who sign up for the service, 75 end their engagement here.</p>\n<p dir=\"ltr\"><em>Is it our on-boarding? Is our friendly welcome message secretly pissing people off? Are we making it too hard to put in the right address?</em></p>\n<p dir=\"ltr\">Why would a user go to all the trouble to sign up, but never try to use the service for its actual benefit? It’s enough to leave a startup co-founder scratching his head.</p>\n<p dir=\"ltr\">Instead of continuing to wonder and head-scratch from the safety of the 500 offices, Doorman went out and interviewed a focus group of customers to get the next clue.</p>\n<p dir=\"ltr\"><em><strong>Zander:</strong> </em></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">It turns out a lot of people were waiting for an 'important' purchase to use Doorman on. So they'd wait and wait and wait… and wait.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">This is better than the alternative -- that Doorman wasn’t compelling enough for them to actually use it a single time -- but still presented a pretty big hurdle for us.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">We realized that we needed to help new users get over that first delivery hump. Instead of waiting for an important package to make a Doorman delivery “worth it,” we decided to make it easier for people to say yes right away.</span></p>\n\n<h2 dir=\"ltr\"></h2>\n<h2 dir=\"ltr\">The Fix</h2>\n<p dir=\"ltr\">To help users get past this first big hurdle, Doorman offer a free welcome gift -- as of last week, the first 5 users a day who sign up for doorman are eligible to get a free delivery of a real thing, delivered right to their door that same night. BOOM.</p>\n<p dir=\"ltr\"><a href=\"http://500.co/wp-content/uploads/2014/04/IMG_38112.png\"><img class=\"alignright  wp-image-1116732069\" style=\"margin-left: 10px; margin-right: 10px;\" alt=\"Doorman App Welcome Gift Screen\" src=\"/backup/IMG_38112-300x290-2014-04-10-14-11-00.png\" width=\"259\" height=\"250\" align=\"right\" /></a>Here's what the new flow looks like</p>\n<p dir=\"ltr\">1. Sign up</p>\n<p dir=\"ltr\">2. Ooh, Welcome Gift... ok sure.</p>\n<p dir=\"ltr\">3. Back to work for a few hours...</p>\n<p dir=\"ltr\">4. Get Welcome Gift delivered that same evening (bonus: rip open immediately and enjoy, or save for a rainy/thirsty day)</p>\n\n<h2 dir=\"ltr\"></h2>\n<h2 dir=\"ltr\">The Results</h2>\n<p dir=\"ltr\">Adding the Welcome Gift, not only encouraged more users to engage beyond signup, but it also <em>halved</em> the number of days it took to send out the next delivery.</p>\n\n<h2 dir=\"ltr\"></h2>\n<h2 dir=\"ltr\">Engagement Takeaway</h2>\n<p dir=\"ltr\">If your signup flow is the only thing a new user ever engages with -- but not your actual product -- that’s not an engagement story that’s going to end well. Later, it can be hard and costly to re-engage these users that are now in your “extra-dormant” segment</p>\n<p dir=\"ltr\">Doorman’s approach was to handhold people with their first engagement, reducing uncertainty and increasing trust, and thus making it easier for users to initiate later engagement actions on their own.</p>\n<p dir=\"ltr\"><em><strong>Andrei:  </strong></em></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><em><strong></strong></em><span style=\"color: #808080;\">Doorman, like most early stage startups, are dealing with two challenges at the same time: staying top-of-mind, and making it easy for users to activate the service.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">To form a Doorman Habit means users are replacing their shipping address with their Doorman proxy address across in more and more places where they buy things online. </span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">The latter can be achieved by making the Doorman address super-handy to access (e.g., prompting the user to add it to her own address book profile). This behavior can be prompted in the welcome email, or in a follow-on email, which also helps Doorman stay top-of-mind. </span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">Ideally, we could predict when a user is about to place an order, and prime them to use Doorman just before then. If a new user still hasn't used the service x days after registering, there's always the option of using a discount offer or other quid-pro-quo to get them over that initial friction.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">Lastly, Zander &amp; Kapil's idea for accepting packages for return shipping at the time of delivery is a smart one that can drive follow-on orders.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #808080;\">For example, Jane first uses Doorman for the delivery of a Nordstrom's package. We can infer that the item is likely clothing, and the day after the delivery, we send her an email asking if she was pleased with the service and notifying her that if she needs to return anything from her order, Doorman will pick it up for free when they make their next delivery to her.</span></p>\n<p dir=\"ltr\">The key takeaway here is to be predictive, pro-active, and very present. You don't have to wait till the user 'needs' your product or service to offer it to them (or remind them of its benefits).</p>\n\n<h2 dir=\"ltr\"></h2>\n<h2 dir=\"ltr\">Dropoff 2: Sign up, send the first package.</h2>\n&nbsp;\n\nAh, those crazy drop-off points... just when you think you’ve solved one, you’ve really just shoveled your way deeper to the next one.\n<p dir=\"ltr\">For Doorman, getting users to send that initial package is a huge win because it gets them past the single biggest hurdle. The user signed up and sent the first package. DONE.</p>\nWait... there’s more.\n<p dir=\"ltr\">Doorman’s second drop-off point kicks in after a new user signs up, sends one delivery, and is happily tearing their package open in the comfort of their home at an inconveniently non-business hours time of day.</p>\n<p dir=\"ltr\">But, for some reason or another, this user then falls dormant and that second delivery -- for Doorman a critical signal of stickiness -- never happens.</p>\n\n<h2 dir=\"ltr\"></h2>\n<h2 dir=\"ltr\">The Fix</h2>\n&nbsp;\n\nTo smooth out this next drop-off point, Doorman will be rolling out a drip email campaign in the next weeks to re-engage people after a 10 day quiet period, a key phase when users can either be planning their next online purchase -- and Doorman delivery -- or not.\n\nStay tuned, or if you're an SF resident, check out Doorman yourself to see how their drip campaign goes.\n<h2></h2>\n<h2>Engagement Takeaway</h2>\n<p dir=\"ltr\">A takeaway here is that they’ve identified a 2-part definition for engagement. As the user moves further along, engagement means both an action, “Send second package,” and a time frame, “within 10 days of initial delivery.”</p>\n<p dir=\"ltr\">So if something’s not working as the user approaches that critical habit formation stage, a 2-part engagement definition lets your team isolate the problem with more precision, and test targeted improvements.</p>\n\n<h2 dir=\"ltr\"></h2>\n<h2 dir=\"ltr\">The Doorman Habit and Beyond</h2>\n<p dir=\"ltr\"><em><strong>Zander:</strong></em></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><a href=\"http://500.co/wp-content/uploads/2014/04/IMG_3815.png\"><img class=\"alignright size-medium wp-image-1116732077\" style=\"margin-left: 10px; margin-right: 10px;\" alt=\"Doorman app welcome gift confirmed\" src=\"/backup/IMG_3815-171x300-2014-04-10-14-11-00.png\" width=\"171\" height=\"300\" align=\"right\" /></a><span style=\"color: #888888;\">For us, the stretch from signup to 2 deliveries has been a major driver of features and distribution strategies. After 2 deliveries, ‘drop off’ drops off, and retention rises in a big way (over 70%).</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #888888;\">With this in mind, we’ve focused feature development around these two key landmarks -- sign up + first delivery, sign up + first delivery + 2nd delivery. After a new user crosses the 2 delivery threshold, they're no longer a fledgling; they're more resilient and can stick with Doorman on their own.</span></p>\n<p style=\"padding-left: 30px;\"><span style=\"color: #888888;\">Until that point, we have to help.</span></p>\n<p style=\"padding-left: 30px;\"><span style=\"color: #888888;\">We see each delivery like a level in a game. If you haven't gotten to level 2 yet and you should've by now we’ll send you an email. If you get through the whole series (2 deliveries) then you're pretty independent as a Doorman user, and we can focus our engagement efforts on people earlier in the funnel.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #888888;\">When people first sign up for Doorman, there's this choice: should I use it, or not? And that's the choice that every product faces.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #888888;\">Our ultimate goal for every new person who comes to us is for them to make us a habit.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #888888;\">If we want people to approach the experience like a (good) habit, then we have to eliminate that choice. We've tossed around some ideas around making the service feel unlimited and free, a Prime-esque experience. We've looked at reducing friction around address entry and payment.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #888888;\">We started this company because we think we can be a good habit in someone's life -- something that solves a recurring inefficiency, and frees up time and brain space to do better things.</span></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><span style=\"color: #888888;\">A user is either engaging, or they're dropping off -- and we're losing them.</span></p>\n<p style=\"padding-left: 30px;\"><span style=\"color: #888888;\">So to get Doorman entrenched into people's lives like a good habit, like flossing or drinking a glass of water first thing when you wake up, we have to think about every action as it translates to engagement.</span></p>\n\n<h2 dir=\"ltr\"></h2>\n<h2 dir=\"ltr\">What's Next?</h2>\n<p dir=\"ltr\">If you enjoyed this post, first check out these additional resources for how you can up your game from the 500 Distribution team:</p>\n\n<ul>\n\t<li><a title=\"How We Doubled Our Conversion Rate – Bombfell Co-Founder Bernie Yoo\" href=\"http://500.co/2014/03/24/how-we-doubled-our-conversion-rate-bombfell/\">How We Doubled Our Conversion Rate - Bombfell Co-Founder Bernie Yoo</a></li>\n\t<li><a title=\"5 Distribution Experiments You Can Do For $10 Or Less\" href=\"http://500.co/2014/03/13/5-distro-experiments-you-can-do-on-10-or-less/\" target=\"_blank\">5 Distribution Experiments You Can Do For $10 Or Less</a></li>\n\t<li><a title=\"The Power of Trigger Emails\" href=\"http://500.co/2013/10/25/the-power-of-trigger-emails/\">The Power of Trigger Emails</a></li>\n</ul>\n<p dir=\"ltr\">Then, sign up to get a daily bite-sized distro hack (and an awesome GIF) delivered to your inbox:</p>\n<strong>&gt;&gt; <a title=\"Distrosnack 500 Startups Distribution Email Newsletter\" href=\"http://eepurl.com/BfYXn\">Subscribe to Distrosnack here</a> &lt;&lt;</strong>",
    "type": "post",
    "path": "/2014/04/10/engagement-habit-with-doorman-app/",
    "backgroundImage": "/backup/Screen-Shot-2014-04-10-at-11-57-03-AM2-960x351-2014-04-10-14-11-00.png"
}