{
    "title": "Engineering vs. Design",
    "slug": "engineering-vs-design",
    "date": "2011-03-22T23:47:21.000Z",
    "url": "http://blog.500startups.com/?p=1116715137",
    "uri": "http://500.co/2011/03/22/engineering-vs-design/",
    "postId": "1116715137",
    "description": "",
    "images": [
        "http://thingscoolerthantoothpaste.files.wordpress.com/2010/01/gecko_brick_cell.jpg",
        "http://justinsomnia.org/images/qr-code-justinsomnia.png"
    ],
    "creator": "",
    "categories": [
        "design",
        "guest-posts",
        "jason-putorti",
        "mentors",
        "user-experience",
        "ux"
    ],
    "content": "<em>This post is a reblog from Jason Putorti's blog. Jason is a 500 Startups founder (of Votizen) and venture advisor. <a href=\"http://jasonputorti.com/post/3922568219/engineering-vs-design\">View the original post here</a>.</em>\n\n<iframe title=\"YouTube video player\" width=\"480\" height=\"390\" src=\"http://www.youtube.com/embed/FL7yD-0pqZg\" frameborder=\"0\" allowfullscreen></iframe>\n\nThe extranormal guy talking about features still thinks that the consumer actually cares about them, and that’s often the mindset of an engineer. Engineers are very interested in making the impossible, possible— and a device and feature are expressions of that possibility. Designers focus, or at least they should, on empathy with real people, and how to use the available technology to create a solution that delights them and solves their problem. Funny aside, there’s an important insight in this clip: the cell phone market, like many other technology markets, has become an <strong>experience market</strong>. This is why the consumer asking for the iPhone over and over again for reasons unknown makes absolutely no sense to our techie, who thinks feature parity or supremacy matters. The reason for this seemingly irrational desire of course, is the experience— that’s what the consumer is after.\n\n<img src=\"/backup/gecko_brick_cell-2011-03-22-11-17-47.jpg\" alt=\"\" width=\"180\" height=\"207\" />\n\nAll technology moves through a lifecycle. Step one is simply the fact that it’s <strong>possible</strong>. For the cell phone, think the Gordon Gekko brick phone. Once you have achieved possible, then companies race to pile on <strong>features</strong> to differentiate themselves, so you get smaller, faster, text messaging, MMS, mobile Internet, cameras, music player, GPS, bluetooth, WiFi, etc. Once everyone was fighting over features, Apple entered the market with less features, but a vastly superior <strong>user experience</strong>. People complained endlessly about the missing MMS, and other omissions, but nonetheless it sold in massive numbers and took over a massive piece of the market, leaving the feature phones fighting it out to be the one given away free with a plan.\n\nThe final stage of this technology lifecycle is often<strong>commoditization and integration</strong> into other devices. I mentioned a camera, music player, and GPS as being features in phones. All exist as independent products, but location-awareness has now become a commodity and it’s integrated into many other devices, just like the music player, and camera— not necessarily full fledged versions yet mind you, but the most popular camera on flickr is an iPhone. Camera phones are now massively popular and make up the bulk of the lower end. I don’t own an iPod, my iPhone handles that functionality, and I also don’t own a GPS device.\n\nAt SXSW, I was on a panel to “debate” design vs. engineering, and where startups need to apply their limited resources. The answer is not the same for everyone, even on the Internet, it’s wholly market dependent.\n\nLook at check-in services. First checking-in somewhere became possible with Loopt, and later <a href=\"http://foursquare.com/\" target=\"_blank\">Foursquare</a> and <a href=\"http://gowalla.com/\" target=\"_blank\">Gowalla</a>. Now declaring your location is built into <a href=\"http://path.com/\" target=\"_blank\">Path</a>, <a href=\"http://instagram.com/\" target=\"_blank\">Instagram</a>,<a href=\"http://foodspotting.com/\" target=\"_blank\">Foodspotting</a>, and many other social apps. Just shouting “I’m here” isn’t differentiated anymore, next it’s about what features can I tie around location, such as discovery, alerting me when friends are nearby, etc. Gowalla seems to be stuck firmly in their check-in / rewards / items mindset, while Foursquare is moving ahead with a larger vision, and other players are entering as well. So while Gowalla remains beautiful visually, they are not moving towards the experience phase.\n\n<img src=\"/backup/qr-code-justinsomnia-2011-03-22-11-17-47.png\" alt=\"\" width=\"228\" height=\"228\" />\n\nAn example of a technology cemented firmly in the possible? QR Codes. Engineers have figured out how to pack a lot of data into a small image, but no designer has yet figured out how to make the experience around QR codes useful. SXSW had them on badges last year, and made a big push to get people using their scanner app, and they were notably absent this year. Engineering the technology alone doesn’t make something useful or usable by the mainstream. The Segway strikes me as another cemented in the “possible”.\n\nSo, understand your market. <a href=\"http://airbnb.com/\" target=\"_blank\">Airbnb</a> understood where the online travel market was, and become an experience company— they are doing very well without any defensible technology of their own, but through designing the experience (everything from hiring videographers and photographers to make the browsing experience amazing, to iPhone triggered locks on the rentals) they are on their way to a defensible marketplace and network effect. <a href=\"http://path.com/\" target=\"_blank\">Path</a> turned down a rumored $100M acquisition offer, similarly with no core differentiating technology, but a delightful design and key insight on a customer need, from which they are aspiring towards a network effect. If your vision is an incredible new piece of technology that achieves what nothing else on the market can, build yourself an engineering culture. If your market is more mature, you need design thinking early.\n\nMany thanks to <a href=\"http://uie.com/\" target=\"_blank\">Jared Spool</a> for inspiring this post.\n\n&nbsp;",
    "type": "post",
    "path": "/2011/03/22/engineering-vs-design/"
}