{
    "title": "Entrepreneurship == Lewd Jokes + Product/Market Fit?",
    "slug": "entrepreneurship-lewd-jokes-productmarket-fit",
    "date": "2011-07-22T00:04:16.000Z",
    "url": "http://blog.500startups.com/?p=1116715783",
    "uri": "http://500.co/2011/07/21/entrepreneurship-lewd-jokes-productmarket-fit/",
    "postId": "1116715783",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/07/profile_pic-150x150.jpg",
        "http://500.co/wp-content/uploads/2011/07/standup.jpg",
        "http://500.co/wp-content/uploads/2011/07/seinfeld_young.jpg"
    ],
    "creator": "",
    "categories": [
        "guest-posts",
        "uncategorized"
    ],
    "content": "<div>\n\n<a href=\"http://500.co/wp-content/uploads/2011/07/profile_pic.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116715793\" title=\"profile_pic\" src=\"/backup/profile_pic-150x150-2011-07-21-11-19-04.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Saumil Mehta is the Founder of <a href=\"http://getlocbox.com/\">LocBox</a>, in addition to being a Housekeeper, Frequent Complainer, Occasional Janitor and Producer of Egregious Software Engineering Bugs. He has never been referred to as a visionary founder internally or externally and is rather miffed about the same. He tried to bribe fellow partners in crime to refer to him as \"Dear Leader\" but experiment was safely declared unsuccessful.</em>\n\n<em><a href=\"/backup/standup-2011-07-21-11-19-04.jpg\"><img class=\"alignnone size-full wp-image-1116715786\" title=\"standup\" src=\"/backup/standup-2011-07-21-11-19-04.jpg\" alt=\"\" width=\"400\" height=\"223\" /></a>\n</em>\n\nI am a freshly minted entrepreneur. I am also a failed stand-up comedian. Much to my surprise, my year of telling lewd jokes on stage under lights - a financially unrewarding activity if ever there was one (unless you're on Comedy Central or HBO) - has proved invaluable as I go from employee to entrepreneur. Today I'm here to tell you why.\n\nStandup, you see, is as much about scratching a personal itch as anything else, self-preservation be damned. After all, what rational person would agree to spend 10 minutes on stage talking at a bunch of strangers swilling watered-down drinks? Would anyone sitting around calculating expected value of success of effort wait to do 3 minutes of standup at 12:30am on a Wednesday at Rudy's in Palo Alto? It's about as foolish as trading a great job and a cushy salary to understand the microeconomics of Brazilian Blowouts (guys, Google that first; it's not what the Anthony Weiner-esque part of your mind thinks it is).\n\nTo put it simply, I'm doing LocBox because I can't not do LocBox. I'm not successful (yet) but I don't give a rat's ass about the standard trappings of success (yet); any dimwit with half a brain can drive a BMW in Silicon Valley. But convincing a hair salon about the virtues of algorithmic ad optimization and campaign fill rates? It's about the same as being heckled at Rudy's.\n\nSpeaking of heckling and pushing through the brick wall - what matters in the end in standup is the same thing that matters in startups. Sheer, dogged, bring-me-to-tears-but-not-to-quit persistence. Now, I realize that as someone who has made Sand Hill Road a grand total of zero dollars and zero cents, I'm mostly unqualified to pontificate. But in a short span of six months I've had folks change their minds on joining me, gone down to 5k in the corporate bank account with payroll, come mentally unhinged after my first idea failed, had an investor bail on me after stringing me along for weeks. But complaining about such small potatoes feels like pulling a Paris Hilton on reality tv; let's face it, guys like Tim Westergren, Joe Kraus and Vinod Khosla and countless others have seen worse and come out intact on the other side.\n\n<a href=\"/backup/seinfeld_young-2011-07-21-11-19-04.jpg\"><img class=\"alignnone size-full wp-image-1116715789\" title=\"seinfeld_young\" src=\"/backup/seinfeld_young-2011-07-21-11-19-04.jpg\" alt=\"\" width=\"260\" height=\"190\" /></a>\n\nThe same applies to comedy. You know that guy Jerry Seinfeld? The guy who built the most successful sitcom of all time? He once walked through a snowstorm to do a show that had gotten canceled unbeknownst to him. In the 1970s, Seinfeld worked the comedy club circuit (it's not Darfur, but it's not far off) for eighteen *months* straight without a single day off. Five minute set, five times a night, night after night. To this day, when young comedians come up to Seinfeld for advice, he dispenses two simple words: \"Just Work\". No more, no less. Just Work.\n\nBut the most interesting and unexpected parallel to me has been the natural kinship that entrepreneurial and comedic circles share. Both pursuits are brutally hard and there's a visceral tendency to pay it forward. The night I spent 3 minutes on stage at Rudy's at 12:30am on a Wednesday, the audience was already gone. The bar was shutting down and the bartender was changing garbage bags with a giant flopping racket of polythene whipping through the air. The MC had taken off 30 minutes ago. I considered quitting several times through the night as the crowd thinned. But there is no bigger douchenozzle than the n00b comic that quits just because they failed to score a good spot in the lineup. So I stayed. And as my three minutes pure hell commenced, I saw 3 bleary-eyed experienced comics fake-laughing in the second row, off to the side. I didn't even know their names but I will never forget them.\n\nAnd so it is with entrepreneurs. I've kept a running list in Excel and I'm up to over 20 fellow entrepreneurs - some wildly wealthy, others hand-to-mouth like me - that spent hours with me when I had nothing more than a half-baked idea. No cash or equity ever changed hands with these individuals. The 500Startups and AngelPad email lists are a microcosm of this very idea. Apart from the occasional hilarious troll email comparing Outlook to GMail, the lists are a fount of information from busy people that are under no obligation to answer random questions. But they do, and in excruciating detail. It blows my mind every single time. It also produces exquisite lines like this: \"X gives you leverage, it doesn't do the work...any more than simply putting up a profile on a dating site gets you laid.\"\n\nLastly, a note about failure. As I've mentioned earlier, I failed as a comedian. I failed because I discovered I like humor better than I like comedy (not the same, kids) and I like writing comedy better than the repetitive monotony of performance. I hope to not fail at my first startup. But regardless of outcome, my journey is already far more interesting than all those who read TechCrunch obsessively but are too chickenshit to try to build their own. I used to be one of those people. No more.\n\nSo that's all I have folks, thanks for reading. And if you are in the market for a Brazilian Blowout retention special from a friendly local merchant, you know where to call. Until next time, I'll be here. Just Working.\n\n</div>\n&nbsp;",
    "type": "post",
    "path": "/2011/07/21/entrepreneurship-lewd-jokes-productmarket-fit/"
}