{
    "title": "An Entrepreneur’s View Of The Japan Quake",
    "slug": "entrepreneur-view-of-the-japan-quake",
    "date": "2011-03-29T03:09:51.000Z",
    "url": "http://blog.500startups.com/?p=1116715148",
    "uri": "http://500.co/2011/03/28/entrepreneur-view-of-the-japan-quake/",
    "postId": "1116715148",
    "description": "",
    "images": [
        "http://apture.s3.amazonaws.com/0000012ee48de89e7916cdaa007f000000000001.matt%20romaine.JPG",
        "http://500.co/wp-content/uploads/2011/03/mygengo-300x137.png"
    ],
    "creator": "",
    "categories": [
        "earthquake",
        "guest-posts",
        "japan",
        "matthew-romaine",
        "mygengo"
    ],
    "content": "<em>This is a guest post by <a href=\"http://twitter.com/#!/quanza\" target=\"_blank\">Matthew Romaine</a>, co-founder and CTO of <a href=\"http://mygengo.com\" target=\"_blank\">mygengo</a>. This is reblogged from the <a href=\"http://blogs.reuters.com/small-business/2011/03/24/an-entrepreneurs-view-of-the-japan-quake/\" target=\"_blank\">original post on Reuters</a>. Matthew was in Tokyo with the rest of the mygengo team when the earthquake struck Japan earlier this month. Here he reflects on how it impacted mygengo.</em>\n\n<img class=\"alignnone\" title=\"Matthew Romaine\" src=\"/backup/0000012ee48de89e7916cdaa007f000000000001-matt%20romaine-2011-03-28-11-21-09.JPG\" alt=\"\" width=\"138\" height=\"175\" /> <a href=\"http://500.co/wp-content/uploads/2011/03/mygengo.png\"><img class=\"alignnone size-medium wp-image-1116715151\" title=\"mygengo\" src=\"/backup/mygengo-300x137-2011-03-28-11-21-09.png\" alt=\"\" width=\"219\" height=\"100\" /></a>\n\nAs I write this entry traveling 200 kilometers per hour (124 miles per hour) on a bullet train bound for Tokyo, I’m anxiously curious to catch up with my colleagues in person. One returns from Hong Kong today, another from Taiwan. A third is returning from a remote island south of Kobe, and three are making plans to return from Melbourne. Just last week we were all in the same room focused – or at least attempting to focus – on growing our crowd-sourced translation platform myGengo, from Tokyo.\n\nWe are a startup that gathers translators from around the world, qualifies them, then unleashes a sea of bite-size content – from emails, tweets, and iPhone app descriptions – for translators to work through. Users enjoy the convenience; translators like the work-flexibility. Our team is small and international, representing 8 nationalities, and our system relies on a stellar 2,000-member strong translator pool from every timezone.\n\nThis March was looking to be our biggest month yet – record revenue, record words translated, record new translators, and record timing. But just when it seemed the vibe and activity in the office couldn’t get (positively) crazier, it struck. The magnitude 9.0 shaker that sent our office ceiling lights crashing to the ground and everyone dashing outside – twice. The rest of that Friday was a course on tolerance-building for the string of aftershocks that followed.\n\nBut the shock to myGengo was just beginning. The day after the quake, news about the nuclear reactors in Fukushima began to cause alarm. The following Monday at the advice of their embassy, the project manager for our biggest project to date flew home. Some couldn’t commute to work due to erratic train schedules; others couldn’t work due to blackouts. Everyone was glued to the foreign press and tweeting public, trying to make sense of it all. This fire-hose of uncertain, unnerving, and often sensationalized “news” distracted the employees and brought productivity to a near halt, while our users around the globe needed us to focus.\n\nIt seemed the only way to get back on track was to detach ourselves from the local environment. So, for the sake of a little peace of mind, the team decided to relocate to remote areas with friends or family. And thanks to email, Skype, and Asia’s fast and reliable Internet connection, we’ve been able to continue working as a team despite operating from six locations.\n\nThe situation in Tokyo, while sometimes tense, was and is still fine. Trains are running on modified schedules, most supplies are available, and many people are going about their regular business. Fortunately our core system has continued to function amidst the disruptions – users keep ordering translations and translators keep translating.\n\nAs a team across multiple timezones, we have found a common time to regroup for a daily conference call. Though a few projects had scheduling adjustments, most are now back on track. In fact, half the team returns to Tokyo today, with the other half likely this weekend. I know some business owners with factories and logistics operations are not as fortunate.\n\nIf there is one thing I am proud of, it’s that every member of myGengo pulled together and shouldered more for the team. We are all stronger for this experience, and I hope we can share this strength to carry Japan through recovery.",
    "type": "post",
    "path": "/2011/03/28/entrepreneur-view-of-the-japan-quake/"
}