{
    "title": "F U Dave McClure (I learned it by watching you!)\t",
    "slug": "f-u-dave-mcclure-i-learned-it-by-watching-you",
    "date": "2011-12-01T23:18:24.000Z",
    "url": "http://500.co/?p=1116718993",
    "uri": "http://500.co/2011/12/01/f-u-dave-mcclure-i-learned-it-by-watching-you/",
    "postId": "1116718993",
    "description": "",
    "images": [
        "http://500co.zippykid.netdna-cdn.com/wp-content/uploads/2010/12/Xav-lopr-150x150.png",
        "http://500co.zippykid.netdna-cdn.com/wp-content/uploads/2010/12/hongquan-150x150.jpg",
        "http://500.co/wp-content/uploads/2011/12/i-learned-torrents-by-watching-you-1024x803.png"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<a href=\"http://500co.zippykid.netdna-cdn.com/wp-content/uploads/2010/12/Xav-lopr.png\"><img title=\"Xav-lopr\" src=\"/backup/Xav-lopr-150x150-2011-12-01-11-17-18.png\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500co.zippykid.netdna-cdn.com/wp-content/uploads/2010/12/hongquan.jpg\"><img title=\"hongquan\" src=\"/backup/hongquan-150x150-2011-12-01-11-17-18.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em><i>Meet Professor X, aka 500 SuperMentor <a href=\"http://blog.outgrown.it/\" target=\"_blank\">Hong Quan</a> (<a href=\"http://twitter.com/hongdquan\" target=\"_blank\">@hongdquan</a>). An entrepreneur and recruiter building cars and startups, Hong has even hired a real honest-to-goodness rockstar (#3 on Billboard charts).  He uses his superpowers of recruiting and abilities to read and influence human minds to bring young Startupers in to the 500 Institute.  After hand-picking a game development team for John Romero, Hong worked in Corp Dev for Gazillion Entertainment, resulting in the Lego Universe game and an upcoming Marvel MMO. Similar to his namesake, Hong rolls around in a vehicle of his own creation and is going bald working on <a href=\"http://www.outgrown.it/\" target=\"_blank\">Outgrown.it</a>.</i></em>\n\n<a href=\"http://500.co/2011/12/01/f-u-dave-mcclure-i-learned-it-by-watching-you/i-learned-torrents-by-watching-you/\" rel=\"attachment wp-att-1116719000\"><img class=\"size-large wp-image-1116719000 alignleft\" title=\"i-learned-torrents-by-watching-you\" src=\"/backup/i-learned-torrents-by-watching-you-1024x803-2011-12-01-11-17-18.png\" alt=\"\" width=\"475\" height=\"373\" /></a>\n\nOver the past year I’ve seen 67 startups in the accelerator program,  ~25 co-working at 444 Castro and another ~25 Clients for <a href=\"http://www.quantumstartups.com/\">Quantum Startups</a>. Here’s what I’ve learned:\n\n<strong>1) Dave makes starting a startup easier.</strong>\n\nI’m not going to rehash how it’s gotten cheaper to start now versus 10 years ago. I ain’t talking about how gender and race play into who gets funded or <a href=\"http://uncrunched.com/\">Uncrunched</a>. I won’t mention the proliferation of incubators, accelerators, hairy angel investors and startup weekends. But I will say that Dave is a one-man army making startups as egalitarian as possible, funding anyone and everyone from anywhere and everywhere. No longer do you think “nerd frat house” at a gathering of Founders, now it’s more like United Nations junior council at 500 Startups. Dave’s not practicing affirmative action or anything like that, but he’s as close as you get to a meritocracy in VC.\n\nNow everyone can play the game and no one has any excuses.\n\n<strong>2) Dave makes hiring for startups harder.</strong>\n\nThe biggest downside of point one is point two. You can’t hire anyone. You can call yourself a hustler until the cops come, but technical talent is still the demand-side. While the money flow is going to dry up (maybe soon) it’s still easier to raise money than to hire talent. Sean Parker calls it a “<a href=\"http://techcrunch.com/2011/11/15/sean-parker-little-startups-are-ridiculously-overfunded/\">diffusion of talent</a>” - too few Developers spread amongst too many startups. VCs on Sand Hill are (meta alert) staffing up their recruiting teams to recruit recruiters to join their portfolio companies! Any Engineer worth her GitHub account is starting a company. Why should they join your startup and take 1% when they can go on a 48-hour coding binge and call themselves a Founder? Forget the fact that the first 12-18 months till funding is the <strong>HARDEST</strong> part. It’s more fun to call yourself a CEO! I did this (<a href=\"http://www.prongmotors.com/\">again</a>) the first quarter of this year. I had a <a href=\"http://outgrown.it/\">decent idea</a>, had a team building it and even got some money committed. But then I quit. Why?\n\nBecause I’d rather be part of a winning team than be the captain of a sinking ship.\n\n<strong>3) Dave makes being a VC really hard.</strong>\n\nWhen planning out my second decade in Silicon Valley, I would earn a desk on Sand Hill Road in years 17-20. It seems like such a cushy job, talking to Founders all day, passing judgment on their foolhardy “visions” and cashing fat checks from the “2 and 20”. Turns out Dave is one hard working motherfather. I bet that no other VC puts in more hours than Dave, and the dude travels like a Lonely Planeteer on crack! I honestly couldn’t keep the same schedule. I also lack the knowledge and experience that Dave brings to bear when evaluating Founders. And I have to be on my best behavior when I hear some of these ridiculous “Entrepreneurs” pitching unimaginative copycat startups. No wonder the guy curses so much.\n\nGreat VCs work their butts off for Founders. Maybe I’ll stick to recruiting.\n\nI don’t mean to sound like Eminem professing his love for Dr. Dre on the Chronic. I’m trying to learn this game like everyone else. But looking back on this past year, in comparison to the decade before, why am I doing so much better?\n\nAll I can tell myself is this: <strong>It’s the people stupid. </strong>\n\nWork with amazing people. Surround yourself with the best people you can. You will become like them. Don’t hang out with wannabes and whiners. They will drag you down. Stop playing startup and build stuff people actually want. Make things of value. Build companies of consequence. Stop wasting time. Have fun!",
    "type": "post",
    "path": "/2011/12/01/f-u-dave-mcclure-i-learned-it-by-watching-you/"
}