{
    "title": "Fail Fast, Fail Often, And Fail By Design",
    "slug": "fail-fast-often-by-design",
    "date": "2011-02-24T05:54:37.000Z",
    "url": "http://blog.500startups.com/?p=1116715057",
    "uri": "http://500.co/2011/02/23/fail-fast-often-by-design/",
    "postId": "1116715057",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/02/bear-grylls-150x150.jpg",
        "http://500.co/wp-content/uploads/2011/02/TJ-150x150.png"
    ],
    "creator": "",
    "categories": [
        "bear-grylls",
        "entrepreneurs",
        "failure",
        "guest-posts",
        "mentors",
        "mentors",
        "startups",
        "tj-sassani",
        "zozi"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/02/bear-grylls.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116715058\" title=\"bear-grylls\" src=\"/backup/bear-grylls-150x150-2011-02-23-11-23-54.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2011/02/TJ.png\"><img class=\"alignnone size-thumbnail wp-image-1116715059\" title=\"TJ\" src=\"/backup/TJ-150x150-2011-02-23-11-23-54.png\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet Bear Grylls, aka 500 SuperMentor <a href=\"http://twitter.com/tjx\" target=\"_blank\">TJ Sassani</a>. TJ is the Founder and CEO of <a href=\"http://www.zozi.com\" target=\"_blank\">zozi</a>, a company rapidly becoming the go-to place for the coolest experiences and activities.  zozi aggregates thousands of merchants in the experience category and is striving to create the industry's first \"OpenTable-like\" platform.  Before that TJ was a Director and a member of the early founding team at Lux Research, a firm focused on nanotechnology and clean technology research and intelligence services.  He spent some time in the software space before that, and way back when got his entrepreneurial start by buying, selling and trading sports memorabilia at local flea markets in rural Pennsylvania at the tender age of twelve.  TJ loves start-ups, adventure, satisfying his obscure curiosities.... and sharks. And honey badgers.</em>\n\n<strong>Fail fast. Fail often. Fail by design. &lt;Repeat&gt;\n</strong>\nWriting about the concept of start-ups failing is certainly not novel, especially since the vast majority of them (and statistically speaking, yours, too) will go down in a giant ball of flames. I embarked on my entrepreneurial career at the age of twelve, when I started a sporting memorabilia business with my dad. After college - and a subsequent ten-year hiatus to serve my time with the corporate master (although I kept running side businesses along the way) - I jumped ship and got back to my roots full-time. In my recent years as an entrepreneur, nothing has been more pivotal (pardon the pun) to my very modest personal success and, in particular, our success at zozi than the massive (and oftentimes immensely embarrassing) failures along the way.\n\nRecently, I started thinking about the concept of failing a bit more – what’s missing from the cliché “you learn from your failures, not your successes”? Then it struck me (on a midnight run, where most of my publishable ideas come from). Talk to an entrepreneur about his or her life, and he’ll tell you about his successes, his failures and even about how important those failures were – but what he’ll almost never talk about is how to help other entrepreneurs design failure into their daily routine.\n\nI have found that far more important than failing and learning to cope with it is learning how to fail effectively. As the title suggests, you must fail fast, fail often and fail by design.\n\nThis post is not about helping you succeed at your idea – if I knew how to do that, I’d do it myself, as would everyone else. Instead, it’s about five concrete ways to help you to fail at your idea – with a particular focus on helping you to accelerate the process, because the companies that win the race, or at least that get on the podium, are almost always the ones who won the Nobel Prize for failing along the way.\n\nFive ways to help you fail as often as possible:\n\n<strong>1) Find and embrace your biggest critic.\n</strong>\nFollowing our first significant round of funding ($1MM), we were looking to add a bit to this round given the pending macro-economic doom, so we were pitching a very well respected VC for more funding, and we got the same type of skeptical responses and generalities from him that we had grown accustomed to - “you guys are interesting, but it’s not for us because of XYZ reasons.”\n\nI knew those reasons were not the “real” reasons (they never are) – so I later went back to meet with that same VC one-on-one, without our respective teams in the room.  I got about ten minutes into our newly-revised pitch (version #237 if you’re keeping score at home), and I saw the same glazed look on his face. So I stopped mid-pitch, closed my laptop, and said, “Hey dude, let’s forget about the pitch – instead, can you just tell me why I suck so badly, please?”\n\nHe was visibly shocked – but once he got over that, it worked. He got up on the whiteboard and started drawing out his secret mental map of what he needs to see to invest and - more importantly - how we had failed to live up to certain parts. He rated us across four main categories and a number of sub-categories. It was not all bad – we scored high in some categories, but knowing where I sucked was by far the most valuable thing I gained from that interaction.\n\n<strong>Take away: </strong>Find someone external to your company who is not an investor and have him be your biggest critic – if you trust him, and he’s smart and relevant to your company, put him on your board, too. Don’t choose your investors to be your biggest critic, because you can’t always be as vulnerable with them. Friends are probably too soft or don’t want to crush your hopes and dreams, and team members are probably too lost in the details to be objective (not unlike yourself). Find and love your biggest critic because when runway is measured in weeks, you need all the input you can get.\n\n<strong>2) Design everything to fail </strong>\n\nEveryone tests product features – that’s not new. What’s novel is the idea of testing every aspect of your company and intentionally trying to break as much S*#^ as possible.\n\nSomething good always comes from failing - no exceptions. In product, you learn what converts better; in marketing, you learn how to acquire customers better; in sales, you learn how to get a higher response rate on standard prospecting email templates or how to increase your team’s close ratio. Do all of these and more, and optimize through planned failures.\n\nI’ve personally gotten so addicted to testing new ideas and separating the good from the bad that I even started A/B testing my life. I cut out alcohol, sugar, coffee and dating. I wanted to isolate each variable and see how it impacted my sleep, mood, attitude, performance and overall health – testing is addictive.\n\n<strong>Take away: </strong>Design micro-fails to avoid macro-F$%&amp;-ups. Identify everything that you do that impacts your likelihood of success (processes, marketing, sales, product) and start setting up tests and designed failures for each, starting with the highest impact ones. By definition, if you test a lot of new ideas, a bunch will fail and you’ll be left with the winners. This is a lot of work, which leads me to the next point - delegation.\n\n<strong> 3) Delegate failing</strong>\n\nAs you start to grow your fledgling business, one of the hardest things to do is learning to just “let go.” You’ve been the CEO, CFO, COO, VP of everything, and likely the janitor for such a long period of time that it’s naturally going to be hard to entrust your “baby’s” welfare to others.\n\nWhen you ultimately have found an awesome team, you learn to start delegating all sorts of things one by one – but what about failing? You MUST learn to delegate failure as well (and without others fearing for their jobs).  My dev team has a pet name for me, it’s CBO, or Chief Breaking Officer – this is because I’m constantly try to break everything we do with respect to product, process, etc (and often succeed).  To do this, creating a culture where failure is celebrated (and more specifically the resulting data and lessons) is key.\n\n<strong>Take away</strong>: Assign each person on your team failure goals. Set goals for your company overall and for key managers, with a focus on always breaking convention and getting outside of the comfort zone. Have them set goals for their teams (if applicable) in the same way. This needs to be a top-down culture shift in your thinking. Encourage everyone to come up with ideas to test and run with – from that will come some wins, and many losses, but most importantly data that will refine your approach. Delegating this is a must - everyone in the company MUST do this on a tactical level. If you succeed at this, you won’t have a day that goes by without learning something new and making incremental progress – it’s essentially Kaizen, but for failing.\n\n<strong>4) LOVE your haters</strong>\n\nAdversity is a great motivator. The best thing that ever happened to me was getting “beat up” on a regular basis as a kid. What does that have to do with this post? Simple – for years I thought about those bullies, and all I wanted to do was, to put it bluntly, crush them in life. While your psychologist likely won’t endorse this as a healthy strategy, it can be a very effective tool for budding entrepreneurs.\n\nAs adults, we still get pushed around on a regular basis. Though it’s usually not physical bullying, we instead constantly suffer from rejection, doubt and subtle ridicule. Don’t just learn to “deal” with these put-downs, which is what conventional wisdom tells you to do. Rather, take strength from each one and use it to your advantage. In essence, turn hate, doubt and rejection into a powerful fuel to drive you to achieve great things.  Healthy?  Probably not.  Effective?  Definitely.\n\n<strong>Take away:</strong> Be strong and confident, yet open and flexible. When a partner goes with a competitor, an investor says “no,” or you miss a key hire – take away some lessons to improve, but also secretly turn that rejection into an internal motivator for yourself. To take it to the extreme, keep a list of all those you simply can’t wait to send your press release to once you sell your company for $100MM. If you believe it will happen that much that you actually keep a list, you just might be crazy enough to stick it out long enough to see it through to victory.\n\n<strong>5) Believe that you are psychic, and have the courage to make tough decisions</strong>\n\nFace it, most of what you are trying will fail anyway (insert photo here of “giant ball of flames”). Great, then at least that means you will be able to accurately predict what’s going to fail, right? Nope. It’s going to take trial and error, and error, and…..\n\nSomething you can do to impact your success (or failure) rate is to simply accelerate this process by learning to make tough decisions. We’ve all heard Dave’s “KILL a feature” rant. Very good advice – but what if you took it even further? Cut a partner, cut a vendor, say “no” to a pushy investor, or even cut a team member. So in other words, believe you’re psychic: if you think something (or someone) is destined to fail or cause you more harm than good, have the courage to do your absolute best Jack Kevorkian impression and the class to do it with professionalism and grace.\n\n<strong>Take away</strong>: Identify what’s not working and cut it – fast. I know it’s not a popular subject around the office to cut a partner that everyone worked so hard to secure, or worse yet, to cut Billy Bob from marketing – but guess what? That’s your job – to cut inefficiency and anything destined to fail.  Be sure to distinguish between “good failing” which is something that fails and you learn from and act upon and “bad failing”, which is something that’s failing over and over and you don’t have the courage to address.  Act decisively. You’ll certainly lose some friends along the way, but far fewer than if your entire company fails. If you can’t make tough decisions (frequently and quickly), you’re in the wrong business.\n\nTo sum it all up, you want to essentially take the worst-case scenario (your company failing) and break that into as many “micro-fails” as possible.  Then, you can mitigate the macro-fail by ensuring you are constantly testing each element of the process, isolating each variable and forcing yourself and your team to be honest with one another about what’s working, and what’s not.\n\nThe risk in focusing on micro-fails is that your team (or worse yet, your investors) could potentially perceive that you are all over the map and don’t have the slightest idea about what is working.  The strange irony is that they are, in some ways, correct.  But that’s the point!  You do not (nor does anyone) know precisely what will work, so it’s your job as the CEO to do two things.  First, question everything that your company is doing to find the true “secret sauce” and secondly, educate your team and investors about why you’re seemingly changing things so often – a good start is forwarding them this blog post.\n\nHopefully you found this post helpful.  If you have questions or want to chat, you can stalk me on twitter here @tjx.",
    "type": "post",
    "path": "/2011/02/23/fail-fast-often-by-design/"
}