{
    "title": "From the Netherlands to 500 Startups",
    "slug": "from-the-netherlands-to-500-startups",
    "date": "2011-11-05T04:32:40.000Z",
    "url": "http://500.co/?p=1116718815",
    "uri": "http://500.co/2011/11/04/from-the-netherlands-to-500-startups/",
    "postId": "1116718815",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/11/photo-e1320422226356-300x224.jpg"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "guest-posts",
        "musings",
        "startups",
        "uncategorized"
    ],
    "content": "<em><a href=\"http://500.co/2011/11/04/from-the-netherlands-to-500-startups/photo/\" rel=\"attachment wp-att-1116718816\"><img class=\"alignleft size-medium wp-image-1116718816\" title=\"photo\" src=\"/backup/photo-e1320422226356-300x224-2011-11-04-11-22-32.jpg\" alt=\"\" width=\"180\" height=\"134\" /></a>\n<em><i><a href=\"http://www.linkedin.com/in/khuramhussain19\">Khuram Hussain</a> is the co-founder of<a href=\"http://www.fileboard.com/\"> Fileboard</a>. Previously he co-founded Inbox2, email startup, technology in use by 60 million people. Khuram also held BD and product roles at companies such as Shell.</i></em>\n\nWe are a team of three from Europe. In 2008, we founded an email startup in the Netherlands, a country known for it’s liberal attitudes (as anybody who has been to Amsterdam would acknowledge).  But when it came to starting an Internet startup and raising initial funding it was exactly the opposite, totally conservative. We had “business angels” asking for more than 40% of the company for just a $60k investment. I am glad we never took that money.  We did end up in a startup incubator. The incubators don’t invest money over there. However you can get very small loans on reasonable terms from affiliated banks to get started.\n\nWe were determined not to give up a high stake of the company at such an early stage so we decided to bootstrap, where all three of us were doing some consulting work and working in evenings and weekends. As a side note, we have family and kids, which makes everything more challenging. In the first phase of our company, from 2008 until mid 2009, we really missed the kind of advice and mentorship you need in the beginning. There were several mistakes we made but most prominent was around applying the teachings of<a href=\"http://steveblank.com/\"> Steve Blank</a> and<a href=\"http://www.startuplessonslearned.com/2008/10/about-author.html\"> Eric Ries</a> around lean startup. In June 2009 we saw the magic of The Valley for the first time. At this point we still did not give serious thought to setting up something here. Despite having a working product with users, it was still not possible to raise angel money for similar reasons that I described earlier. Was this specific to our startup? No, all the entrepreneurs that we were talking to around us had similar experiences.  We created several products at Inbox2. We licensed the technology to a large social network in the US. We open sourced our desktop product.\n\nIn February 2011 we were invited to Inbox Love conference by <a href=\"http://goralnick.com/\">Jared Goralnick</a>. We met Jared at <a href=\"http://leweb.net/\">LeWeb</a> in 2008; he knew we were in the email space. At the pre-conference dinner we had the opportunity to mingle with all the folks in email &amp; messaging space. To our surprise most of the teams from the major platforms knew our product.\n\nAfter dinner we hung around because we wanted the opportunity to connect with<a href=\"http://500.co/mentor-profiles/dave-mcclure-2/\"> Dave McClure</a>. Everybody had gone home and he was in the meeting room on a call regarding some investment. I think he was surprised as well to see us hanging around at quarter past midnight. I expected the window of opportunity to be 5 minutes as it was quite late. But despite being it so late he sat down with us for over another hour. We had a pre-alpha prototype of a product based on some of our ideas. Within couple of minutes we had Dave thinking with us on product and monetization. I didn’t feel for a single moment that I was pitching an investor except for the beginning when he asked me a trick question. After that conversation my co-founder <a href=\"http://nl.linkedin.com/in/wsadiq\">Waseem</a>, and I both agreed that if ever we were going to get external funding then we would want Dave and 500 Startups in first. So for the next couple of months we worked hard to crank out our product, which has now evolved into Fileboard.\n\nWith Fileboard we are now part of the current batch of the 500 Startups Accelerator. As a small team of three I feel we have more than 500 mirrors around us since the kick-off of the program. You can constantly do a reality check on all aspects of your business with talking to experts in all kinds of areas. I have really enjoyed the design boot camp. When you hear design boot camp you probably think of your product UI. But overall that is a small part of the design boot camp. Essentially we learned the approaches you should be taking to cultivate design in your business. How you should create or organize every part of your company with the relevant stakeholders such as partners and customers in mind. The talks are great, each with specific focus. I really enjoyed the talk from <a href=\"http://continuations.com/\">Albert Wenger</a> from Union Square Ventures, and he gave great insights on creating “Native Revenue Models.”\n\nWe are looking forward to the rest of the program and are excited to build out our company in the next few months. It is a great atmosphere at 500 because of the diversity of founders from all parts of the world. I feel #500strong!",
    "type": "post",
    "path": "/2011/11/04/from-the-netherlands-to-500-startups/"
}