{
    "title": "Gangnam Style For Startups",
    "slug": "gangnam-style-for-startups",
    "date": "2012-11-15T07:04:14.000Z",
    "url": "http://500.co/?p=1116724223",
    "uri": "http://500.co/2012/11/15/gangnam-style-for-startups/",
    "postId": "1116724223",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/11/Photos-Google+1-250x233.jpg",
        "http://500.co/wp-content/uploads/2012/11/11-250x187.jpg",
        "http://500.co/wp-content/uploads/2012/11/21-240x250.png",
        "http://500.co/wp-content/uploads/2012/11/31-250x123.png",
        "http://500.co/wp-content/uploads/2012/11/icon2-1601.png"
    ],
    "creator": "",
    "categories": [
        "gangnam-style",
        "guest-posts",
        "korea",
        "startups",
        "tapastic",
        "webcomics",
        "webtoons"
    ],
    "content": "<em><a href=\"http://500.co/2012/11/15/gangnam-style-for-startups/photos-google-2/\" rel=\"attachment wp-att-1116724257\"><img class=\"alignnone  wp-image-1116724257\" src=\"http://500.co/wp-content/uploads/2012/11/Photos-Google+1-250x233.jpg\" alt=\"\" width=\"150\" height=\"140\" /></a></em>\n\n<em>Chang Kim is a 500 Startups founder/mentor. Currently Chang is the CEO of <a href=\"http://tapastic.com\" target=\"_blank\">Tapastic</a>, a new online platform for webcomics and visual stories. Prior, Chang was a product manager of Blogger at Google. He joined Google when TNC, a blogging software company he co-founded, was acquired in 2008. Prior to TNC, Chang developed mobile content strategy at Samsung. </em>\n\n<a href=\"http://500.co/2012/11/15/gangnam-style-for-startups/1-3/\" rel=\"attachment wp-att-1116724259\"><img class=\"alignnone size-thumbnail wp-image-1116724259\" src=\"/backup/11-250x187-2012-11-15-12-01-04.jpg\" alt=\"\" width=\"250\" height=\"187\" /></a>\n\nKorean pop singer PSY and <a href=\"http://www.youtube.com/watch?v=9bZkp7q19f0\" target=\"_blank\">Gangnam Style</a> have become a global phenomenon, boasting over 700M views on YouTube to date. You see Gangnam Style everywhere - on US radio stations, played at professional sporting events, on TV. Despite the craze, PSY is the only Korean music artist to go global so far. The vast majority stay local to Korea. It begs the question - why hasn’t the Gangnam Style craze opened the door to more <a href=\"http://en.wikipedia.org/wiki/K-pop\" target=\"_blank\">K-pop</a> hits going global, when there are plenty of other K-pop stars who arguably have much better global appeal than the chubby PSY?\n\nThis is the same question that entrepreneurs like myself, who are trying to bring a proven business model in Korea to the U.S. and the global market, ask themselves: <strong>What does it take to bring something big in one part of the world to another part of the world?</strong> How do you successfully overcome cultural differences?\n\n<strong>Webtoons: A Cultural Phenomena in Korea</strong>\n\nWebtoons are arguably one of the most popular internet and mobile services in Korea, the country that pioneered many new and interesting internet business models, including Q&amp;A services, internet telephony, virtual goods, and MMORPG. Although Webtoons are a relatively new service, more than 10 million people in Korea (approximately one-third of the nation’s total internet users) check out Webtoons every day. <a href=\"http://comic.naver.com/webtoon/weekday.nhn\" target=\"_blank\">Naver Webtoons</a> (contents in Korean), a popular Webtoons service in Korea, generates 1B pageviews per month - more than Facebook’s total monthly pageviews in Korea. The Webtoons mobile app is also one of the most popular of any category in Korea.\n\n<a href=\"http://500.co/2012/11/15/gangnam-style-for-startups/2-3/\" rel=\"attachment wp-att-1116724261\"><img class=\"alignnone size-thumbnail wp-image-1116724261\" src=\"/backup/21-240x250-2012-11-15-12-01-04.png\" alt=\"\" width=\"240\" height=\"250\" /></a>\n\nSo, what are Webtoons? It’s like YouTube for webcomics, where users can find hundreds of interesting webcomic series, or (if one is talented enough) start publishing his or her own series. Click <a href=\"http://comic.naver.com/webtoon/weekday.nhn\" target=\"_blank\">here</a> to see Naver Webtoons, the most popular Webtoons service in Korea.\n\nAt our company <a href=\"http://tapastic.com/\" target=\"_blank\">Tapastic</a>, we understand how Webtoons gained popularity in Korea and “export” it globally. The first and foremost reason - content is king. In the U.S., superheroes dominate comic story lines. In Korea, Webtoons feature various genres of webcomics that casual, mainstream users can easily relate to. Webtoons are more like casual social games, while superhero comics from Marvel and DC are like World of Warcraft. Webtoons span almost any “everyday” topic - school, work, <a href=\"http://cartoon.media.daum.net/webtoon/view/dieter\" target=\"_blank\">diet and exercise</a>, <a href=\"http://cartoon.media.daum.net/webtoon/view/tammyoin\" target=\"_blank\">pets</a>, <a href=\"http://comic.naver.com/webtoon/list.nhn?titleId=423376\" target=\"_blank\">travel</a>, <a href=\"http://comic.naver.com/webtoon/list.nhn?titleId=409630\" target=\"_blank\">recipe</a>, <a href=\"http://comic.naver.com/webtoon/detail.nhn?titleId=350217&amp;no=31&amp;weekday=tue\" target=\"_blank\">horror stories</a> - you name it. This variety exists because Webtoons provide an open platform for amateur artists and storytellers to publish their work and become overnight sensations (similar to YouTube celebrities).\n\n<strong>How to Bring a Successful Business Model from One Market to Another</strong>\n\nWebtoons are obviously very popular in Korea, but that’s just one small part of the world. So how do you overcome cultural differences and bring a business model that’s proven only in Korea to the U.S. market and beyond? We’d like to share our strategy below. We hope it might be helpful to others who are interested in taking a similar, cross-border approach with their companies.\n\n<strong>1. Tools, not content (or anything too culturally dependent)</strong>\n\n<a href=\"http://500.co/2012/11/15/gangnam-style-for-startups/3-2/\" rel=\"attachment wp-att-1116724263\"><img class=\"alignnone size-thumbnail wp-image-1116724263\" src=\"/backup/31-250x123-2012-11-15-12-01-04.png\" alt=\"\" width=\"250\" height=\"123\" /></a>\n\nWhen <a href=\"http://us.cyworld.com/\" target=\"_blank\">CyWorld</a>, a Korean social networking service, launched in the U.S., they decided to keep their “cute” identity defined by things like 8-bit avatars and “mini rooms”. But the average U.S. internet user found those to be too cutesy and even “childish”. Even in this hyper connected world, cultural differences still exist. When it comes to bringing a business model from one market to another, it’s always a better approach to bring the “tools”, which usually are independent of any particular culture. Skype is a good example; whether you’re in Brazil or Bahrain, Skype is a useful tool. The product functions the same, regardless of what country a user is in. Even if a product is not purely a tool, services like <a href=\"http://spotify.com\" target=\"_blank\">Spotify</a> can present a “global” service, yet distribute “local” content through the service. This is our approach - we bring the tool (originated in Korea), but populate the service with local-flavored content from talented local artists.\n\n<strong>2. Build a local team and let them run the show</strong>\n\nIt’s critical to build a talented local team and have them become the first believers in your business model. Check your ego at the door, be humble and listen to your local team’s feedback. But at the same time, make sure the team correctly understands and sees the inherent value that made the business model successful in a specific market. Unless the local team is excited and motivated and sees the potential of the business, you can’t expect them to endure the challenging startup journey and work their butts off to make the idea work. As they say, a startup is only 1% idea and 99% execution. When it comes to execution, the local team will do the lion’s share of the work.\n\n<strong>3. Lead the way with a minimum viable product (MVP) and get early feedback from the local audience</strong>\n\nThe purpose of building a <a href=\"http://en.wikipedia.org/wiki/Minimum_viable_product\" target=\"_blank\">MVP</a> is to put something out there and get user feedback quickly and early. For startups that are exploiting cross-border opportunities, it’s even more important because you never know if your product has any potential in the local market and you don’t want to waste too much money and time until you do that initial validation. That’s the approach we took as well - we built the MVP first. Within three months, we gathered tons of valuable feedback from early users. Based on the feedback, we pivoted and <a href=\"http://blog.tapastic.com/introducing-our-new-brand/\" target=\"_blank\">re-launched</a> the product’s second version (which we like even better) in the span of three months.\n\n<a href=\"http://500.co/2012/11/15/gangnam-style-for-startups/icon2-160-2/\" rel=\"attachment wp-att-1116724265\"><img class=\"alignnone size-full wp-image-1116724265\" src=\"/backup/icon2-1601-2012-11-15-12-01-04.png\" alt=\"\" width=\"160\" height=\"160\" /></a>\n\nIn conclusion, that is our three-pronged strategy to bring Korean Webtoons to the U.S. market. Whether our strategy is right still remains to be seen. This is what we have to figure out in the months and years to come - and we’re excited for the journey!",
    "type": "post",
    "path": "/2012/11/15/gangnam-style-for-startups/"
}