{
    "title": "Geeks On a Plane Lands in Colombia and Speaks with .CO Founder Juan Diego Calle",
    "slug": "geeks-on-a-plane-lands-in-colombia-and-speaks-with-co-founder-juan-diego-calle",
    "date": "2013-10-24T20:24:49.000Z",
    "url": "http://500.co/?p=1116730033",
    "uri": "http://500.co/2013/10/24/geeks-on-a-plane-lands-in-colombia-and-speaks-with-co-founder-juan-diego-calle/",
    "postId": "1116730033",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/10/hub.png",
        "http://500.co/wp-content/uploads/2013/10/voicebunny.png",
        "http://500.co/wp-content/uploads/2013/10/laspartes.jpg",
        "http://500.co/wp-content/uploads/2013/10/tappssi.png",
        "http://500.co/wp-content/uploads/2013/10/brainzgames.png",
        "http://500.co/wp-content/uploads/2013/10/juancalle.jpeg"
    ],
    "creator": "",
    "categories": [
        "co",
        "brainz",
        "colombia",
        "dotco",
        "events",
        "hubbog",
        "juan-diego-calle",
        "laspartes",
        "latam",
        "tappsi",
        "voice-bunny"
    ],
    "content": "<p dir=\"ltr\">Often referred to as the “United Nations of Startups,”<a href=\"http://www.geeksonaplane.com\"> GeeksOnaPlane</a> bridges the gap between Silicon Valley &amp; thousands of developers, investors, and executives in emerging technology markets. During our recent Latin America tour, we got an insider’s view of the exploding opportunities in Mexico, Colombia, and Brazil by visiting high-growth startups, attending conferences &amp; networking events, and meeting with government officials &amp; industry leaders.</p>\n<p dir=\"ltr\">Below is an overview of the key players in the region, as well as an interview from Juan Diego Calle. A Colombian &amp; U.S. entrepreneur, Juan is the CEO &amp; Founder of .CO (as in, 500.co) and has a very experienced POV on innovation and investing in Colombia.</p>\n<p dir=\"ltr\">MEET COLOMBIA’S KEY PLAYERS...</p>\n<p dir=\"ltr\">An initiative launched by Colombia’s Ministry of Information Technologies and Communications (<a href=\"http://www.mintic.gov.co/\">MinTIC</a>), Apps.co promotes innovation through digital entrepreneurship (in particular, mobile application, software and content development). Special thanks to<a href=\"http://www.apps.co\"> APPS.CO</a>, our Country Host in Colombia, who made the tour possible. They also hooked us in to key players in Colombia including these 4 hot companies to know….</p>\n<p dir=\"ltr\"><a href=\"/backup/hub-2013-10-24-13-15-24.png\"><img class=\"aligncenter size-full wp-image-1116730043\" alt=\"hub\" src=\"/backup/hub-2013-10-24-13-15-24.png\" width=\"198\" height=\"78\" /></a></p>\n<p dir=\"ltr\"><a href=\"http://hubbog.com/\">HubBOG</a> is the first and largest campus for startups in Latin America. HubBOG offers acceleration, tech classes, coworking space, and investment for startups. In addition to organizing meetups &amp; networking events, HubBOG also has 20+ courses and workshops focused on management and technology.</p>\n<p dir=\"ltr\"><a href=\"/backup/voicebunny-2013-10-24-13-15-24.png\"><img class=\"aligncenter size-full wp-image-1116730041\" alt=\"voicebunny\" src=\"/backup/voicebunny-2013-10-24-13-15-24.png\" width=\"260\" height=\"70\" /></a></p>\n<p dir=\"ltr\"><a href=\"http://voicebunny.com/\">Voice Bunny</a> delivers human, professional voice overs on-demand from a crowd of thousands of voice actors working from home studios. They’ve drastically simplified, and made affordable, the process of getting a professionally voiced recording. They are used for everything from video games to radio &amp; TV commercials, etc.</p>\n<p dir=\"ltr\"><a href=\"/backup/laspartes-2013-10-24-13-15-24.jpg\"><img class=\"aligncenter size-full wp-image-1116730039\" alt=\"laspartes\" src=\"/backup/laspartes-2013-10-24-13-15-24.jpg\" width=\"163\" height=\"103\" /></a></p>\n<p dir=\"ltr\"><a href=\"http://www.laspartes.com/\">Laspartes</a> an online platform that helps car owners in Colombia service and fix their cars in a simple way. Laspartes.com has created a network of +100 certified car workshops and autopart makers that guarantees adequate service and autoparts.</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"/backup/tappssi-2013-10-24-13-15-24.png\"><img class=\"aligncenter  wp-image-1116730037\" alt=\"tappssi\" src=\"/backup/tappssi-2013-10-24-13-15-24.png\" width=\"235\" height=\"233\" /></a></p>\n<p dir=\"ltr\"><a href=\"http://tappsi.co/\">Tappsi</a> the Uber of Colombia, Tappsi makes safe and reliable taxis readily available.</p>\n<p dir=\"ltr\"><a href=\"/backup/brainzgames-2013-10-24-13-15-24.png\"><img class=\"aligncenter size-full wp-image-1116730035\" alt=\"brainzgames\" src=\"/backup/brainzgames-2013-10-24-13-15-24.png\" width=\"243\" height=\"83\" /></a></p>\n<p dir=\"ltr\"><a href=\"http://brainz.co/\">Brainz</a> is backed by $2.1M in VC funding and is one of the most recognized studios in Latin America for creating next-gen entertainment company focused on making high quality games featuring unique story worlds with rich narratives and characters.</p>\n<p dir=\"ltr\"><a href=\"/backup/juancalle-2013-10-24-13-15-24.jpeg\"><img class=\"aligncenter size-full wp-image-1116730047\" alt=\"juancalle\" src=\"/backup/juancalle-2013-10-24-13-15-24.jpeg\" width=\"600\" height=\"429\" /></a></p>\n<p dir=\"ltr\"><strong>Our Favorite .CO-lombian – Colombian Entrepreneurship with Juan Diego Calle</strong></p>\n<p dir=\"ltr\">Juan Diego Calle, CEO &amp; Founder of .CO, is a true Colombian success story. In less than 3 years, .CO has established itself worldwide as the web address for innovators and entrepreneurs worldwide, with more than 1.5 million domains registered in 200 plus countries. And they know how to throw a party like no one else. Here’s what he has to say on the startup ecosystem in Colombia:</p>\n<p dir=\"ltr\"><strong>What is the state of Colombia's startup ecosystem?</strong></p>\n<p dir=\"ltr\">Juan: The Colombian startup ecosystem is developing quickly, aided in great part by both public and private initiatives that focus on innovation and digital entrepreneurship. In the past couple of years there has been a surge of accelerators, incubators, co-working spaces, and events promoting and fostering entrepreneurship. Through these programs, Colombia has really rebranded itself as a hub for tech innovation—just this year, Medellin was named Startup City of the Year by the Wall Street Journal. In contrast to that of many developing startup ecosystems, in Colombia, the education system is very good and has bred a talented pool of young designers, programmers, and engineers. As we all know, talent can be difficult to find and is a key contributor to the growth of any business, especially one at a very early stage.</p>\n<p dir=\"ltr\"><strong>How is the government helping (or not helping) foster the startup ecosystem?</strong></p>\n<p dir=\"ltr\">Juan: Colombia’s Ministry of ICT (MinTIC) under the stewardship of Minister Diego Molano has taken a leading role in fueling the growth of the startup ecosystem and promoting innovation and digital impact entrepreneurship through notable programs such as ViveDigital and sister programs such as Apps.co, among others.   These programs are designed to improve infrastructure and digital literacy in the country, and to provide entrepreneurs with guidance and mentorship --some programs even provide grants to help startups get off the ground.</p>\n<p dir=\"ltr\"><strong>What are the challenges that startups and investors face in Colombia?</strong></p>\n<p dir=\"ltr\">Juan: While Colombia is definitely on the right track, the ecosystem is still young, especially when compared to the more mature ecosystems of its peers, namely Chile and Brazil. As a result, investors are likely to look first at these neighboring economies before considering Colombia. From the investor standpoint, the startups in Colombia are still new and haven’t achieved the level of traction that those in other markets have.</p>\n<p dir=\"ltr\"><strong>Why should investors be interested in Colombia?</strong></p>\n<p dir=\"ltr\">Juan: A number of reasons:  First, Colombia is privileged by its geographic location relative to other LATAM markets.  It's a central hub for any tech company doing business throughout the region.  Second, Colombia's institutions are some of the strongest in the region and respect for contract law is solid.  Third, we have a well-educated, talented population.</p>\n<p dir=\"ltr\">We look forward to seeing more innovation from Colombia, and we hope to continue visiting the region with #GOAP.</p>",
    "type": "post",
    "path": "/2013/10/24/geeks-on-a-plane-lands-in-colombia-and-speaks-with-co-founder-juan-diego-calle/",
    "backgroundImage": "/backup/bogota-960x540-2013-10-24-13-15-24.jpg"
}