{
    "title": "General Solicitation 101: What Your Startup Needs to Know",
    "slug": "general-solicitation-101-what-your-startup-needs-to-know",
    "date": "2013-10-03T18:44:04.000Z",
    "url": "http://500.co/?p=1116729863",
    "uri": "http://500.co/2013/10/03/general-solicitation-101-what-your-startup-needs-to-know/",
    "postId": "1116729863",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/10/greg-300x300.png"
    ],
    "creator": "",
    "categories": [
        "fundraising",
        "general-solicitation",
        "jobs-act",
        "law",
        "legal",
        "startups",
        "tips",
        "venture-capital"
    ],
    "content": "<p dir=\"ltr\"><em> The following post was contributed by <a href=\"http://twitter.com/gregraiten\">Greg Raiten</a>, general counsel and sheriff at 500 Startups. He may be a lawyer, but he’s one of the good ones.</em></p>\n<p dir=\"ltr\" style=\"text-align: left;\"><strong><a href=\"http://500.co/wp-content/uploads/2013/10/greg.png\"><img class=\"size-medium wp-image-1116729869 aligncenter\" alt=\"greg\" src=\"/backup/greg-300x300-2013-10-03-13-13-44.png\" width=\"300\" height=\"300\" /></a>DISCLAIMER: I AM NOT YOUR ATTORNEY (OR YOUR SHERIFF) AND AM NOT PROVIDING LEGAL ADVICE, SO I STRONGLY ENCOURAGE YOU TO CONSULT WITH YOUR ATTORNEY BEFORE MAKING ANY DECISIONS ABOUT FUNDRAISING.</strong></p>\n<p dir=\"ltr\"><strong>TL;DR Version</strong></p>\n\n<ol>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">As of September 23, 2013, you can promote your fundraising publicly IF you comply with the new rules adopted by the SEC.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">The new rules require you to verity the accredited status of all purchasers of your securities, among other things.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">If you fundraise publicly, it may affect past and future fundraising activities as well.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Once you start talking publicly about your financing, you can’t go back - so make an educated decision (with your attorney’s advice) before making any public statements!</p>\n</li>\n</ol>\n<p dir=\"ltr\">This is legal stuff we’re talking about, so of course it’s more complicated than just that. Here’s a very detailed breakdown of everything you should know:</p>\n<p dir=\"ltr\">The general solicitation rules issued by the SEC went into effect on September 23, 2013 and now make it possible for startups to publicly fundraise. While these changes provide an exciting opportunity for many startups, there are a number of nuances and pitfalls that may not be immediately apparent. Given the lack of adequate information in the market, we decided to write this blog post to highlight some of the things we think startups should consider.</p>\n<p dir=\"ltr\"><span style=\"text-decoration: underline;\"><strong>So… What is a “General Solicitation”?</strong></span></p>\n<p dir=\"ltr\">Like many things in the law, that is a question without an easy answer.  On a basic level, a general solicitation entails a “public” advertisement or promotion (including, for example, a newspaper ad, commercial, billboard, internet post, etc.) of the opportunity to purchase securities of your company. Even the word “public” is complicated, but the SEC has generally found that a statement to someone with whom you do not have a “substantial pre-existing relationship” is a public statement.</p>\n<p dir=\"ltr\">On a more nuanced level, the SEC has found that certain statements made by a company to the press during a period of fundraising can be a general solicitation if such statements relate directly or indirectly to fundraising efforts. To add to that, a company may even be deemed to have generally solicited if a third party makes public statements about the company’s current fundraising activities. This could include a press outlet publishing an article about your ongoing financing.</p>\n<p dir=\"ltr\">Until the adoption of <a href=\"http://www.ecfr.gov/cgi-bin/text-idx?c=ecfr&amp;SID=ac8b6c96362ad973ae052f2c7dcd3443&amp;rgn=div8&amp;view=text&amp;node=17:2.0.1.1.12.0.46.181&amp;idno=17\">Rule 506(c)</a> of Regulation D (the \"New Rules\"), general solicitations were prohibited unless you registered the offering with the SEC. Therefore, unless your company wanted to go public in an IPO, you had to comply with the private placement exemptions, which prohibited general solicitations.</p>\n<p dir=\"ltr\"><span style=\"text-decoration: underline;\"><strong>What are these New General Solicitation Rules?</strong></span></p>\n<p dir=\"ltr\"> Under the New Rules, a company may now generally solicit as long as it complies with certain requirements, including:</p>\n\n<ol>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">All investors must be<a href=\"http://www.ecfr.gov/cgi-bin/text-idx?c=ecfr&amp;SID=ac8b6c96362ad973ae052f2c7dcd3443&amp;rgn=div8&amp;view=text&amp;node=17:2.0.1.1.12.0.46.176&amp;idno=17\"> accredited investors</a> (or the company must have a reasonable belief that they are accredited investors);</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">The company must take “reasonable steps” to verify that each investor is accredited;</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">The company must file a<a href=\"http://www.sec.gov/about/forms/formd.pdf\"> Form D</a> with the SEC and check the “Rule 506(c)” box within 15 days after the first sale of securities; and</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">There may not be any “bad actors” affiliated with the company or participating in the financing.</p>\n</li>\n</ol>\n<p dir=\"ltr\">In addition to the New Rules that were adopted, the SEC has proposed rules that would place additional restrictions on public financings, but it’s not clear if or when those rules will be adopted. Therefore, we won’t cover those proposed rules in this blog post.</p>\n<p dir=\"ltr\"><span style=\"text-decoration: underline;\"><strong>Let’s Break These New Rules Down</strong></span></p>\n<p dir=\"ltr\">So while you may now have the urge to <a href=\"http://www.youtube.com/watch?v=AutCYC3dH-E\">run naked down the streets</a> announcing your fundraising, the New Rules add a level of complexity that you cannot afford to ignore.  Let’s cover each rule separately.</p>\n<p dir=\"ltr\"><strong>Accredited Investors</strong></p>\n<p dir=\"ltr\">As of today, the definition of an “accredited investor,\" as set forth in<a href=\"http://www.ecfr.gov/cgi-bin/text-idx?c=ecfr&amp;SID=ac8b6c96362ad973ae052f2c7dcd3443&amp;rgn=div8&amp;view=text&amp;node=17:2.0.1.1.12.0.46.176&amp;idno=17\"> Rule 501(a)</a> of Regulation D, has not changed. Take a look at the rule for a list of what it means to be “accredited.”</p>\n<p dir=\"ltr\"><strong>“Reasonable Steps” to Verify</strong></p>\n<p dir=\"ltr\">This is the most significant change to the rules. If you fundraise publicly, then you must take “reasonable steps” to verify that ALL investors you sell to are accredited. The SEC has not specified what constitutes reasonable steps to verify, but it has provided some guidance:</p>\n\n<ol>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">You must take reasonable steps to verify the accredited status of EACH investor BEFORE they may invest in your company.  If you fail to take reasonable steps to verify the status of an investor, then you will lose the exemption from registration, and the mere fact that the investor later turns out to be accredited will NOT fulfill this requirement.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Having an investor fill out an investor questionnaire is generally NOT enough to constitute reasonable steps.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">For investors who are natural persons, reviewing recent financial records (for example, tax returns, bank statements, credit reports, etc.) and getting certifications from the investor about future income or full disclosure of liabilities is sufficient to constitute reasonable steps (see<a href=\"http://www.ecfr.gov/cgi-bin/text-idx?c=ecfr&amp;SID=ac8b6c96362ad973ae052f2c7dcd3443&amp;rgn=div8&amp;view=text&amp;node=17:2.0.1.1.12.0.46.181&amp;idno=17\"> Rule 506(c)</a> for more details).</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">You may rely on certain third parties, including registered broker-dealers or licensed attorneys or CPAs, to certify to you in writing that they have taken reasonable steps to verify the accredited status of an investor. If you do so, it is still YOUR responsibility to verify that the broker-dealer, attorney or CPA is registered or licensed and in good standing in the jurisdiction where they practice.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">The reasonableness of the steps you take to verify the status of an investor will depend on (a) the nature of the investor (e.g., person or entity), (b) the amount and type of information known about the investor (e.g., whether there is public information about income or net worth), and (c) the nature and terms of the offering (e.g., how investors were solicited or if there are minimum investment thresholds).</p>\n</li>\n</ol>\n<p dir=\"ltr\">Platforms <a href=\"http://secondmarket.com\">such as SecondMarket</a>, which is a broker-dealer, will verify investors for you and provide you with a written certification of the investor's accredited status.  Other platforms such as <a href=\"http://angel.co\">AngelList</a>, which is not a broker-dealer, will assist you in verifying the status of your investors by helping you collect the financial information necessary for you to make the determination on your own. Regardless of the steps you take, you should keep complete and accurate records documenting them. The burden is on YOU to prove that you have complied with the New Rules.</p>\n<p dir=\"ltr\"><strong>Filing a Form D</strong></p>\n<p dir=\"ltr\">The New Rules provide the sole exemption from registration that is available for companies who choose to talk publicly about fundraising. In order to take advantage of the exemption, however, your company must file a<a href=\"http://www.sec.gov/about/forms/formd.pdf\"> Form D</a> with the SEC within 15 days after the first sale of securities in the financing, and you must check the \"Rule 506(c)\" box. The 15-day deadline is not flexible, so if you miss it you may have blown your exemption. This is a notable change from fundraising under the traditional private placement regime, which permits exemptions from registration that do not require a Form D filing (e.g., Section 4(2) of the Securities Act).</p>\n<p dir=\"ltr\"><strong>Bad Actors</strong></p>\n<p dir=\"ltr\">When the SEC issued the New Rules they also issued<a href=\"http://www.ecfr.gov/cgi-bin/text-idx?c=ecfr&amp;SID=ac8b6c96362ad973ae052f2c7dcd3443&amp;rgn=div8&amp;view=text&amp;node=17:2.0.1.1.12.0.46.181&amp;idno=17\"> Rule 506(d)</a> of Regulation D (generally referred to as the \"bad actor\" rule) which applies to ALL financings (not just public financings) that occur pursuant to Rule 506 on or after September 23, 2013. The rule itself is quite broad in scope and is also a bit vague, but what is clear is that you cannot rely on Rule 506 as an exemption from registration if your company or certain persons or entities affiliated with your company have committed “bad acts.” The list of covered persons/entities and bad acts is extensive, so you will be required to conduct due diligence in this area prior to relying on Rule 506 for your financing.</p>\n<p dir=\"ltr\"><span style=\"text-decoration: underline;\"><strong>Other Considerations</strong></span></p>\n<p dir=\"ltr\">Now that we’ve stepped through the New Rules, let’s talk about some of the implications of the rules that may not be immediately apparent.</p>\n<p dir=\"ltr\"><strong>Concurrent Financings and Integration of Successive Financings</strong></p>\n<p dir=\"ltr\">If you conduct multiple financings at or around the same time (for example, two convertible note financings with different conversion caps a few months apart) and if you decide to advertise one of them publicly, then it is likely you will have to comply with the New Rules for both financings.  We say “likely” because we don't know for sure--the new rules do not explicitly discuss this situation, but most legal experts agree that it is the correct interpretation.</p>\n<p dir=\"ltr\">Furthermore, if you sell any securities in the six-month period before or after a financing in which you fundraise publicly, then those sales may be “integrated” with each other (i.e., they may be treated as the same financing for SEC purposes), in which case you will need to comply with the New Rules for both financings. Therefore, if you are currently raising a round and are doing “rolling closes” under the traditional private placement regime, then keep in mind that any closings you have on or after September 23, 2013, may be integrated with any public financing you conduct now or in the future.</p>\n<p dir=\"ltr\"><strong>The States and Foreign Countries</strong></p>\n<p dir=\"ltr\">When you sell securities in the United States, you have to comply with both (1) federal law, and (2) the laws of each state in which you sell securities (often known as “blue sky” laws). The New Rules only affect US federal law. Certain states have been complaining about the New Rules and have indicated that they may enact stricter state laws relating to public financings, so it remains to be seen what will happen on that front. Therefore, depending on where your investors reside, you may need to comply with stricter state laws.</p>\n<p dir=\"ltr\">Additionally, if you sell securities to an investor in a foreign country, you still need to comply with the local laws of that country. Most foreign countries do not allow for public fundraising at this time, so if you generally solicit over the Internet, and it is seen by an investor in a foreign country who chooses to invest in your company, then you may be in violation of that country's laws. As with the states, it remains to be seen how foreign countries will deal with this new US regime.  Therefore, if you are soliciting investors from a foreign country, you should check with local counsel in that country on what is and is not permitted.</p>\n<p dir=\"ltr\"><strong>Anti-Fraud Rules</strong></p>\n<p dir=\"ltr\">The New Rules do NOT narrow the scope of pre-existing anti-fraud rules. Regardless of whether you choose to engage in public or private fundraising, you must be careful about the content of your marketing communications to ensure that they are not “misleading” (as the securities law defines such term). Keep in mind that whether something is misleading depends on the level of sophistication of your particular investors, and by fundraising publicly, you will be marketing to a much broader base of investors who may be less sophisticated than the ones you are used to dealing with.</p>\n<p dir=\"ltr\"><strong>Rescission Right</strong></p>\n<p dir=\"ltr\">If you lose your exemption from registration (by, for example, failing to file a Form D by the deadline or failing to verify the status of all of your investors), your company may have certain liability to your investors.  Most notably, your investors may have a right of rescission, which means that they will be able to demand repayment of their investment. If that happens, your company may be unable to raise additional funds or your investors could force it into bankruptcy.  Your company may also face fines and penalties, amongst other consequences.</p>\n<p dir=\"ltr\"><span style=\"text-decoration: underline;\"><strong>Conclusion / 500 Startups’ Position</strong></span></p>\n<p dir=\"ltr\">The New Rules are a recent development that changes a decades-old practice. The implications of this change have yet to be fully understood by the industry, and a lot of uncertainty remains about how the New Rules will be enforced by the SEC, the states, and foreign countries.</p>\n<p dir=\"ltr\">If you are thinking about fundraising publicly, we at 500 Startups <strong>STRONGLY ENCOURAGE YOU TO SPEAK WITH YOUR ATTORNEY BEFORE</strong> making a final decision so that you understand the implications and the steps necessary to comply with the rules.</p>\n<p dir=\"ltr\">Keep in mind that the traditional private placement regime is still an option. But if you choose to fundraise publicly, and you go about it in the right way, then kudos to you! We are happy to support you and we will be here as a resource should you need us.  Given the uncertainty around the new rules at this time, however, 500 Startups will NOT be able to publicly promote your fundraising (whether via Twitter, Facebook or otherwise). If our position on this topic changes in the future, then we’ll be sure to let you know.</p>",
    "type": "post",
    "path": "/2013/10/03/general-solicitation-101-what-your-startup-needs-to-know/",
    "backgroundImage": "/backup/money-960x540-2013-10-03-13-13-44.jpg"
}