{
    "title": "Distribution Tuesday: Two Quick Ways to Get More Conversions with Retargeting",
    "slug": "get-more-conversions-with-retargeting-two-quick-ways-to-start",
    "date": "2013-06-18T16:00:54.000Z",
    "url": "http://500.co/?p=1116727947",
    "uri": "http://500.co/2013/06/18/get-more-conversions-with-retargeting-two-quick-ways-to-start/",
    "postId": "1116727947",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/06/sean-quote1.jpg",
        "http://500.co/wp-content/uploads/2013/06/6-15-2013-4-03-07-PM1.png",
        "http://500.co/wp-content/uploads/2013/06/6-17-2013-12-32-44-PM.png"
    ],
    "creator": "",
    "categories": [
        "ads",
        "distribution",
        "distribution-tuesday",
        "online-marketing",
        "retargeting"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em>\n\nRetargeting advertisements online has been around for a while, but it’s just starting to get interesting—thanks in part to new services and the continued evolution of Facebook’s advertiser products. Shit just got real for startups that want to use this marketing channel.\n\n<img class=\"alignright size-full wp-image-1116727969\" alt=\"“On average, 98% of web visitors don’t convert during their first visit.”\" src=\"/backup/sean-quote1-2013-06-18-13-11-00.jpg\" width=\"200\" height=\"184\" align=\"right\" />If you’re not familiar with retargeting, it's when you visit a website and are later served extremely targeted ads by that same website. When you see an ad that's so well-tailored to you that it’s spooky, congrats, you’ve been retargeted. When it feels like a brand is following you all over web, that’s also retargeting. When you hear clicks on the phone–sorry, wait, never mind—I’m being told that’s just the NSA.\n\nIt may feel a little creepy, but you work hard to get those visitors to your website; sadly, it doesn’t always work out the first time. Sometimes you need to bring them back a few times before they’re ready to commit, and  this is especially the case when you’re an early-stage startup developing brand recognition. It takes time to build trust. Since the one thing you have <em>isn't</em> time, you need really good marketing.\n\nThat’s where retargeting comes in. Lucky for you, it’s now incredibly simple to get started and more powerful than ever. On average, 98% of web visitors don’t convert during their first visit. Here are two quick ways to bring them back with retargeting ads on the web and Facebook.\n<h2>Using AdRoll</h2>\nThe first way to easily roll out retargeting ads is to use <a href=\"http://adroll.com\" target=\"_blank\">AdRoll</a>. I recommend this company to most early-stage startups looking to get their feet wet with retargeting. It’s great for budgets of $100 per month or $10,000 per month, and AdRoll makes everything drop-dead simple. Finally, its staff is extremely helpful should you ever need a little push in the right direction.\n\nTo get started, create an account on AdRoll and add its tracking pixel to your website. This will allow you to start building your audience list for retargeting both on the web and Facebook. This type of Facebook retargeting (called Facebook Exchange) has only recently become available to the public. It’s incredibly powerful, simple to manage and allows your retargeting ads to appear in the right rail or newsfeed of Facebook.\n\n<img alt=\"AdRoll\" src=\"/backup/6-15-2013-4-03-07-PM1-2013-06-18-13-11-00.png\" width=\"404\" height=\"210\" />\n<em>AdRoll uses their own platform to retarget their customers. Meta alert!</em>\n\nDuring setup, you may want to also consider setting up audience segments. You can also segment your audience to track different site actions or exclude users from ads, for example, when a conversion or sale takes place. The segmentation can make a big impact on your ad campaign performance, so it’s worth putting some time behind it and gaining a better understanding.\n\nFor the campaigns themselves, you’ll need standard IAB unit (300x250, 160x600 and 728x90) banner ads for the web and for Facebook, images that are 100x72. Just like with any banner- based campaign, you want to try several iterations of designs to determine what performs best.\n\nIn addition to AdRoll, I also recommend checking out <a href=\"http://www.steelhouse.com/\" target=\"_blank\">SteelHouse</a>, <a href=\"http://retargeter.com/\" target=\"_blank\">Retargeter</a> and <a href=\"https://www.perfectaudience.com/\" target=\"_blank\">Perfect Audience</a>. Good luck and happy retargeting.\n\n<strong>Additional Reading:</strong>\n<ul>\n\t<li><span style=\"line-height: 13px\"><strong><a href=\"https://www.adroll.com/retargeting\">How Retargeting Works</a></strong> - AdRoll</span></li>\n\t<li><strong><a href=\"http://searchengineland.com/what-is-retargeting-160407\">What Exactly Is Meant by “Retargeting”?</a></strong> - Search Engine Land</li>\n\t<li><strong><a href=\"http://moz.com/blog/comparing-the-top-4-retargeting-companies\">Comparing the Top 4 Retargeting Companies</a> </strong>- Moz</li>\n</ul>\n<h2>Using Custom Audiences on Facebook</h2>\n<p style=\"text-align: left\">Next is a feature on Facebook that can dramatically improve the performance of  your ad campaigns. Using the Custom Audience feature of the Facebook Power Tool editor, you can easily create custom audiences based on your existing user data. You do this by uploading an export of your user’s email addresses, Facebook Ids, or phone numbers. You can target those users with a high level of precision and if done right, much higher performance than standard ad targeting.</p>\n<img alt=\"6-17-2013 12-32-44 PM\" src=\"/backup/6-17-2013-12-32-44-PM-2013-06-18-13-11-00.png\" width=\"331\" height=\"289\" />\n<em id=\"__mceDel\"><em>The incredibly powerful upload tool for creating customer audiences on Facebook.</em></em>\n<p style=\"text-align: left\"><strong>To get started:</strong></p>\n\n<ol>\n\t<li>Add the <a href=\"https://chrome.google.com/webstore/detail/facebook-power-editor/djicncbfodbeijpfpjjojkfhgbpjnlih?hl=en\">Facebook Power Tool Editor</a> extension for Chrome.</li>\n\t<li>Fire it up and select “Audiences” from the left navigation.</li>\n\t<li>Select “Create Audience” and then “Custom Audience.”</li>\n\t<li>Upload your data (CSV format with one entry per line).</li>\n\t<li>Pat yourself on the back; you just created a custom audience!</li>\n\t<li>When creating your next ad campaigns, plug in the list you just created under Audience&gt;Advanced Options&gt;Custom Audiences in the same Power Editor tool.</li>\n</ol>\nHere are some potential custom audiences you may want to create to get started:\n\n<span style=\"text-decoration: underline\"><strong>Active</strong></span>\nThese are active users of your product whom you want to message, for example, to highlight a new product. This also works in reverse should you want to exclude them from your campaigns, saving your ad dollars for new customers instead.\n\n<span style=\"text-decoration: underline\"><strong>Lapsed</strong></span>\nThis includes previous users of your product who are no longer engaged. Load them into a custom audience and entice them back. While the return rates are typically fairly low, it’s always worth a shot.\n\n<span style=\"text-decoration: underline\"><strong>Funnel Droppers and Shopping Cart Abandoners</strong></span>\nThese are the bane of most online marketers—those users who don’t convert. Now you can get a second chance to bring them back in with the aid of a Facebook ad.\n\nIn general, the Facebook ad marketplace has a long way to go when compared with, say, Google AdWords. However, it’s quickly becoming one of the most important channels for most early stage start-ups. Now’s the time to better understand and master its power.\n\n<strong>Additional Reading:</strong>\n<ul>\n\t<li><strong><a href=\"https://www.facebook.com/help/459892990722543/\" target=\"_blank\">Audiences</a></strong> - Facebook Support</li>\n\t<li><span style=\"line-height: 13px\"><strong><a href=\"http://marketingland.com/creating-and-using-facebook-custom-audiences-34786\" target=\"_blank\">Creating And Using Facebook Custom Audiences</a></strong> - Marketing Land\n</span></li>\n\t<li><strong><a href=\"http://blog.hubspot.com/blog/tabid/6307/bid/34213/How-to-Use-Facebook-s-Custom-Audiences-Feature-for-More-Strategic-Ad-Targeting.aspx\" target=\"_blank\">How to Use Facebook's 'Custom Audiences' Feature</a></strong> - HubSpot</li>\n</ul>\n<p style=\"text-align: center\"><strong>Are you a 500 company who needs help with distribution? <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">Let's talk</a>.</strong></p>",
    "type": "post",
    "path": "/2013/06/18/get-more-conversions-with-retargeting-two-quick-ways-to-start/"
}