{
    "title": "Get More Conversions NOW – Funnel Optimization 101",
    "slug": "get-more-conversions-now-funnel-optimization-101",
    "date": "2013-08-06T17:21:27.000Z",
    "url": "http://500.co/?p=1116729121",
    "uri": "http://500.co/2013/08/06/get-more-conversions-now-funnel-optimization-101/",
    "postId": "1116729121",
    "description": "",
    "images": [
        "https://lh5.googleusercontent.com/cER1vBQ6R_69EnJZsdHmtL8IKgwCMvJx8Fn7nLVowLkIvU-6k1dutEAuG2-Mh_VCnnejvGlY4g54X6pHXAmfPnBJLnzw_TUOAlccqotO0rfOlp4O-Dogt8ns",
        "https://lh3.googleusercontent.com/a8YefbLZuEI7kLAOAzP9kLs35nyugReukf-B8Da3cGilyntA8d3OGKR6xOvkDyBBzQ2da3BGIywAK8wonwzGWJuLE0mVwQSxVmBK0YlpK9AuniTAWLOoXBmZ"
    ],
    "creator": "",
    "categories": [
        "distribution",
        "distribution-tuesdays",
        "funnel",
        "optimization",
        "split-testing",
        "testing",
        "tips"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em>\n\n<i>Want to join our next batch of startups? <a href=\"http://bit.ly/Batch7Apply\" target=\"_blank\">Apply NOW</a> for our Fall Accelerator. </i>\n<p dir=\"ltr\">Funnel optimization is the process of measuring and optimizing the steps necessary for one of your customers to reach a conversion goal. A conversion funnel can have anywhere from one to multiple steps, but it will generally only have a single conversion goal (such as a signup, checkout, lead, etc). To optimize the funnel, you have to measure each step to discover the potential “weak spots” (aka drop off points). We’ll be talking through how to think about funnel optimization in this post.</p>\n<p dir=\"ltr\"><strong>The Leaky Bucket Issue</strong></p>\n<p dir=\"ltr\">Before we dive in, let’s briefly talk about the leaky bucket issue. You can have a flawlessly optimized conversion funnel where you’re only losing a few people here and there within the funnel but for some reason your customer base is not growing. The issue a lot of early startups run into is that they haven’t found product market fit yet.</p>\n<p dir=\"ltr\">You can acquire as many users as you want but if your product doesn’t meet their needs, they aren’t going to stick around to become your customers. Focusing too much on funnel optimization before you’ve figured out product market fit is a quick way to waste valuable time and resources.</p>\n<p dir=\"ltr\"><strong>Measuring and Experimenting</strong></p>\n<p dir=\"ltr\">Funnel optimization is a constant process of measuring and experimenting. Being able to track each step of your conversion funnel, set up experiments, and understand the data your analytics tool is telling you is necessary and critical. For example, let’s assume you have an ecommerce website with a 3 step conversion funnel:<img alt=\"\" src=\"https://lh5.googleusercontent.com/cER1vBQ6R_69EnJZsdHmtL8IKgwCMvJx8Fn7nLVowLkIvU-6k1dutEAuG2-Mh_VCnnejvGlY4g54X6pHXAmfPnBJLnzw_TUOAlccqotO0rfOlp4O-Dogt8ns\" width=\"528px;\" height=\"204px;\" /></p>\n<p dir=\"ltr\">The three steps are signup, add a product to the shopping cart, and checkout (pay). The checkout is your conversion goal in this situation. You need to be able to track each individual step in this conversion funnel to be able to find the weak spots of the funnel and optimize.</p>\n<p dir=\"ltr\">There are plenty of tools out there that to help you do this but I prefer event-based analytics platforms such as Mixpanel or Kissmetrics. These tools will allow you to fire unique events when a user passes through each step of the funnel, which makes it very easy to find those weak spots.</p>\n<p dir=\"ltr\">You also need to be able to hypothesize ways to improve your funnel and run experiments based on your hypotheses. This is called split testing, which I’ll discuss later in this post. There are also plenty of tools for split testing such as Optimizely and Unbounce. With these tools in your toolbelt, you’re ready to start optimizing!</p>\n<p dir=\"ltr\"><strong>Less is More</strong></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Simple is good.</strong> This goes for conversion funnels as well. My preference is to always keep it as simple and straightforward as possible. Here are some aspects of your funnel that you can simplify:</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Number of steps to convert</strong> - For most products, there’s no reason to have more than 3 steps in your conversion funnel. Each additional step in your funnel gives the user another opportunity to leave without converting. Don’t give your users any reason to leave before converting, reduce the number of steps in your funnel.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Required fields</strong> - Just like each additional step in your funnel gives your users more chance to leave your site, the more required fields you have the higher chance your users will bounce (bounce means to leave your funnel). There are two main reasons for this: laziness and privacy. Think about this: when you go to the doctor’s office and the person behind the desk hands you a 10 page form to fill out, are you excited to fill it out? Probably not. Asking a user to fill out a long form increases the chance they will bounce, especially if you are asking information that they don’t know off the top of their head! Only require the most necessary pieces of info from your users and you’ll see your conversion rate increase. Also, if you are asking very personal information such as a credit card number and billing address, users are less willing to give this info out.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Tip #1:</strong> If you want to collect more information from your users, do it over time and not during your initial conversion funnel. Once a user becomes your customer and starts using your product frequently, you can ask for more information as they are using your product.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Tip #2:</strong> Review each field in your form, do you absolutely need every piece of information you are asking for? Do you really need their first and last name in separate fields? Do you really need them to retype their password for confirmation? If they mistyped their password, can’t they just click “forgot my password” and have it sent to them? These are just some examples.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>The One “Gotcha”</strong> - One thing to remember as you are simplifying your funnel is that the easier you make it for people to convert, the more “low quality” users will convert. What I mean by low quality is if your funnel is very complicated and has many steps, only the most interested users will go through the process of converting for you. When you simplify your funnel, someone who may have bounced at the site of 10 fields might stick around convert when you only have 2 fields. Since they didn’t have to work very hard to convert, there’s a higher chance they aren’t going to be a die-hard customer. This is a balancing act between simplicity and quality of customers. Usually, the increase in customers coming through your funnel from simplification outweighs the drop in overall quality.</p>\n<p dir=\"ltr\"><strong>Split Testing</strong></p>\n<p dir=\"ltr\"><a href=\"http://en.wikipedia.org/wiki/A/B_testing\">Split testing</a> aka A/B testing is the way you should be optimizing your funnels. Once you have some data and you see a weak point in your funnel, you hypothesize a possible optimization, and then implement a split test. For example, let’s say your ecommerce example has a weak point when people are checking out, meaning a lot of people get to that step but then bounce. A hypothesis can be that a red “checkout” button will convert better than a blue button. Your split test will show a red button to half of your users and a blue button for the other half. You can then look at the data and easily see which one performs better and change your page to have the better performing color. <img alt=\"\" src=\"https://lh3.googleusercontent.com/a8YefbLZuEI7kLAOAzP9kLs35nyugReukf-B8Da3cGilyntA8d3OGKR6xOvkDyBBzQ2da3BGIywAK8wonwzGWJuLE0mVwQSxVmBK0YlpK9AuniTAWLOoXBmZ\" width=\"619px;\" height=\"338px;\" /></p>\n<p dir=\"ltr\">The majority of the time you should not make any changes to your funnel without split testing. By making changes without split testing, you really can’t be sure about the performance of the new variation in comparison to the original.</p>\n<p dir=\"ltr\">Lastly, you should only be split testing one thing at a time. Using the same example, the split test should only be testing the difference between a red and a blue button. If you test multiple things at once, you won’t be sure what actually caused the change in performance.</p>\n<p dir=\"ltr\"><strong>General Tips</strong></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Focus</strong> - keep your funnel and sales copy very focused. This is in line with keeping everything simple. Make sure you don’t give your users many options and guide them through exactly what you want them to do. Be explicit with what you want your users to do. You can literally point to buttons you want them to click (this is called a call to action). Keep your sales copy consistent and to the point.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Value Proposition</strong> - You should have your value propositions are pretty much every page. Continually explain in simple terms why your product is awesome and they need it. Don’t write essays explaining your value proposition, use short phrases and icons/images.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Faces</strong> - Social validation works. Show pictures of your current customers on your funnel pages. If you can use Facebook to show the user their friends who are also your customers, even better.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Funnel abandonment emails (aka trigger emails)</strong> - Use trigger emails to try to re-engage users who abandoned your funnel. Using our ecommerce example again, if a user signs up, adds a product to their cart but doesn’t checkout, you should send them an email 24 hours later saying something like: “hey you’re almost done checking out, click here to finish”. You can also take it a step further and offer a discount to users if they finalize the purchase within a certain period of time.</p>\n<p dir=\"ltr\"><strong>Conclusion</strong></p>\n<p dir=\"ltr\">Funnel optimization is an easy way to increase your customer base without spending money. As an additional benefit, when you start doing paid marketing, funnel optimization will actually decrease the CPA (cost per acquisition) because you will be converting more people for the same cost. Keep your funnel simple and your measuring and experimenting methodical. Data is your friend.</p>",
    "type": "post",
    "path": "/2013/08/06/get-more-conversions-now-funnel-optimization-101/",
    "backgroundImage": "/backup/dogcone-960x540-2013-08-06-13-12-21.jpg"
}