{
    "title": "Getting to the Top of Google - Less Science, More Workflow",
    "slug": "getting-to-the-top-of-google-less-science-more-workflow",
    "date": "2011-01-26T02:50:49.000Z",
    "url": "http://blog.500startups.com/?p=1116714847",
    "uri": "http://500.co/2011/01/25/getting-to-the-top-of-google-less-science-more-workflow/",
    "postId": "1116714847",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/01/Mandorallen1-150x150.jpg",
        "http://500.co/wp-content/uploads/2011/01/johnstraw-150x150.jpg"
    ],
    "creator": "",
    "categories": [
        "google",
        "guest-posts",
        "john-straw",
        "linkdex",
        "mandorallan",
        "search",
        "search-engine-optimization",
        "seo",
        "smbs",
        "startups",
        "tips"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/01/Mandorallen1.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714854\" title=\"Mandorallen\" src=\"/backup/Mandorallen1-150x150-2011-01-25-11-20-50.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2011/01/johnstraw.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714853\" title=\"johnstraw\" src=\"/backup/johnstraw-150x150-2011-01-25-11-20-50.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<a href=\"http://500.co/wp-content/uploads/2011/01/johnstraw.jpg\"></a><em>Meet Mandorallen (from the series Belgarion by David Eddings), aka 500 Founder <a href=\"http://twitter.com/#!/johnstraw\" target=\"_blank\">John Straw</a>. John is CEO and founder of <a href=\"http://www.linkdex.com\" target=\"_blank\">Linkdex</a>. Based in London, UK, Linkdex is going to disrupt the SEO space by providing a fully integrated suite of tools that for the first time allows SMB’s a real opportunity to get to the top of Google search results.  LinkDex recently won the <a href=\"http://econsultancy.com/uk/press-releases/5375-econsultancy-announces-2010-innovation-awards-winners\" target=\"_blank\">eConsultancy Search Innovation 2011 Award</a>. John is a digital marketing entrepreneur - with 4 marketing startups in 15 years and 3 profitable exits. Linkdex is the 4th and our VC’s have high hopes!</em>\n\nIf you’re like me and have decided to get fitter and lighter in 2011, you may have been told by your trainer that ANYONE can get fit. All you need to do is commit to doing the right exercises in the right way in the right frequently.\n\nAs I was told this, I was amazed at how similar this was to the rules of growing your natural search rankings, traffic and sales. If I was to tell you what to do, how to do it and you were to make the necessary investment in time and money, I am 100% confident your analytics reports would make for pleasant reading.\n\nThe problem is <strong>most businesses simply don't know where to start with SEO</strong> and that's not helped by the myths that have been created over the years. Let’s take a closer look at what’s really important:\n<ul>\n\t<li><strong>Keyword selection.</strong> It is critical that you start your SEO program with a well researched target keyword list. It should be as broad and it is long and it should be ambitious. Now clearly \"credit cards\" is going to be fiercely competitive but \"low interest credit cards\" is a lot less competitive and will produce better-qualified visitors - and there's real volume in long tail.</li>\n\t<li><strong>Positional benchmarking.</strong> Measure your success - take your keyword list and check to see where you are on Google against those keywords.</li>\n\t<li><strong>Content optimization. </strong>You'll need a page for each core group of keywords. But not any old page. A perfect page has your keywords in all the right places, maximizes conversion, and will more likely to be linked to by other websites.</li>\n\t<li><strong>Run a competitive landscape</strong>. You will know who your top performing competitors are, so you should understand what their backlink structure looks like and who are the influencers in that structure.</li>\n\t<li><strong>Link building. </strong>Essential, critical and here's where you need to be persistent. You'll have seen the really good quality influencer links in the competitive landscape. You can also find links that you and your competitors don’t have yet and then be creative by developing a relationship with those links.</li>\n</ul>\nThe very best links are given because of your site’s editorial brilliance. This is what Google's <a href=\"http://www.mattcutts.com/blog/\" target=\"_blank\">Matt Cutts</a> calls \"links that stand the test of time\". It's how Google will establish trust in your brand.\n\nIf my belief that any online savvy business owner can do SEO has inspired you to add a late new year’s resolution to your list and get your website ‘SEO fit’, you should try Linkdex. Here’s what it brings to the party:\n<ul>\n\t<li>Keyword research</li>\n\t<li>Positional and traffic reporting (integrated with Google Analytics)</li>\n\t<li>Onsite optimisation</li>\n\t<li>Competitive landscaping (really truly awesome, real insight)</li>\n\t<li>Link building with CRM</li>\n\t<li>All fully integrated into a centralised task manager and with great SEO education</li>\n</ul>\nIt will help you take control of your SEO in 2011. Here’s the <a href=\"http://vimeo.com/18739964\" target=\"_blank\">SEO demo</a> video. <a href=\"http://www.linkdex.com/\" target=\"_blank\">Linkdex</a> is just $49.00 a month with no commitment. Not much to change your weblife....\n\nBut please remember - like exercise, SEO is not an \"in time\" activity. Rather, it's \"through time\". SEO should not be something you can consider as a one-off. It is something you need to consistently work at. Build workflow around it and be persistant - it will pay off.",
    "type": "post",
    "path": "/2011/01/25/getting-to-the-top-of-google-less-science-more-workflow/"
}