{
    "title": "Getting Early Social Media Followers (Besides Grandma)",
    "slug": "getting-early-social-media-followers-besides-grandma",
    "date": "2013-08-22T15:59:53.000Z",
    "url": "http://500.co/?p=1116729263",
    "uri": "http://500.co/2013/08/22/getting-early-social-media-followers-besides-grandma/",
    "postId": "1116729263",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/08/cat-meow.gif",
        "http://500.co/wp-content/uploads/2013/08/free.gif",
        "http://500.co/wp-content/uploads/2013/08/pugg.gif",
        "http://500.co/wp-content/uploads/2013/08/nonono.gif",
        "http://500.co/wp-content/uploads/2013/08/Screen-Shot-2013-08-21-at-10.50.48-PM.png"
    ],
    "creator": "",
    "categories": [
        "distribution",
        "distribution",
        "facebook",
        "percival",
        "sean",
        "social-media"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em>\n\nYou want to be social. You want your new brand to bask in the glory of many thousands of adoring fans on social media sites like Facebook and Twitter. However, each day you look at your page only to see that cobwebs are forming. If your social pages had a soundtrack, it would probably just be the sound of <a href=\"http://www.youtube.com/watch?v=1ytCEuuW2_A\" target=\"_blank\">“whomp, whomp” </a>played on a sad trombone over and over again. Your social channels are not growing, and that sucks.\n\nSo, how do you get things going? How do you get started building your audiences on social platforms to the point where they can contribute significantly to help grow your business? Here are a few recommendations and things that I have used in the past to get that initial social growth.\n<h2>Posting Consistently</h2>\n<img class=\"aligncenter size-full wp-image-1116729293\" alt=\"cat-meow\" src=\"/backup/cat-meow-2013-08-22-13-10-59.gif\" width=\"648\" height=\"432\" />\n\nThis is probably the most important and least common technique deployed by early-stage companies. This problem exists mostly because there is a bit of a chicken and egg problem here. Why bother posting daily content when you have all of 12 followers, 5 of whom are probably family and/or team members? Well, just like most things in life, you have to start somewhere. In this case, it’s helpful to get into that rhythm sooner, rather than later. You also want to be ready as your social channels begin to scale and require more attention/content.\n\nIn terms of how much content you should be posting, that can vary depending on your business and audience. What’s more important is that you’re consistent about it. So, if that’s one post a day or 5 posts a day, pick a number and stick to it. This helps to train your audience regarding what volume they should expect from your brand while at the same time bringing some publishing discipline to your organization.\n\nIf it’s still very early stage, you may simply not have much to say. Totally get that. Here, you might want to consider aggregating relevant stories to your industry. This is great way to fill in the gaps until you have more content of your own to share. Some tools to help automate things in that regard include:\n<ul>\n\t<li>\n<h3><a href=\"http://twitterfeed.com\">TwitterFeed</a></h3>\n</li>\n\t<li>\n<h3><a href=\"http://hootsuite.com\">Hootsuite</a></h3>\n</li>\n\t<li>\n<h3><a href=\"http://beatrixapp.com/\">Beatrix</a></h3>\n</li>\n\t<li>\n<h3><a href=\"http://ifttt.com\">IFTTT</a></h3>\n</li>\n</ul>\n<h2>Give Stuff Away With Contests</h2>\n<p style=\"text-align: center\"><img class=\"aligncenter  wp-image-1116729301\" alt=\"free\" src=\"/backup/free-2013-08-22-13-10-59.gif\" width=\"500\" height=\"258\" /></p>\nYou or your brand might be too high-class to run a contest, but for those who are not, here’s another very effective way to build your audience (and have a little fun). Online contests are nothing new, of course, and while some are a bit scammy in nature, it is possible to pull off one without looking totally gross. You can also get some nice social growth in the process, thanks to <a href=\"http://Rafflecopter.com\">Rafflecopter</a>, easily one of the best little contest platforms out there. Another option is <a href=\"http://wildfire.com\">Wildfire</a>, although that’s typically more expensive and for later-stage companies. In terms of the prize, if you’re a service, offer a nice healthy amount of free service. For example, you can offer 3 free months or more. If you’re building something like an iPhone app, it’s fairly easily to give away an iPod Touch or some other iDevice. An ideal prize can vary widely, but make it something compelling. This usually means something of $100 value or more.\n<h2>Cheap Thrills for Cheap Virality</h2>\n<img class=\"aligncenter size-full wp-image-1116729295\" alt=\"pugg\" src=\"/backup/pugg-2013-08-22-13-10-59.gif\" width=\"450\" height=\"197\" />\n\nJust like with contests, you might be willing to take a bit of the hit brand-wise in order to get that initial growth. The technique in this case is to post content (typically images) that are inherently viral in nature. Think of things like Some Ecards, for example, or the type of content that you might find at <a href=\"https://www.facebook.com/WTFJOKES\" target=\"_blank\">www.facebook.com/WTFJOKES</a>. That stuff can be less than pretty, but it is highly sharable and has been proven to aid growth, especially on platforms like Facebook. If you’re really crafty, create your own viral images with some subtle branding on it. Time to put those hacky Photoshop skills to work.\n<h2>Buy Likes and Followers</h2>\n<p style=\"text-align: center\"><img class=\"aligncenter  wp-image-1116729297\" alt=\"nonono\" src=\"/backup/nonono-2013-08-22-13-10-59.gif\" width=\"500\" height=\"282\" /></p>\nSometimes when you talk about buying Facebook or Twitter followers, it’s sort of like that moment when someone walks into a party and the record comes to a screeching halt. You might actually think or hear things like, “It’s so unauthentic! It’s just not right! Our brand is being built organically as Mother Nature intended it!” soon after mentioning paid growth. People have opinions, but most of the time, opinions suck, so just ignore those people for a moment.\n\nThe truth is that many brands, large and small, spend big bucks to acquire followers on social channels. There is nothing wrong with that, especially when it’s done right. While there are a lot of nuances to launching these campaigns, there are really two important things to note. The first is that any service that will directly sell you Facebook likes or Twitter followers is typically junk. Unless you’re trying to attract audience in countries like Indonesia or you really enjoy bots on your channels, those users are almost never worth paying for. Adding them would be purely for optics.\n\nHowever, when you intelligently buy fans, it can be a meaningful way to build your social audience. The best way to do this is to use <a href=\"http://500.co/2013/07/16/facebook-custom-audiences-101/\" target=\"_blank\">Facebook Custom Audiences</a> or Twitter’s native ad system. Both offer several options for precision targeting your existing audiences or the audiences of your competitors. In most cases, you’ll be paying around $1 per like/follow, so budget accordingly.\n<h2>Emailing for Likes</h2>\nLast, but certainly not least, don’t forget to leverage email as a way to build growth in your social channels. If you’ve been good about building up your email marketing prowess, you hopefully have some semblance of an email database. Don’t be afraid to send them dedicated emails about following you on a social channel of your choice. In this case, you want it to be a straightforward request with a very clear and single CTA (call to action) to follow and or like your social page. Below is an example of an email that I used at my startup, Wittlebee, that helped us grow our Facebook audience quickly to 50K+ well-qualified fans.\n\nDon’t forget to also put these social follow emails into your email drip marketing campaigns, as well. This is one best-use cases for those emails. Good luck, and happy social growth beyond grandma.\n\n<img class=\"aligncenter size-full wp-image-1116729269\" alt=\"Screen Shot 2013-08-21 at 10.50.48 PM\" src=\"/backup/Screen-Shot-2013-08-21-at-10-50-48-PM-2013-08-22-13-10-59.png\" width=\"515\" height=\"576\" />\n<em>About as literal as you can get when fishing for likes. </em>",
    "type": "post",
    "path": "/2013/08/22/getting-early-social-media-followers-besides-grandma/",
    "backgroundImage": "/backup/sadcat-780x540-2013-08-22-13-10-59.jpg"
}