{
    "title": "GOAP India 2013: Bold Founders, Optimistic Investors, and a Government that’s Finally Waking up",
    "slug": "goap-india-2013-bold-founders-optimistic-investors-and-a-government-thats-finally-waking-up",
    "date": "2013-03-19T00:20:11.000Z",
    "url": "http://500.co/?p=1116726395",
    "uri": "http://500.co/2013/03/18/goap-india-2013-bold-founders-optimistic-investors-and-a-government-thats-finally-waking-up/",
    "postId": "1116726395",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/03/481256_10151566694649923_945919309_n.jpg",
        "http://500.co/wp-content/uploads/2013/03/417644_10152601505325274_1103549887_n.jpg",
        "http://500.co/wp-content/uploads/2013/03/5726_10152579461475274_2043799957_n.jpg"
    ],
    "creator": "",
    "categories": [
        "events",
        "geeks-on-a-plane",
        "goap",
        "india-2"
    ],
    "content": "<a href=\"http://geeksonaplane.com\" target=\"_blank\">Geeks on a Plane</a> (GOAP) is a 10-12 day trip to various parts of the world with 20-25 “Geeks” (entrepreneurs, techies, designers, angels, VCs, mentors). The first Geeks on a Plane to India was in December 2011; that’s when I first met Dave, Paul, Christen, George, Anu, Samir, and a bunch of other great geeks. Fast forward 14 months, and I finally got a chance to be a “geek” on the February 2013 GOAP India trip.\n<p style=\"text-align: center;\"><a href=\"/backup/481256_10151566694649923_945919309_n-2013-03-18-13-18-20.jpg\"><img class=\"wp-image-1116726397 aligncenter\" alt=\"481256_10151566694649923_945919309_n\" src=\"/backup/481256_10151566694649923_945919309_n-2013-03-18-13-18-20.jpg\" width=\"691\" height=\"518\" /></a></p>\nGOAP India 2013 included <a href=\"http://geeksonaplane.com/people/2013-india-geeks/\" target=\"_blank\">awesome people on the trip as well as great hosts across India</a>. Here’s what I learned during our visit to Bangalore, Mumbai and Delhi:\n\n<strong>India Is A Land of Contradictions</strong>\n\nThe poor are all over India. It’s still one of the poorest countries in the world. However, the rich are obscenely rich. Driving a $200,000 car is no big deal in a city like Mumbai. And while on your way to a swanky hotel where you’ll pay $900 for a single malt, you may drive by open sewage, dirt piled up on the side of the road, or barking stray dogs in packs. But you'll also pass by massive skyscrapers, gorgeous temples, educational institutes galore, and many people hustling to make a buck. You can feel the buzz in the air and the excitement of young people who see opportunity in India.\n\nAs risk averse as their parents are, many young people are willing to take risks to enact change. For example, at <a href=\"http://bangalore.startupweekend.org/2013/02/23/being-built-right-now-at-startup-weekend-bangalore-february-2013/\" target=\"_blank\">Startup Weekend Bangalore</a>, entrepreneurs pitched a ton of ideas, and two of them really stood out in my mind: Ghati, to enable safe and clear passage of ambulances, and Garbage-busters, which uses mobile phones to alert civil authorities of garbage that hasn’t been cleared. Two years ago, few people would have considered quitting their jobs to pursue ideas that could make people's lives better. Instead, most of them wanted to build the “Twitter of India” or the “Facebook of India”. Today, many Indians are aware of the problems surrounding them in their daily lives and are taking steps to solve them.\n<p style=\"text-align: center;\"><a href=\"/backup/417644_10152601505325274_1103549887_n-2013-03-18-13-18-20.jpg\"><img class=\"wp-image-1116726405 aligncenter\" alt=\"417644_10152601505325274_1103549887_n\" src=\"/backup/417644_10152601505325274_1103549887_n-2013-03-18-13-18-20.jpg\" width=\"691\" height=\"460\" /></a></p>\n<strong>Great Raw Talent</strong>\n\nThere’s no question that India is full of geeks with great entrepreneurial and tech talent. Just look at the number of Indian engineers, doctors, and Wall Street analysts that have flourished in the US. In India, parents dream of their children going into the “IT” industry. At first, this meant working companies like Infosys, Wipro, TCS, and HCL. Then it meant PWC, E&amp;Y, Accenture, Goldman Sachs, JP Morgan, Dell, Microsoft, and Google. Today, we have Facebook, LinkedIn, and hundreds of other great US tech companies.\n\nBefore 2005, Indian tech entrepreneurs were selling services to companies in other countries, and this made India the outsourcing capital of the world. What they didn’t do was build an ecosystem that fostered entrepreneurship or creative thinking.\n\nThis all changed in 2010. Companies like<a href=\"http://www.druva.com/\"> Druva</a>,<a href=\"http://www.slideshare.net/\"> Slideshare</a>,<a href=\"http://www.fusioncharts.com/\"> FusionCharts</a> and<a href=\"http://www.zipdial.com/\"> ZipDial</a> popped up, and today, we’re seeing startups like<a href=\"http://www.inventure.org/\"> InVenture</a>,<a href=\"http://www.webengage.com/\"> WebEngage</a>,<a href=\"http://www.gazemetrix.com/\"> GazeMetrix</a> and<a href=\"http://www.instamojo.com/\"> Instamojo</a>. Some of these companies have exited. Some are incredibly cash rich. Some are growing like a weed and continue to raise larger amounts of growth capital.\n\n<strong>Investors See Lots of Potential</strong>\n\nDuring GOAP, I met Indian investors who are optimistic about long-term opportunity. Ecommerce, education, travel, personal finance, Universal ID (UID), family tech, rural tech and, of course, outsourced tech are some of the broader themes that investors expressed significant interest in. Sorry folks, “social media” just wasn’t at the top of anyone’s list.\n\nHowever, as bullish as investors are, most of them still aren’t very founder friendly. Some of the deal terms being offered are still quite onerous. Doing an investment in tranches is another favorite pastime of Indian investors. Most founders still complain about angels behaving like series A VCs, and VCs behaving more like private equity shops.\n\nThe bright side is that a few founders mentioned two VCs who work more like startup founders than VCs. They make decisions quickly. They present terms that are fair. They tell founders when and how much they should raise to minimize dilution. They make themselves available to founders at places where founders usually are.\n\nYou might say that two VC firms in a country of 1.2+ billion people is insignificant. But in India, VCs running a fund like startup founders is a big deal, and their success will only inspire more to do the same (or lose deal flow).\n\n<strong>Investors are Cautious, Too</strong>\n\nInvestors also spoke to me about some of their concerns, and many revealed they’re not particularly excited about short-term opportunity. Macro-economic conditions, the lack of exits, corruption in the government, bureaucracy, and rising costs all play an important part in dampening the spirits of investors. However, these also present big opportunities for ambitious entrepreneurs. Investors realize this. Though they are cautious, they aren’t scaling back the amount of capital they want to deploy in India.\n\n<strong>The Indian Government is Finally Waking Up</strong>\n\nDuring our trip, the Indian Government announced its budget. While this may not be a big deal in most western countries, in India, budget makes or breaks economic sentiment for the year. No one was terribly excited or distraught over this year’s budget, but there were a few things that raised the hopes of startups and early-stage investors.\n<ul>\n\t<li>Preferential tax treatment for angels when investing together or “pooling” their capital and registering with the government.</li>\n\t<li>Corporations are required to spend 2% of their income on CSR (Corporate Social Responsibility) investments or donations. Incubators at government or recognized universities qualify for claiming the 2% spend.</li>\n\t<li>Startups can potentially find some liquidity by listing on the SME exchange. The BSE (Bombay Stock Exchange) runs one and had 11 companies listed as of December 2012.</li>\n</ul>\nA much more detailed analysis of the budget and some opinions can be found on<a href=\"http://techcircle.vccircle.com/2013/02/28/what-budget-2013-means-for-startups-incubators-and-angel-investors/\"> VCCircle</a>.\n\nTo get an idea of what the trip was like, check out our video of<a href=\"http://www.youtube.com/playlist?list=PL32C48B0580642CF3\"> GOAP India 2011</a>.\n\nI’m excited to see how India transforms in the coming years, and can’t wait for our next Geeks on a Plane trip!\n\n<a href=\"/backup/5726_10152579461475274_2043799957_n-2013-03-18-13-18-20.jpg\"><img class=\"alignleft  wp-image-1116726407\" alt=\"5726_10152579461475274_2043799957_n\" src=\"/backup/5726_10152579461475274_2043799957_n-2013-03-18-13-18-20.jpg\" width=\"691\" height=\"460\" /></a>",
    "type": "post",
    "path": "/2013/03/18/goap-india-2013-bold-founders-optimistic-investors-and-a-government-thats-finally-waking-up/",
    "backgroundImage": "/backup/Bombay_Stock_Exchange-original-2-960x540-2013-03-18-13-18-20.jpg"
}