{
    "title": "Grow Your Business Smarter with Conversion Rate Optimization",
    "slug": "grow-your-business-smarter-with-conversion-rate-optimization",
    "date": "2013-07-09T15:44:06.000Z",
    "url": "http://500.co/?p=1116728305",
    "uri": "http://500.co/2013/07/09/grow-your-business-smarter-with-conversion-rate-optimization/",
    "postId": "1116728305",
    "description": "",
    "images": [
        "https://lh3.googleusercontent.com/VgjuK0Tz5tLJPyWrYOLp_bTpvLPejgo2HnzrV-uw4-NDslzQ29IUpJFZxuh8jq4KfcMWVD260Szqpb-w34F8Iwf45kUg37EOihXNfF0Z9EN2hLjjFlI0AgAf",
        "https://lh4.googleusercontent.com/MWcHuamRIX2T9hl9pNxCtDNE4-RjaIU72pbRJ6ipTE777TJpsez_2pyMqgi9YwlsbGA0CVuaXbJwAEuBRuABoZz-12GvO_7d5SMM44xzczjipPXpqIXYA4PV",
        "https://lh6.googleusercontent.com/wT6jNejnnc1ov_mRxRQwIvYPeXnkVvNSYCXj7sGu9a4P__cozgRfpVB8mn7wBQVhJac0KOnYfgnKhA764eDrLnXXmDHty7pwInGNnNj2xWAPOz_n1jYRFl9c",
        "https://lh5.googleusercontent.com/pLLpFYkfKdFIliqb437mAb9FO9qph4noL1fSXQohiOO6pyPSrYd-_UU_p6S26EHo9JMDhZrQXrApBhDHH1hHC_dD_S3e5bTqOw_PP5ICMj3I7ssU17w-BrUn",
        "https://lh6.googleusercontent.com/g00aAPIZOlJth1o6sRfIxsnUxdFCS6jCpTigEBPPAqcNeAmJ0rQffyuYzxy67ktaNpOeTyhKosyB4RaL8G5KlJtkXzo8CS2fBShTdQ2eTi0v3rbeVDlU-Gxq"
    ],
    "creator": "",
    "categories": [
        "conversion-rate-optimization",
        "cro",
        "distribution",
        "distribution",
        "distribution-tuesday",
        "landing-pages",
        "tips"
    ],
    "content": "<p style=\"text-align: left;\"><em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em></p>\n<p dir=\"ltr\" style=\"text-align: left;\">When it comes to acquiring customers online, one of the best ways to work smarter—instead of harder—is by engaging in conversion rate optimization (CRO): testing and iterating on the steps that users go through on their way from prospective to actual customers.</p>\n<p dir=\"ltr\"><strong>Ready? Iterate.</strong></p>\n<p dir=\"ltr\">CRO is best understood in the context of your customer lifecycle (see <a href=\"http://www.slideshare.net/dmc500hats/startup-metrics-for-pirates-long-version\">startup metrics for pirates</a> for a refresher). Once you've defined which user actions map to each element of the lifecycle for your business, you can start optimizing for each step. Make informed decisions at the outset as to what may most engage your target audience, but minimize your assumptions in CRO and iterate quickly through cycles of <a href=\"http://theleanstartup.com/principles\">build/measure/learn</a> using <a href=\"http://en.wikipedia.org/wiki/A/B_testing\">A/B testing</a> and other related methodologies.</p>\n<p dir=\"ltr\">A typical conversion funnel may feature a landing page (which could be your home page), registration page, and a thank you page. Let's consider each page more closely.</p>\n<p dir=\"ltr\"><strong>Landing Page</strong></p>\n<p dir=\"ltr\">The landing page serves as the top of your conversion funnel. It's main purpose is to get visitors to take the next step: to register for your service or buy your product. You generally want to keep landing pages simple: include your brand/logo; a tagline and/or value proposition; a striking image (or overview video) to visually communicate what you offer; and a call to action (CTA). One of Spotify's current <a href=\"https://www.spotify.com/us/video-splash/\">home page tests</a> illustrates these principles nicely.</p>\n<img alt=\"\" src=\"https://lh3.googleusercontent.com/VgjuK0Tz5tLJPyWrYOLp_bTpvLPejgo2HnzrV-uw4-NDslzQ29IUpJFZxuh8jq4KfcMWVD260Szqpb-w34F8Iwf45kUg37EOihXNfF0Z9EN2hLjjFlI0AgAf\" width=\"600px;\" height=\"481px;\" />\n<p dir=\"ltr\">Place important elements above the fold of the page; don't expect users to scroll. Your CTA should be succinct and action-driven, and there should only be one. If you need to offer additional options (e.g., learn more), make sure that your primary CTA is visually dominant.</p>\n<p dir=\"ltr\">You may want to test including your registration form on your landing page (if it’s short), or at least asking for contact information, as Twitter does on its <a href=\"https://twitter.com\">home page</a>. This gives you the option to email users who drop out of the funnel.</p>\n<p dir=\"ltr\"><img alt=\"\" src=\"https://lh4.googleusercontent.com/MWcHuamRIX2T9hl9pNxCtDNE4-RjaIU72pbRJ6ipTE777TJpsez_2pyMqgi9YwlsbGA0CVuaXbJwAEuBRuABoZz-12GvO_7d5SMM44xzczjipPXpqIXYA4PV\" width=\"616px;\" height=\"464px;\" /></p>\n<p dir=\"ltr\">Of course, some businesses are more complex than others, and their landing pages must reflect that. Simple is innovating on traditional banking products, and as such features detailed information regarding its services on a relatively long <a href=\"https://simple.com\">home page</a>.</p>\n<img alt=\"\" src=\"https://lh6.googleusercontent.com/wT6jNejnnc1ov_mRxRQwIvYPeXnkVvNSYCXj7sGu9a4P__cozgRfpVB8mn7wBQVhJac0KOnYfgnKhA764eDrLnXXmDHty7pwInGNnNj2xWAPOz_n1jYRFl9c\" width=\"606px;\" height=\"513px;\" />\n<p dir=\"ltr\">You’ll want to test different value propositions, visuals, CTAs, CTA button placement/color, and overall page layouts to see what converts best for you.</p>\n<p dir=\"ltr\"><strong>Registration Page</strong></p>\n<p dir=\"ltr\">Offering sign-up via Facebook (or Twitter &amp; Google) can reduce friction in the registration process. Not everyone is a fan of connecting via social accounts, so it’s a good idea to also offer a traditional registration option. Your registration form should only include fields that are absolutely necessary. Label different sections of the form clearly; if you’re asking for sensitive information, make sure to explain why you need it. Use large form fields with clear labels, and align them to allow for quick scanning of the form. Avoid redundant form fields, but do ask for confirmation on any masked fields (e.g., password) to avoid fat-finger errors.</p>\n<p dir=\"ltr\">If you need to collect payment information, forego asking for the entire billing address; the billing zip code is sufficient for credit card authorization. Consider testing placing personal information and billing information on separate pages. While you generally want to keep the conversion funnel as short as possible, I’ve seen the above test drive a 5%+ bump in the conversion rate. Uber's <a href=\"https://clients.uber.com/#!/sign-up\">sign up page</a> is a great example of a simple, intuitive registration form. <img alt=\"\" src=\"https://lh5.googleusercontent.com/pLLpFYkfKdFIliqb437mAb9FO9qph4noL1fSXQohiOO6pyPSrYd-_UU_p6S26EHo9JMDhZrQXrApBhDHH1hHC_dD_S3e5bTqOw_PP5ICMj3I7ssU17w-BrUn\" width=\"545px;\" height=\"891px;\" /></p>\n<p dir=\"ltr\"><strong>Thank You Page</strong></p>\n<p dir=\"ltr\">Don’t think of the thank you page as a throw-away, just because the user has already completed your desired action.  Use it to confirm for the user that her purchase or registration is complete, and test its effectiveness as a segue to the next steps. Prompt users to invite friends, download your mobile app, or whatever action may keep them most engaged. Following registration, <a href=\"http://squareup.com\">Square</a> confirms that your card reader is en-route to you and prompts you to download their mobile app.</p>\n<img alt=\"\" src=\"https://lh6.googleusercontent.com/g00aAPIZOlJth1o6sRfIxsnUxdFCS6jCpTigEBPPAqcNeAmJ0rQffyuYzxy67ktaNpOeTyhKosyB4RaL8G5KlJtkXzo8CS2fBShTdQ2eTi0v3rbeVDlU-Gxq\" width=\"612px;\" height=\"514px;\" />\n<p dir=\"ltr\"><strong>Summary</strong></p>\n<p dir=\"ltr\">Conversion rate optimization is one of the most powerful methodologies that you can deploy to increase the efficiency and effectiveness of your growth efforts. To get the most out of CRO, don’t just apply the scientific method; heed your instincts and work within the framework of your brand and mission. Don’t expect every test to yield a large bump in conversion rates, but know that the learnings gathered over many iterations will materially impact your business.</p>",
    "type": "post",
    "path": "/2013/07/09/grow-your-business-smarter-with-conversion-rate-optimization/",
    "backgroundImage": "/backup/spotify-960x540-2013-07-09-13-10-44.png"
}