{
    "title": "Hacking VC: Why Community Is 500’s Secret Sauce",
    "slug": "hacking-vc-why-community-is-500s-secret-sauce",
    "date": "2013-04-04T03:45:05.000Z",
    "url": "http://500.co/?p=1116726671",
    "uri": "http://500.co/2013/04/03/hacking-vc-why-community-is-500s-secret-sauce/",
    "postId": "1116726671",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "500strong",
        "events",
        "musings",
        "who-is-500",
        "who-is-500-2"
    ],
    "content": "<p dir=\"ltr\">I met Dave McClure in 2006. I had been producing a bunch of tech shows, and Dave was nothing if not memorable on the conference circuit. In those days, he was actually tamer on stage...maybe he would throw in a few f-bombs when you’d least expect it, but he wasn’t at the point of, say, <a href=\"http://currenteditorials.com/2012/04/14/how-giving-someone-the-bird-sparks-a-wave-of-innovation-and-community-swbaymega/\">flipping the bird to an audience</a>. Still, he was shocking...and the tech atmosphere amplified it.</p>\n<p dir=\"ltr\">This was a time when funding rounds were much larger than they are today, tech was still rebounding from the crash of 2002, and the general mood was more conservative. So let’s just say Dave stuck out. It was obvious to me (and a lot of other folks in the industry) that he represented a coming shift in Silicon Valley culture. But as usual, he was ahead of the trend - the great worship of coders and hackers hadn’t yet begun.</p>\n<p dir=\"ltr\"><strong>At that time, everyone worshipped VCs, and the developer community was a subculture that only a few folks understood and represented.</strong></p>\n<p dir=\"ltr\">In 2009, I started a company and Dave was my largest client. All the while, he was cooking up the idea for what he’d later call “500 Startups” (after many iterations, such as “Sandworm Ventures”). He would call me at random times during the day, spouting off a new realization he had about structuring the fund or building the “network”…he was so excited, hardly taking a breath between words, and he’d always end with “this is going to be good.\"</p>\n<p dir=\"ltr\"><strong>Thinking back, I was completely naïve about the scale he was targeting because I would hang up and think, “Wow, I’m so excited! This is amazing! But really - WTF was he talking about?!!”</strong></p>\n<p dir=\"ltr\">Still, I couldn’t shake the feeling that he was onto something. Maybe it was the infectious thrill in his voice when he described how he would raise a fund, spread small amounts across hundreds of companies, build a mentor network, run events, and travel the world to source deals. My head would spin trying to process everything. At times, I considered that perhaps, maybe, possibly... he was smoking crack. I mean seriously...how would ANYONE have the bandwidth to do all that?</p>\n<p dir=\"ltr\">But it sounded so fun, and it was a time in my life when I just felt ready to take a risk. So I left my own company to join the founding team @ 500.</p>\n<p dir=\"ltr\">Those very early days (I say this fully aware that we’re still in our early days) were beyond insane, each day more stressful and fire-laden than the one before. But they were also incredibly magical.</p>\n<p dir=\"ltr\"><strong>And as time went on, it hit me like a bag of bricks what Dave was actually doing, and had actually been describing all that time.</strong></p>\n<p dir=\"ltr\">A lot of people want to know what’s behind the curtain at 500…how we manage so many startups, how we do so many events, how we deal with Dave (wine helps), how how how how...</p>\n<p dir=\"ltr\">And its true, there IS a secret. But it’s not what people think…its not some amazing data platform or a huge ivy-league-pedigreed team or a pile of cash that we throw around at marketing. It’s not even genius or irreverence or strategy. Sure, those things may be part of the recipe, but they are NOT the secret ingredient.</p>\n<p dir=\"ltr\"><strong>The secret ingredient is…(listen close and I will whisper it): COMMUNITY.</strong></p>\n<p dir=\"ltr\">We got a lot wrong in those early days. But if there’s one thing that was spot-on, it was Dave’s vision of building a community around 500 Startups. It was something that had never been done, at least not to this extent. And it was something that was entirely odd, especially for a VC firm. We were investors - our job was to pick winning tickets, not to build some kumbaya community. But actually, it made sense.</p>\n<p dir=\"ltr\">And what I also realized was that Dave brought me + the amazing Christine Tsai to lead this effort. Christine was building our mentor network and platform partnerships, and I was building our business development, corporate partnerships, and global events division. In addition to Dave’s constant press attention, our combined g-forces were the holy grail of his business plan to achieve massive scale and virality with minimal input.</p>\n<p dir=\"ltr\"><strong>Taking a page from the developer manifesto, Dave was hacking VC.</strong></p>\n<p dir=\"ltr\">So I thought I’d give a “backstage tour” of what’s behind the #500strong community:</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>The Core – 500 Team</strong> &gt; We’re growing exponentially and now have a sizeable team in the U.S., Mexico, Brazil, China, India, and Southeast Asia. But for the first 12 months, there were 5 of us. We had a strong core, but very minimal manpower. In fact, it was mostly woman-power. (sorry, I had to...but its true, women outnumbered the men + still do)</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Middle Layer – The Startups </strong>&gt; We invest in startups rapidly. Some of them attend the accelerator program, but many do not. They are located all over the world, so as our portfolio number rises, our community grows…and as the startups grow, so do we.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Outer Layer – The Mentors</strong> &gt; We have 250+ global mentors who help us identify, vet, and nurture our startups. Instead of pumping 500 with staff, we field a lot of data through our mentor network, many of whom co-invest on follow-ons. More importantly, they support, connect, and taut our startups, which increases the virality of the model.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Stratosphere – Events &amp; Corporate Partners</strong> &gt; Our partners bring an additional layer of education to our startups and community, and help them navigate the tricky waters of things like development, customer acquisition, scaling, hosting, operations, and more. With their support, we're able to produce conferences on topics that actually matter to startups + companies – like UnSexy (B2B startups that ain't sexy but make $), Mamabear (tech for moms, kids, + families), and Warm Gun (Design &amp; UX). Our partners include Google, GE, Qualcomm, SoftLayer, .CO, PayPal, MailChimp, Microsoft BizSpark, Amazon, and more.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Universe – The Global Startup + Tech Community</strong> &gt; This is the largest group, and possibly the most daunting to tap. But we’ve made a ton of headway through our many tech conferences and “Geeks on a Plane” (#GOAP) tours. While our conferences are topic-focused and coalesce communities in the U.S., our GOAP tours are what I call the “United Nations of Startups” and bring together 1,000+ tech geeks together in regions with massive market potential. The beauty is that each time we produce a new conference or GOAP tour, we increase that viral coefficient even more.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\">All this said, building a community is no easy feat – it was probably the most difficult, painstaking way of gaining critical mass. But it was unchartered territory, and a huge opportunity. My Partners and I have been completely overwhelmed by it at times. But again and again, I find myself in awe of the community we’ve built and the seemingly infinite ways it compounds the 500 mission.</p>\n<p dir=\"ltr\">There's a reason we often refer to our network as the \"500 family.\" <strong>Community IS 500 – it's our lifeblood.</strong> We're there for each other for the long haul, and as we host more events and invest in more startups around the world, we only get stronger.</p>\n<p dir=\"ltr\">We prefer to stay as humble today as we were on day 1, so the truth is - we don’t know the future. We can’t completely predict how the industry might shift again, and what lies ahead - no one really can. But if the past is any indication of what’s to come, I can only imagine that the #500 family will get larger, stronger, and even more community driven.</p>\n<p dir=\"ltr\">There is still a lot of work ahead of us...but every now and then, it feels so good to look back at everything we’ve achieved and be completely, utterly grateful to the people who actually built 500 – our community.</p>\n<b id=\"internal-source-marker_0.3413923825137317\"> Want to be part of the 500 family? Register for <a href=\"https://docs.google.com/a/500startups.com/spreadsheet/viewform?formkey=dHQ4TmZNMl9RNGpSSmU2cHB3bUE2c3c6MA#gid=0\">Geeks on a Plane Southeast Asia</a> and our <a href=\"http://mamabear2013.eventbrite.com/\">MamaBear conference</a>, then check out <a href=\"http://500.co/events/\">our other upcoming events</a>.</b>",
    "type": "post",
    "path": "/2013/04/03/hacking-vc-why-community-is-500s-secret-sauce/",
    "backgroundImage": "/backup/christenedited-960x540-2013-04-03-13-21-45.png"
}