{
    "title": "Harsh Realities From 500 Startups Founders",
    "slug": "harsh-realities-from-500-startups-founders",
    "date": "2010-11-04T17:19:09.000Z",
    "url": "http://blog.500startups.com/?p=1116714445",
    "uri": "http://500.co/2010/11/04/harsh-realities-from-500-startups-founders/",
    "postId": "1116714448",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "cardmunch",
        "crocodoc",
        "darien-brown",
        "ecomom",
        "erply",
        "estately",
        "gagan-biyani",
        "harsh-realities",
        "internmatch",
        "jody-sherman",
        "matthew-romaine",
        "mygengo",
        "nathan-parcells",
        "onstartups",
        "otherinbox",
        "robert-laing",
        "ryan-damico",
        "sid-viswanathan",
        "startups",
        "tj-sassani",
        "udemy",
        "wakemate",
        "yongopal",
        "zozi"
    ],
    "content": "<a href=\"http://onstartups.com\" target=\"_blank\">OnStartups</a> recently published an article entitled <a href=\"http://onstartups.com/tabid/3339/bid/17741/The-11-Harsh-Realities-Of-Being-An-Entrepreneur.aspx\" target=\"”_blank”\">“The 11 Harsh Realities Of Being An Entrepreneur.”</a> Certainly all of them hit home for anyone who’s ever tried to start a company.\n\nSo a few of the <a href=\"http://500startups.com/companies.php\" target=\"_blank\">500 Startups founders </a>decided to share real examples to back up each of these harsh realities. With all of the splashy headlines, stories, and buzz surrounding startups, very little of it serves to shine a light on the heaps of <strong>blood, sweat, and tears </strong>that go into building a company from scratch. How there are probably many more failures and mistakes than the media makes it out to be. How un-glamorous startup life really is.\n\nIf you’re feel discouraged after reading this, don't be! Rather, take comfort - especially if you’re a current founder and going through some tough times or struggling. You’re not alone!\n\nWithout further ado, here are some real stories from 500 Startups:\n\n<strong><em>Your First Iteration of an Idea Will Be Wrong</em></strong>\n“We launched at TechCrunch50 with a product focused on disposable email addresses which was far too narrow. But that led us to our Organizer product which has very broad appeal. It took too long to admit we were wrong.” (<a href=\"http://twitter.com/#!/joshuabaer\" target=\"_blank\">Joshua Baer</a>, <a href=\"http://otherinbox.com\" target=\"_blank\">OtherInbox</a>)\n\n<strong><em>Your Friends And Family Won't Understand What You Do</em></strong>\n“My mom keeps asking, when I will get a \"decent dayjob\" ;-)” (<a href=\"http://twitter.com/#!/kristjanh\" target=\"_blank\">Kris Hiiemaa</a>, <a href=\"http://www.erply.com/index.php?\" target=\"_blank\">Erply</a>)\n\n“It's not always that they don't understand, it's the unsolicited advice that gets me! When you have a little startup, every last person *without* startup experience seems eager to give you their 2 cents... it's often completely off topic or downright obvious. So I made a kind of obnoxious but useful resolution to be upfront and say \"I only take business advice from people who have already been there and done it.” (<a href=\"http://twitter.com/#!/robert_laing\" target=\"_blank\">Robert Laing</a>, <a href=\"http://mygengo.com\" target=\"_blank\">myGengo</a>)\n\n<strong><em>You Will Make Less Than Normal Wages For A While</em></strong>\n“I only realized how little I had earned during the first year of our startup when my wife and I were trying to rent a new apartment. My taxable income for 2009 was... $4,000. I was pretty shocked I had managed to survive for 11 months on basically nothing.” (500 Startups Founder who will remain anonymous)\n\n“Upon graduating, I turned down offers to make 3 to 4 times what I get paid as a founder. To be within budget I slept on a futon and had most of the furnishings for my apartment donated to me -- even still I cut into my savings and began taking on debt. One year later I still make less money on an hourly basis than the interns who get internships through InternMatch.” (<a href=\"http://twitter.com/#!/Internshipss\" target=\"_blank\">Nathan Parcells</a>, <a href=\"http://internmatch.com\" target=\"_blank\">InternMatch</a>)\n\n<strong><em>Everything Takes Twice As Long...If It Even Happens</em></strong>\n“I remember working on a 'two week' project which was a Q&amp;A section of our site... 18 months ago. It's going to launch at the end of this month. Haha.” (<a href=\"http://twitter.com/#!/robert_laing\" target=\"_blank\">Robert Laing</a>, <a href=\"http://mygengo.com\" target=\"_blank\">myGengo</a>)\n\n\"Shipping the WakeMates... 'nuff said.\" (Arun Gupta, <a href=\"http://wakemate.com\" target=\"_blank\">WakeMate</a>)\n\n<strong><em>Titles Mean Nothing. You Will Be a Janitor</em></strong>\n“In the almost two years that we've been building EcoMom, I've been the CEO, loading dock worker, fund raiser, legal clerk, delivery guy, trade show set up guy, purchasing guy, accountant, graphic artist (barely), credit card puller outer, food getter, vendor schmoozer, customer service manager, blog network coordinator, and many other titles. Each day brings a new role, to add to all of the others. And when someone calls for customer service and I say \"this is Jody\" there is almost always a long pause, which lets me know they were expecting a woman to answer the phone (makes sense since our company is called EcoMom and we serve mostly women). Some people might complain about all of the work that is outside of their job description, but I don't really think about that. I think about what it takes to get the job done and having done all of these jobs, I know what others are capable of and it makes it easy to hire for these positions, have empathy for the people who are taking on these roles, and allows me to pitch in when things get overwhelming.” (<a href=\"http://twitter.com/#!/ecomomceo\" target=\"_blank\">Jody Sherman</a>, <a href=\"http://ecomom.com\" target=\"_blank\">EcoMom</a>)\n\n“As the weakest-nosed member of Estately's founding team, I was de facto Chief Janitorial Officer (in addition to CEO) in charge of taking out the trash 48-72 hours after it had fully matured. I also vacuumed our old offices every 3-6 months to conserve cash (because you need a break from mental work every so often). I also paid myself as much as a non-unionized janitor, but union wages are now here to stay!” (<a href=\"http://twitter.com/#!/galenward\" target=\"_blank\">Galen Ward</a>, <a href=\"http://estately.com\" target=\"_blank\">Estately</a>)\n\n“Everyone in our startup takes out the trash on weekly rotation. As CTO, I must make the phone-call to order the custom municipal trash bags when we run out (this is Japan...).” (<a href=\"http://twitter.com/#!/quanza\" target=\"_blank\">Matthew Romaine</a>, <a href=\"http://mygengo.com\" target=\"_blank\">myGengo</a>)\n\n<strong><em>There Is No Silver Bullet</em></strong>\n“Pitching to investors and customers puts you in this mode of explaining everything away as a total breeze... \"Oh yeah we'll use AdWords, we'll get $2 back for every $1 we spend\" etc. Bullshit. I can't actually think of anything that was easy. But at least you know it's just as hard for your competitors.” (<a href=\"http://twitter.com/#!/robert_laing\" target=\"_blank\">Robert Laing</a>, <a href=\"http://mygengo.com\" target=\"_blank\">myGengo</a>)\n\n<strong><em>Customers Will Frustrate You\n</em></strong>“We were once on a video call with a customer who pointed a .44 Magnum at his head and then at the screen after a comment we made. He ended up being our first paying customer.” (<a href=\"http://twitter.com/#!/gaganbiyani\" target=\"_blank\">Gagan Biyani</a>, <a href=\"http://udemy.com\" target=\"_blank\">Udemy</a>)\n\n“Our market is in Korea and cultural differences completely permeate the web culture. We were frustrated to discover that Korean web users don't actually know the URLs to their most-used web services; they go to a Korean search engine and search for it *every single time.* Ranking on Korean search engines costs a *lot* of money, so we don't rank. Some of the early users of our service who signed up never came back because they could never find it again.” (<a href=\"http://twitter.com/#!/darienbrown\" target=\"_blank\">Darien Brown</a>, <a href=\"http://yongopal.com\" target=\"_blank\">YongoPal</a>)\n\n<strong><em>You Can't Do It All Yourself</em></strong>\n“After getting rejected by Y Combinator in 2008, my soon-to-be co-founders couldn't take on the risk. I decided to do it myself, and ran out of steam (and moral support) after about 12 months and decided to fold.” (<a href=\"http://twitter.com/#!/sidviswanathan\" target=\"_blank\">Sid Viswanathan</a>, <a href=\"http://cardmunch.com\" target=\"_blank\">CardMunch</a>)\n\n“Anyone can delegate stuff they don't like doing. What's hard is delegating things you *like* doing.” (<a href=\"http://twitter.com/#!/robert_laing\" target=\"_blank\">Robert Laing</a>, <a href=\"http://mygengo.com\" target=\"_blank\">myGengo</a>)\n\n“We have had extraordinary support from friends, family and mentors who believed in us and our company from very early on. Some chose to make introductions to people at the top of their network before we even had a landing page and which propelled our company forward, others lent us their homes and cars as we came to work in a new city. All have given us the motivation to push through the challenges and scary moments while building InternMatch from the ground up.” (<a href=\"http://twitter.com/#!/Internshipss\" target=\"_blank\">Nathan Parcells</a>, <a href=\"http://internmatch.com\" target=\"_blank\">InternMatch</a>)\n\n<strong><em>Building A Team Is Hard\n</em></strong>“The phrase ‘Good people are hard to find’ is quite an understatement. I spent three years going through ten people and two founding teams before finding a set of co-founders who really clicked. When that happened, the difference was like night and day. There's no more valuable asset for a startup than its founders, and it's worth doing whatever it takes to find the right people.” (Ryan Damico, <a href=\"http://crocodoc.com\" target=\"_blank\">Crocodoc</a>)\n\n“When I was bootstrapping, I was overjoyed to find a human being that would support me. But the skills and attitude you need from someone very early on are often completely different from the skills you need to build a business long term. You realize quickly that people who may have been instrumental in the early stage of the company can actually become dead weight when you reach a certain size, because they haven't changed with the company. It's really painful to remove them, but necessary for the company.” (500 Startups Founder who will remain anonymous)\n\nFinally, this wasn’t part of the original OnStartups list but it was contributed by one of our founders as #12:\n\n<strong><em>You will LOSE all of your hard earned money (and probably a bunch that you still haven't earned).  If you’re not prepared to put it all on the line (financially, personally, relationships, and more), you’re not prepared for a startup.</em></strong>\n\"The economy tanked, we ran out of money, and still didn’t have the “right” model figured out. The whole team of ten had already gone more than two months without any pay, vendors were waiting for payment, and still no funding in sight. Because of my unwavering belief in our vision (and opportunity) and personal support with my own resources, I had spent much of my savings.  Continuing the trend, I brought in $30,000 in cash one day and handed it out in envelopes to the entire team evenly to get us through the next six weeks. Just over one year later we’re rapidly closing in on profitability, have signed half a dozen meaningful partners, and are on track to build what I believe is a billion dollar company.\" (<a href=\"http://twitter.com/#!/tjx\" target=\"_blank\">TJ Sassani</a>, <a href=\"http://zozi.com\" target=\"_blank\">Zozi</a>)",
    "type": "post",
    "path": "/2010/11/04/harsh-realities-from-500-startups-founders/"
}