{
    "title": "Health, Wealth, & Startups: Tapping Qualcomm Ventures’ $100 Million Fund",
    "slug": "health-wealth-startups-tapping-qualcomm-ventures-100-million-fund",
    "date": "2013-04-05T01:57:53.000Z",
    "url": "http://500.co/?p=1116726705",
    "uri": "http://500.co/2013/04/04/health-wealth-startups-tapping-qualcomm-ventures-100-million-fund/",
    "postId": "1116726705",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "guest-posts",
        "health",
        "healthcare",
        "investors",
        "qualcomm-ventures"
    ],
    "content": "<p dir=\"ltr\">Spurred by new regulations, astronomical systematic costs, and a population that seems to be getting sicker and sicker, the healthcare space is going through major changes. Jack Young heads up the $100M <a href=\"http://www.qualcommlife.com/qualcomm-life-fund\" target=\"_blank\">Qualcomm Life Fund (QLF)</a> at Qualcomm Ventures, which was recently ranked as one of the most prolific venture investors in the digital health sector.</p>\n<p dir=\"ltr\">Check out what Jack has to say about how startups are being affected by new regulations, key trends he’s seeing for emerging opportunities, and how he decides whether to pull the trigger on a startup investment.</p>\n<strong>What’s happening in the healthcare industry, and how is it affecting startups?</strong>\n<p dir=\"ltr\">Traditionally health care in the US has been a “fee-for-service” model. Under this system, providers often focus on quantity of care based on payment, rather than quality of care. However, the health care reform laws passed in 2010 (otherwise known as “ObamaCare”) aim to extend insurance coverage to all citizens, while curtailing the growth in health care spending. This mandate combined with the fact that US health care costs already account for  ~18% of the GDP (which is the highest among the OECD countries, and is projected to continue trending higher), is challenging that status quo.</p>\n<p dir=\"ltr\">While investment in the digital health space has increased significantly over the past few years, it’s still extremely challenging for early stage digital health startups to raise capital. There are far fewer routes to explore compared to the digital/social media space where angel/super angel funding is more readily available from alumni networks of Google, Paypal, LinkedIn, Facebook and a number of high profile incubators such as Y-combinator and Techstars. The current challenges are likely to persist as there appear to be few, if any, blockbuster VC-backed exits on the horizon in the digital health space which could unleash capital to be reinvested in the ecosystem.</p>\n<p dir=\"ltr\"> The risk and the reward for startups in the medical space have never been higher.</p>\n<p dir=\"ltr\"><strong>Are there any regions that are booming in the digital health sector?</strong></p>\n<p dir=\"ltr\">Outside the US and Canada, many industrialized nations are fertile grounds for digital and wireless health innovation and adoption. A few nations in particular, such as the UK, Sweden and Australia are particularly ripe for deployment; they are already focused on cutting costs and have the power to implement new technologies.</p>\n<p dir=\"ltr\">In developing countries, access to mobile phones in some cases exceeded access to clean water. Wireless health technologies promise unprecedented reach and cost benefit to some of the neediest populations. For example, vision examination can now be performed with an attachment device to a smartphone by a technician with minimum training in the field, which gives people access to prescription glasses for the first time. Blood lab tests are being developed with cartridges linked to a smartphone without the need for shipping to a laboratory or cold storage. And tools are being developed so counterfeit drugs may be identified using short-code text messaging.</p>\n<p dir=\"ltr\"><strong>What do you look for when investing or partnering with a company?</strong></p>\n<p dir=\"ltr\">In addition to the conventional VC investor checklist, there are three key factors we think about:</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Solution with mass market appeal:</strong> At Qualcomm, we have had success on a large scale and look for our investment opportunities to have the same potential. We are less inclined to fund a company tailored to an orphan disease or niche areas.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Balance of Life Sciences and IT:</strong> We believe new technologies will breathe new life into existing medical  services through insights from patient data. For example, diabetes management used to be a lonely personal endeavor, but now with connected glucose meters and insulin injection devices, patients and their caretakers can manage this condition much more proactively. This does not require a new glucose sensing technology to be introduced, or a new type of insulin to be approved, but can still totally change the way the disease is managed.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Revenue traction:</strong> Convincing a single health care provider to pay and deploy your solution (not a pilot or a trial) to alleviate one of their top pain points is a giant step for many startups. We’ve limited our scope to revenue-generating stage companies as our primary investment target.</p>\n<strong>What are 3 pieces of advice you can give to bootstrapped entrepreneurs trying to get their business off the ground?</strong>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong> Focus on the business:</strong> Health care is challenging due to extremely long buying cycles and misaligned interests between payers/providers/patients, and understanding this system is paramount to success. An entrepreneur also needs to address a particular pain point and create the right incentives for everyone involved (payors, providers and patients) for a product to be successful. In health care, technology is often the easy part. Finding a way to get people to adopt your product is the real challenge.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Have a Well-Rounded Team:</strong> Building a successful digital health company requires expert knowledge in both tech and healthcare. This applies to the executive team and staff, investors, board and advisory members.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Timing is everything:</strong> Many companies that have tried to address issues in health care have failed – some due to technology, but many due to lack of understanding of the drivers and the right timing. Since policy and regulations constantly change, an entrepreneur in this space needs to time the market entry point very carefully.</p>",
    "type": "post",
    "path": "/2013/04/04/health-wealth-startups-tapping-qualcomm-ventures-100-million-fund/",
    "backgroundImage": "/backup/Jack-Young-Feb13b-960x540-2013-04-04-13-19-57.jpg"
}