{
    "title": "Highlights from our \"Design a Healthy Startup\" Event",
    "slug": "highlights-from-our-designing-a-healthy-startup-event",
    "date": "2011-07-01T03:43:46.000Z",
    "url": "http://blog.500startups.com/?p=1116715610",
    "uri": "http://500.co/2011/06/30/highlights-from-our-designing-a-healthy-startup-event/",
    "postId": "1116715610",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/06/500-daily-031-smaller-1024x685.jpg",
        "http://500.co/wp-content/uploads/2011/06/500-daily-044-209x300.jpg",
        "http://500.co/wp-content/uploads/2011/06/flier22-300x75.png",
        "http://500.co/wp-content/uploads/2011/06/500-daily-016-203x300.jpg",
        "http://500.co/wp-content/uploads/2011/06/500-daily-037-smallet-300x212.jpg"
    ],
    "creator": "",
    "categories": [
        "burnout",
        "events",
        "health",
        "health",
        "startups",
        "uncategorized",
        "wellness",
        "wellness"
    ],
    "content": "Many you attended our event this past Saturday, “Design a Healthy Startup: Prevent Burnout” which was all about designing sustainable behaviors and company cultures for startup success.  We heard from speakers who have experience in large corporations like Gopi Kallayil, from <a href=\"http://www.google.com/\">Google</a> and Brett Terrill from <a href=\"http://www.zynga.com\">Zynga</a>. We also got wellness tips from Dr. Neha Sangwan, a leading corporate health strategist and wellness coach. And we saw some cool demos from some hot new startups in the wellness and consumer health space like Jen McCabe at <a href=\"http://www.healthmonth.com\">HealthMonth</a>, Aleksey Novicov from <a href=\"http://www.tonicselfcare.com\">Tonic,</a> Karan Ramchandani from <a href=\"http://www.fitsquid.com\">FitSquid</a> and Jordy Mont-Reynaud from <a href=\"http://www.dojo.com\">Dojo</a>.  Below are some highlights from the day.\n\n<a href=\"http://500.co/wp-content/uploads/2011/06/500-daily-031-smaller.jpg\"><img class=\"alignright size-large wp-image-1116715614\" title=\"SONY DSC\" src=\"/backup/500-daily-031-smaller-1024x685-2011-06-30-11-22-43.jpg\" alt=\"\" width=\"500\" height=\"334\" /></a>\n\n<strong>How do we design a healthy startup</strong>\nEnrique Allen, founding designer at 500 Startups, suggested that we think of our startup's health as a function of values, the behavior that expresses those values, and the norms that culminate to become your culture. Start by thinking about how you can manipulate your health equation at the personal level, then expand outward to your team, company, and the surrounding environment.\n<div id=\"__ss_8475120\" style=\"width: 425px;\"><strong style=\"display: block; margin: 12px 0 4px;\"><a title=\"Design a Healthy Startup: Prevent Burn Out Intro\" href=\"http://www.slideshare.net/EnriqueAllen/design-a-healthy-startup-prevent-burn-out-intro\">Design a Healthy Startup: Prevent Burn Out Intro</a></strong><object id=\"__sse8475120\" width=\"425\" height=\"355\"><param name=\"movie\" value=\"http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=designahealthystartupv2-110630205145-phpapp02&amp;stripped_title=design-a-healthy-startup-prevent-burn-out-intro&amp;userName=EnriqueAllen\" /><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowScriptAccess\" value=\"always\" /><embed type=\"application/x-shockwave-flash\" width=\"425\" height=\"355\" src=\"http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=designahealthystartupv2-110630205145-phpapp02&amp;stripped_title=design-a-healthy-startup-prevent-burn-out-intro&amp;userName=EnriqueAllen\" name=\"__sse8475120\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>\n<div style=\"padding: 5px 0 12px;\">View more presentations from <a href=\"http://www.slideshare.net/EnriqueAllen\">Enrique Allen</a>.</div>\n</div>\n<strong>First of all, what is burnout?</strong>\nFor Dr. Neha Sangwan, burnout equals cynicism plus exhaustion plus ineffectiveness. She defined cynicism as a state in which you start feeling negative and your personal values no longer align with your actions. She also explained that burnout signals are difficult to pick up on by others so each person should make an effort to learn about their own symptoms and recognize when they need a break. To push your startup and lead your teammates effectively, you have to be at your best personally.  Sleep deprivation, long hours and unhealthy eating habits are the fast lane to burnout. Also, small “unnoticeable” slips add up and can lead you to burnout when you least expect it. Working longer-than-normal hours or going to work sick will not earn you a badge of honor.\n\n<strong>Lead personally</strong>\nIf you are constantly on the verge of being burnedout, most likely your employees will be too. Gopi Kallayil from <a href=\"http://www.google.com\">Google</a> talked about the human aspect of being a leader. He emphasized that you cannot lead others unless your are grounded yourself.   He listed 5 principles of leadership:\n<ul>\n\t<li>Purpose - Pick the job that <a href=\"http://500.co/wp-content/uploads/2011/06/500-daily-044.jpg\"><img class=\"alignright size-medium wp-image-1116715613\" title=\"SONY DSC\" src=\"/backup/500-daily-044-209x300-2011-06-30-11-22-43.jpg\" alt=\"\" width=\"209\" height=\"300\" /></a>gives you the most meaning and context</li>\n\t<li> Egalitarian/Equality - Make everyone an equal, set up your culture and seating area so that there are no executive offices and everyone is accessible to each other.</li>\n\t<li> Authenticity - Don't be phony, lead from your center and your true self.</li>\n\t<li> Humanity - Human beings come to work with you everyday, get to know their stories and meet their family and parents. One effective tip: run team meetings by starting exercise around something that is personal like a story from the weekend.</li>\n\t<li>Humility - Be humble and in gratitude everyday as it sets a tone for everyone at the company.</li>\n</ul>\nGopi closed his talk by saying that as a manager or a startup founder, it is your job to bring out the highest potential of everyone on your team and at your company.  Remember that as you lead on a day-to-day basis.\n\n<strong>Live your brand - especially if you are a wellness company</strong>\nSeveral speakers spoke about the need to embody your company’s brand , especially with VC road shows or new customers. If you look or feel unhealthy, chances are your product and company are in an unhealthy state too. Scott Hublou, Co-Founder of <a href=\"http://www.ecofactor.com\">EcoFactor</a> reminded the audience that as a founder of a startup you must remember that you are selling your company and product at all times.  He said, “your passion and vision is what gets you in the door and possibly funded with VCs.\" With regards to living the brand within the doors of your company, Jen McCabe from <a href=\"http://www.healthmonth.com\">HealthMonth</a> shared that her startup uses a personal metrics system to share how employees are doing on a personal level with the rest of the team. This allows her teammates to support each other effectively and to prevent burnout.\n\n<strong>Engage &amp; prioritize</strong>\nA key to increasing your productivity without increasing your time commitment is to be fully engaged in each moment. Jared Goralnick, Founder of <a href=\"http://www.awayfind.com\">AwayFind</a> reinforced the Pareto Principle, 20% of your activities lead to 80% of your results. So prioritizing the most important tasks and focusing on each one is crucial to achieving your long-term objectives. One strategy is to work 50 minutes and take a 10 minute break every hour as this will allow you to maintain consistent focus without suffering burnout. And do one thing at a time! This will allow you to get things done faster – since you won’t lose time transitioning from one task to another and are less likely to get distracted in the middle.  Jared’s slides are available <a href=\"http://www.slideshare.net/technotheory/run-your-startup-be-happy-dont-die\" target=\"_blank\">here</a>.\n\n<strong>Take time for yourself</strong>\nDedicate 1 minute a day to do an activity <a href=\"http://500.co/wp-content/uploads/2011/06/flier22.png\"><img class=\"alignright size-medium wp-image-1116715618\" title=\"flier2\" src=\"/backup/flier22-300x75-2011-06-30-11-22-43.png\" alt=\"\" width=\"176\" height=\"44\" /></a>that fulfills you. Gopi from <a href=\"http://www.google.com\">Google</a> shared that he takes 1 minute a day to meditate and practice yoga and out of habit that 1 minute has evolved into 20 minutes to an hour. It is much more likely that you will stick to doing something for one minute each day than a longer session. He recommends that we “Friend” ourselves and make appointments for mindfulness everyday.  In our demo section of the day, we saw how good design and new startup technology are helping us set up and monitor our personal wellness goals.  This was seen in the <a href=\"http://www.dojo.com\">Dojo</a> demo where “friends can help one another on the path to mastery.”  Also in starting or keeping a meditation practice, there are many new tools that can connect you with others who can support you in your goal. <a href=\"http://meditate.ly\">Meditate.ly</a>, for example, lets you create and join online meditation rooms (with optional guided meditations) to meditate with your friends or new people who also want to start a practice.\n\n<strong>Family balance</strong>\nScott Hublou, Co-Founder of <a href=\"http://www.ecofactor.com\">EcoFactor</a> shared  that he does not sacrifice his relationship with his kids for anything. He recommends keeping a 24-hour calendar where you block off family time that no one can schedule over. He emphasized that the most important thing is getting the work done, not spending long hours in the office. He makes a point of spending time with his kids before they go to sleep and then he gets back online later at night.  He also talked about having his kids grow up in a culture of entrepreneurial spirit, so his kids often visit him at work and are known to everyone at his company.\n\n<strong>Stay positive</strong>\nRon Gutman, CEO and Founder of <strong> </strong><strong><a href=\"http://500.co/wp-content/uploads/2011/06/500-daily-016.jpg\"><img class=\"alignright size-medium wp-image-1116715616\" title=\"SONY DSC\" src=\"/backup/500-daily-016-203x300-2011-06-30-11-22-43.jpg\" alt=\"\" width=\"203\" height=\"300\" /></a></strong><a href=\"https://www.healthtap.com/\" target=\"_blank\">Healthtap</a>,<strong> </strong> told us th<strong> </strong>at one smile is <strong></strong>stimulating the brain as much as $25,000 in cash. Smiling and being positive are excellent for our own bodies as well as for the people who surround us. Ron talked about the three P’s: positivity, purpose and prioritizing as a guide in our everyday routines. (More info about his talk <a href=\"http://blog.healthtap.com/2011/06/ted-video-the-untapped-powers-of-smiling/\">here</a>). Also, Bret Terrill, formerly from <a href=\"http://www.zynga.com\">Zynga</a>,  introduced the idea of \"right speech,\" that you only say things that are positive.  Borrowing from the Zen tradition, he spoke of letting go of the outcome and staying present in the moment.  He assured the audience that getting acquired as a young startup does not always equal happiness or less stress. Even with $15M in the bank, an entrepreneurial personality will want to ride the roller-coaster again. He spoke about focusing more on enjoying the ride and recommended that everyone read the book Its Easier than You Think by Sylvia Boorstein.\n\n<strong>Breathe</strong>\n<a href=\"http://500.co/wp-content/uploads/2011/06/500-daily-037-smallet.jpg\"><img class=\"size-medium wp-image-1116715615 alignleft\" title=\"SONY DSC\" src=\"/backup/500-daily-037-smallet-300x212-2011-06-30-11-22-43.jpg\" alt=\"\" width=\"300\" height=\"212\" /></a>When we’re super stressed or crunching for a deadline, the first thing to feel it is right under our noses, literally, our breath. It sounds so simple yet we go through most of our day without noticing how we’re breathing. Maria Molfino, a yoga instructor from <a href=\"http://us.yesplus.org/\">yesplus</a>, suggests the relationship between breath and our stress is a two-way street: we can change our stress levels by changing our breath. During one of the more experiential portions of the event, she taught the audience simple breathing techniques to quiet the mind. Each technique took about two minutes. She also suggested taking 5 minutes to stretch (with breath and awareness, i.e., yoga) the major problem areas in your body from sitting at the computer and hacking all day: neck, shoulders, hamstrings, hips, IT band, and lower back.\n\nSo those are some of the highlights of the day.  Stay tuned for our next event where we will focus on food for startups! More details to come. Thank you to <a href=\"http://www.linkedin.com/pub/missy-krasner/2/153/bb6\">Missy Krasner</a>, formerly of <a href=\"http://www.google.com/intl/en-US/health/about/\">Google Health</a> for moderating our panel and Maria Susana Camino for organizing.  A special shout out to our sponsors <a href=\"http://www.coupacafe.com\">Coupa Café</a> and <a href=\"http://www.sanfranolagranola.com\">San Franola</a> for providing us with delicious and healthy snacks throughout the day.",
    "type": "post",
    "path": "/2011/06/30/highlights-from-our-designing-a-healthy-startup-event/"
}