{
    "title": "How Preview Day Taught Me to Be Human",
    "slug": "how-preview-day-taught-me-to-be-human",
    "date": "2013-02-06T02:18:02.000Z",
    "url": "http://500.co/?p=1116725321",
    "uri": "http://500.co/2013/02/05/how-preview-day-taught-me-to-be-human/",
    "postId": "1116725321",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/02/Screen-Shot-2013-02-05-at-11.43.59-AM.png"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "chewse",
        "founders",
        "pitching",
        "preview-day"
    ],
    "content": "<strong><em>Tracy Lawrence is the CEO of <a href=\"https://www.chewse.com/\" target=\"_blank\">Chewse</a>, a B2B marketplace for corporate meals. Chewse has catered 20,000 meals to hungry offices that include Wells Fargo, PWC, and Cornerstone. Being from Los Angeles, she went to USC and is a proud Trojan, vegetarian, and lover of all desserts. <a href=\"http://500.co/2013/02/04/watch-500-startups-demo-days-live-this-week/\" target=\"_blank\">Watch her pitch live with the rest of Batch 5 later this week.</a></em></strong>\n\nPreview Day is a private event here at 500 Startups that involves a bonanza of 30-second pitches from portfolio companies (including my startup, Chewse, <em id=\"__mceDel\"><a href=\"https://angel.co/chewse\">please follow us on AngelList</a>). I’ve learned a lot from the </em><em id=\"__mceDel\"><em id=\"__mceDel\"><em id=\"__mceDel\">preparation process – mainly the importance of being a lot more human and </em></em></em><em id=\"__mceDel\"><em id=\"__mceDel\"><em id=\"__mceDel\"><em id=\"__mceDel\">open to fuck-ups.</em></em></em></em>\n\n<a href=\"/backup/Screen-Shot-2013-02-05-at-11-43-59-AM-2013-02-05-13-20-18.png\"><img class=\"size-full wp-image-1116725329 aligncenter\" alt=\"Screen Shot 2013-02-05 at 11.43.59 AM\" src=\"/backup/Screen-Shot-2013-02-05-at-11-43-59-AM-2013-02-05-13-20-18.png\" width=\"392\" height=\"523\" /></a>\n\n<b id=\"internal-source-marker_0.58021523617208\">Learning to be vulnerable for Preview Day</b>\n\nFor the past 2 weeks, my 500 Startups batchmates and I launched into preparation for Demo Day – what I think of as “graduation from startup school.” 500 Startups does an incredible job of rounding up the tribe of mentors, LPs, and investors to drop into the space and offer us constructive feedback on our pitches.\n\nOkay, that’s the nice way to put it.\n\nIt actually feels like a relentless barrage of heat-seeking missiles aimed at all your weaknesses. It feels like kryptonite condensed into cough syrup that is then less-than-lovingly shoved down your throat.\n\nI embellish slightly, but only to illustrate how much the process wears on you personally as a founder. I heard a mentor tell a founder that he shouldn’t be the person to pitch his own company. I was personally told at one time that I wasn’t telling my best story. Can you imagine how all these criticisms about your pitch end up feeling like reflections of you?\n\n<strong>So here’s the secret: As a founder, you must learn to open up instead of closing off.</strong>\n\nAt many points of the process of pitching and fundraising, you feel like a rag doll volleying between bits of advice. But ultimately, you have to embrace feedback, come to terms with your emotions, and be real. It makes you human. People like to work with humans, investors like to invest in humans, and being relatable is an important piece of building charisma.\n\n<strong>Being brave means being human</strong>\n\nI was blown away the first time I watched Brené Brown's TED talk on <a href=\"http://www.ted.com/talks/brene_brown_on_vulnerability.html\">The Power of Vulnerability</a> -- and I'm still learning things each time I watch it.\n\nBIG takeway: Being vulnerable and being courageous are not mutually exclusive. In fact, being vulnerable is incredibly brave.\n\nAs entrepreneurs, we are vulnerable to risk, inexperience, and failure. I especially relish the story of the original Zappos founder walking into shoe stores and being laughed at for suggesting that he could sell off the majority of their inventory just by posting it online. Or how the Yelp crew took to the streets to sign people up by hand with a good old-fashioned clipboard. And how it took them <a href=\"http://www.businessinsider.com/jeremy-stoppelman-on-early-days-of-yelp-2012-11\">8 years to IPO</a>.\n\nBrown points out that the word “courage” is based on the Latin root cor -- which means \"heart.\" Being courageous is not being the fearless leader who can charge into a room, hide all emotion, and lead stoically. In fact, it's the person who can embrace the fear of being vulnerable and tell the story of who she is with her whole heart -- that's the brave one.\n\n<strong>How an Argentine taught me to dance (of course!!!)</strong>\n\nOne moment in particular sort of zapped the human back into me. The other founders and I are backstage doing a dress rehearsal for Preview Day at the 500 offices. The views overlooking the South Bay were stunning, the event music bumping, and I’m sitting in the back...looking ready for an earthquake to hit. In all honesty, I looked pretty stern getting my game face on.\n\nEnter Ricardo, the founder of <a href=\"http://www.femeninas.com/\">Femeninas</a>. He’s from Argentina, has a classic Latin accent, and he’ll tell you just what he knows about Spanish-speaking women (you have to see his pitch to understand). He doesn’t just look calm – his whole face is lit up. He’s certainly nervous, but you can tell he’s damn well going to have fun with it.\n\nHe notices my stonewall expression and tries to make me laugh. I’m trying to be the zenith of calm here, the Buddha of the Bay, and he’s trying to break my focus. But his smile was pretty damn infectious. And smiling is <a href=\"http://youtu.be/Ta9K22D0o5Q?t=3m41s\">definitely worth it</a>.\n\nThat’s when I realized I was making a desperate attempt to be stoic and emotionless – that’s not even human, it’s not even me! I woke up, popped up, hopped around. I just gave in.\n\nThe end result? I didn’t just walk on stage for Preview Day, I danced onstage…with 100 investors watching.\n\n<strong>Getting heated is hot</strong>\n\nIt’s okay to get a little nervous, it’s great to show passion, it’s ideal to embrace being human.\n\nI share this story not *just* to be self-deprecating, but hopefully to give you the safety line of humanity to hold onto when things get rough. It’s a safety rope, people, not the third rail.\n\nSo the next time I pitch my startup or coach another, expect me to be a little heated, a little passionate, and thoroughly human.\n\n<strong>Many thanks in the Preview Day pitch process to my two North Stars: <a href=\"http://twitter.com/jeffschenck\" target=\"_blank\">Jeff, my co-founder</a>, and <a href=\"https://twitter.com/khailee\" target=\"_blank\">Khailee</a>, 500's Entrepreneur-in-Residence. These two worked countless hours with me to quell my fears, challenge my assumptions, and offer a solid hug when the time came to go on-stage.</strong>",
    "type": "post",
    "path": "/2013/02/05/how-preview-day-taught-me-to-be-human/",
    "backgroundImage": "/backup/tracy-2013-02-05-13-20-18.jpg"
}