{
    "title": "How to Suck Less at E-mail Marketing",
    "slug": "how-to-suck-less-at-e-mail-marketing",
    "date": "2013-08-13T16:27:51.000Z",
    "url": "http://500.co/?p=1116729191",
    "uri": "http://500.co/2013/08/13/how-to-suck-less-at-e-mail-marketing/",
    "postId": "1116729191",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/08/babybear.gif",
        "http://500.co/wp-content/uploads/2013/08/8-13-2013-8-28-40-AM.png",
        "http://500.co/wp-content/uploads/2013/08/cheer1.gif"
    ],
    "creator": "",
    "categories": [
        "distribution",
        "distribution-tuesday",
        "email",
        "email-marketing",
        "landing-pages",
        "mailchimp"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em>\n\nYou suck at e-mail marketing.\n\nThat’s OK though; many companies, especially early-stage ones, also suck just as badly. So winning in your space in some cases may simply be about sucking less than your competitors do. While social media sites and marketing tricks come and go, e-mail has remained a consistent driver of growth for start-ups. To that end, here's a few recommendations to help:\n\n<b>Start Early</b>\n\n<img class=\"aligncenter size-full wp-image-1116729207\" alt=\"babybear\" src=\"/backup/babybear-2013-08-13-13-11-27.gif\" width=\"497\" height=\"280\" />\n\nYou can never start early enough when it comes to collecting e-mail addresses. This is probably the most important tactic to nail. Growing a good e-mail list is going to take more time than any other task will. Therefore, the earlier you start the better. If you can gather up a few thousand qualified e-mails pre-launch, you’ll find it much easier to get your business off the ground.\n\nThose early e-mails of course might be the toughest ones to get. You may need to really claw and hustle to put them together. To get started, I recommend running contests (<a href=\"http://www.rafflecopter.com/\">Rafflecopter</a> and <a href=\"http://sverve.com/\">Sverve</a>); even though they’re not always very pretty, they do get the job done. Next, I would test landing pages (<a href=\"http://launchrock.co/\">Launchrock</a> and <a href=\"http://unbounce.com/\">Unbounce</a>) and small marketing campaigns that collect e-mails. Finally, don’t forget to “look in the couch cushions.” By that, I mean take all those business cards, e-mails addresses written on napkins, old databases you stole from your last job, and so on. Consolidate all of that data early on before it gets lost.\n\n<b>Double the Frequency</b>\n\nMany companies has asked me, “How often should I e-mail my users?” The correct answers varies based on your business and demographic, but a good rule of thumb is about twice as often as you think you should. Yes, you should probably be doubling the number of e-mails you send, especially to users who have yet to convert or take the action you need them to take.\n\nThink about companies that send a lot of e-mail. LinkedIn and Facebook might come to mind immediately. Of course, they are both considered social networks, so they likely have more reason to e-mail you. Still, they send a fuck-ton of e-mail and make a bigger fuck-ton of money. Related? What is likely an annoying amount of e-mail to you, the techie, is an acceptable volume for more mainstream users.\n\n*Of course, if you have users who have converted and/or taken a preferred action, you may want to actually reduce their overall e-mail volume. Don’t turn their e-mail off completely, but in these cases, don’t bug these customers more than necessary.\n\n<b>Set Up Autoresponders</b>\n\nIf you’re a later-stage company that has already dialed all your drip campaigns and trigger e-mails, good for you. Take some time to pat yourself on the back and revel in how much you don’t suck. For everyone else, it’s time to set up some quick autoresponders. These are time-released e-mails that go out to all (or part of) your e-mail list at times you designate. It’s incredibly powerful and automated and is often ignored by most early-stage companies.\n\nThe simplest way to get started is to utilize <a href=\"http://kb.mailchimp.com/article/how-do-i-create-an-autoresponder\">Autoresponders in MailChimp</a>. If this is all brand new to you, then I recommend setting up a simple 30-day cycle of e-mails. For example, think of four to five e-mails you want all your users to get after they sign up for your website. Here are a few use cases/examples to get you started.\n<ul>\n\t<li>Welcome Letter from the Founder</li>\n\t<li>Follow us on Facebook</li>\n\t<li>Complete On-Site Action</li>\n\t<li>Invite a Friend</li>\n\t<li>Coupon for E-commerce Site</li>\n\t<li>Product Marketing Feature Highlight</li>\n</ul>\nFor each autoresponder e-mail, I also recommend utilizing a very clear and single CTA (call to action). Don’t dilute the message with other things and keep the recipient laser focused on the task at hand. Remember you can send multiple e-mails with this method. So don’t try to cram multiple requests into a single e-mail. The below mock-up is roughly the ideal format for autoresponder e-mails. Yours may vary, so go ahead and test multiple layouts and subjects to be sure.\n\n<img class=\"aligncenter size-full wp-image-1116729193\" alt=\"8-13-2013 8-28-40 AM\" src=\"/backup/8-13-2013-8-28-40-AM-2013-08-13-13-11-27.png\" width=\"563\" height=\"692\" />\n\n<b>Get All NSA on Your E-mail List</b>\n\nE-mails are interesting because they can often serve as a unique identifiierfor a user. From there, you can learn all kinds of interesting things. Yes, privacy is sort of dead unfortunately, but that’s also good news for online marketers.\n\nTo start with, you might want to consider a data service like <a href=\"http://www.rapleaf.com/\">Rapleaf</a>. It’s been an industry secret for many marketers and had its own share of controversy and changes to its business . Today, however, it offers a fairly straightforward way to learn more about your users based on their e-mail addresses.\n\nYou can upload your data and get a ton of demographic information that you can then reimport back into your ESP (e-mail service provider). From here, you can do all types of interesting segmentation to dramatically improve your campaign’s performance and engagement. This could be a simple gender split test or you could use the zip code data for regional targeting.\n\n<b>Be Aggressive, B-E Aggressive</b>\n\n<img class=\"aligncenter size-full wp-image-1116729203\" alt=\"cheer1\" src=\"/backup/cheer1-2013-08-13-13-11-27.gif\" width=\"497\" height=\"280\" />\n\nI know that you love your users/members/customers. We get that. You want to cuddle them and never ever, ever bug them. Totally understand that.\n\nConsequently, being too aggressive on e-mail marketing probably feels like the last thing you want to do. At the same time, I see a great number of companies love and cuddle their users so much that the companies never gain any more . Of course, there’s no need to be spammy and jerky about it, but please, don’t feel too bad stepping up your e-mail game, especially early stage. Just hit that send button when you need to.",
    "type": "post",
    "path": "/2013/08/13/how-to-suck-less-at-e-mail-marketing/",
    "backgroundImage": "/backup/yousuck-960x540-2013-08-13-13-11-27.jpg"
}