{
    "title": "How We Acquired 400,000 Subscribers And What You Didn't Know About Email",
    "slug": "how-we-acquired-400000-subscribers-and-what-you-didnt-know-about-email",
    "date": "2012-11-28T23:30:41.000Z",
    "url": "http://500.co/?p=1116724337",
    "uri": "http://500.co/2012/11/28/how-we-acquired-400000-subscribers-and-what-you-didnt-know-about-email/",
    "postId": "1116724337",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "accelerator",
        "distribution",
        "email",
        "sree-vijaykumar",
        "tradebriefs"
    ],
    "content": "<em>Sree Vijaykumar is the founder of <a href=\"https://angel.co/tradebriefs?save_req=mention_slugs\" target=\"_blank\">TradeBriefs</a>, which helps every professional become an industry expert through daily email newsletters. TradeBriefs is in our current accelerator batch at 500 Startups. Previously, Sree also co-founded </em><em><span style=\"text-decoration: underline;\">All India Retail</span> and worked at <a title=\"Deloitte\" href=\"https://angel.co/deloitte?save_req=mention_slugs\" target=\"_blank\">Deloitte</a>, <a title=\"IBM Global Business Services\" href=\"https://angel.co/ibm-global-business-services?save_req=mention_slugs\" target=\"_blank\">IBM Global Business Services</a>, and i2 Technologies. He s</em><em>tudied <a href=\"https://angel.co/carnegie-mellon-university?save_req=mention_slugs\" target=\"_blank\">Carnegie Mellon</a>, <a href=\"https://angel.co/columbia-university?save_req=mention_slugs\" target=\"_blank\">Columbia</a>, and <a href=\"https://angel.co/iit-bombay?save_req=mention_slugs\" target=\"_blank\">IIT Bombay</a></em>\n\n<em>This post was originally posted on the <a href=\"http://www.tradebriefs.com/blog/how-we-created-a-business-out-of-sending-400000-emails-a-day/\" target=\"_blank\">TradeBriefs blog</a>.</em>\n\n<strong>The Beginning</strong>\n\nTradeBriefs started off as as an attempt to solve a personal problem. When the organized retail business in India started taking off a few years ago, I was a Retail consultant in the US, eagerly watching the space. The lack of a comprehensive and reliable source of information on this exciting new sector is what made me start our first portal and newsletter – India Retail News (www.IndiaRetailNews.com). Soon, we had visitors and a few subscribers for the newsletter. Open and click rates were high, so I knew we were on to something.\n\n<strong>Offline Subscriber Acquisition</strong>\n\nAfter the move back to India, my initial efforts to get subscribers revolved around in-person acquaintances at conferences and events. Soon, we had interns collecting business cards and lucky draws to attract more subscribers from offline events. Our Retail training venture (the pre-pivot business) helped us gain word-of-mouth publicity and more subscribers. However, subscriber growth was so slow that we really didn’t know if this could be a viable business.\n\n<strong>Our First Advertiser</strong>\n\nOne fine Monday, a consulting startup founder I had met at an event, called me to ask if he could advertise with us. I wasn’t sure if it would be a good investment for him and offered him email marketing at a nominal cost to begin with. His email to our audience of 10,000 subscribers got him several email responses, 10 of which were good leads (3 of whom eventually went on to become clients). We were in business!\n\n<strong>BBC World News</strong>\n\nWe used the money earned from our training business to grow our newsletter venture. I hired our first editor. More raffles, more business cards, more subscribers. We made our presence felt at Retail conferences. Our newsletter was becoming the most comprehensive and trusted source for industry information. And one day, I got a call from BBC World News. They wanted a reliable estimate on the size of the Retail industry in India, with projections. We had no clue! I quickly ran through a bunch of reports we had curated, called a few industry folks and cobbled together some estimates. Our brand was on TV! The visibility helped us get some more subscribers and interest from advertisers.\n\n<strong>Subscriber Needs and Advertiser interest go hand-in-hand</strong>\n\nOne thing that has caused good things to happen to us from the beginning has been our focus on subscriber needs. Even today, when I go through our subscriber logs to check what is working and what is not working, it helps me give direction to our offerings. And the best part about focusing on your audience is this: If you focus on subscriber engagement, the content stays relevant and subscribers will love you and <strong>Advertisers will find you!</strong> <strong>To this day, almost all our advertisers (including large ones like Ogilvy and The Financial Times) have approached us, rather than the other way around.</strong>\n\n<strong>TradeBriefs is born</strong>\n\nI remember having this conversation with my chief editor one evening. We seem to be doing well, she said. I agreed and thought to myself – we are doing this for Retail, but can we do this for other industries – can we scale this up to something much bigger? Some research on the internet made it pretty clear that there was a need for an industry-focused offering in several industries in the country. Within a matter of days, we put together a plan and launched 4 more verticals – Telecom, Finance, Software and FMCG.\n\n<strong>The Dark Underbelly of Email</strong>\n\nBy now we were relying on SEO to get most of our subscribers. Offline subscriber acquisition was expensive and not scalable. Since we had started small and accidentally landed up in the email newsletter business, we ended up building all the email infrastructure ourselves. Over a period of a year, we educated ourselves on SMTP, IP reputation, Complaint feedback loops, Relay servers and all the wonderfully dark alleys of the email universe. In the early days, we would sometimes get asked why we charge so much for marketing to our audience, when one can purchase 10 million internet addresses on the internet for $100. Depending on the sophistication of the audience, my responses would range from – “That’s just illegal” to “Imagine your sending reputation to be like a credit score and how you’ll get screwed for life if you default on a big loan. That’s what will happen to your IP and domain if you try to send an email to 10 million addresses bought off the internet”.\n\n<strong>What is truly Opt-in?</strong>\n\nVery soon we got our own lessons in what happens when you piss off the cops in the email universe, namely the email providers (aka yahoo, hotmail, gmail, etc). While Gmail provides an Unsubscribe header option and Yahoo, Hotmail and others provide feedback loops where they let you know which subscribers are marking you as spam, it wasn’t very clear to us upfront why someone who has opted-in would mark your emails as spam. Well, for that we have to dig into what “opt-in” really means. The easier you make it for someone to sign up (let’s say by dropping a business card at an event), the easier it is for that person to forget why they signed up with you in the first place. Also, if you use the wrong incentives (like a cash prize) to get your users to get their friends to subscribe to your service, the more spam they send and your IP reputation suffers in the process. Besides, the more emails you send someone, the more you are likely to be perceived as spamming them; no matter how relevant you think that information is for them. Even some large companies like Facebook have learnt this the hard way. <strong>Access to someone’s Inbox is a privilege and should be treated as such.</strong>\n\n<strong>The Future</strong>\n\nWe have 400,000 subscribers today, who trust us to provide them with industry information on a daily basis. It is a privilege for us to be able to reach them and every once in a while, we let our advertiser partners access that privilege. So, for those of you out there who are thinking of using email as a mechanism to communicate with your audience, remember that it is an excellent medium (There are more Email Inboxes being read every day than any media channel in the world), but tread cautiously!",
    "type": "post",
    "path": "/2012/11/28/how-we-acquired-400000-subscribers-and-what-you-didnt-know-about-email/"
}