{
    "title": "How .CO Kicked Goliath's Ass",
    "slug": "how-co-kicked-goliaths-ass",
    "date": "2013-04-10T00:55:12.000Z",
    "url": "http://500.co/?p=1116726761",
    "uri": "http://500.co/2013/04/09/how-co-kicked-goliaths-ass/",
    "postId": "1116726761",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "co",
        "dotco",
        "go-co",
        "interviews",
        "partners"
    ],
    "content": "<p dir=\"ltr\" style=\"text-align: left;\">Tired of everyone saying you’ll never beat the competition? Well guess what...sometimes David beats the hell out of Goliath. Case in point: Juan Diego Calle. He’s the guy responsible for going up against the giant of his industry, Verisign –  and winning.</p>\n<p dir=\"ltr\" style=\"text-align: left;\">So how did he do it? Below, he opens up about competition and scaling for massive growth.</p>\n<p dir=\"ltr\" style=\"text-align: left;\"><strong>How did you become an entrepreneur? What was it about entrepreneurship that attracted you?</strong></p>\n<p dir=\"ltr\" style=\"text-align: left;\">I never made the conscious decision to become an entrepreneur – it just kind of happened organically. My family is very entrepreneurial and it felt natural to follow in my father’s footsteps. In middle school, I sold sandwiches out of my locker. When I was high school, I ran a custom stereo startup out of our garage. I’ve always had this strange feeling that the world is coming to an end – and that I'd better do something big before it does.</p>\n<p dir=\"ltr\" style=\"text-align: left;\"><strong>In 2009, .CO went against Verisign and other companies  in a bid for the .CO. extension. What did you do to win?</strong></p>\n<p dir=\"ltr\" style=\"text-align: left;\">It felt like a David versus Goliath situation going up against Verisign, the company behind .com,  the legacy domain extension. It was a surreal experience! Having great co-founders – who shared the same epic vision – is what helped us beat Goliath. Teaming up with Neustar (to run the technical operations) and a great legal team was also instrumental in helping us to win the bid to administer and market .CO to the world. We ended up submitting a 1,165-page bid package to the government. I'll never forget that number. In college, I think the longest essay I wrote was 20-pages… and I failed that class.</p>\n<p dir=\"ltr\" style=\"text-align: left;\"><strong>There has been a trend of large companies applying for their own domains, which could make the market heavily fragmented. How can entrepreneurs make themselves stand out?</strong></p>\n<p dir=\"ltr\" style=\"text-align: left;\">Search will become more important in a world of unlimited domain choices. Today, individuals looking for something specific will to go to flowers.com or insurance.com because they’re expecting to find a credible site. Once new top-level domains (aka TLDs) hit the scene, people will build sites on lots of different extensions; we’re already seeing tons of amazing <a href=\"http://2013.go.co/case-studies/\">quality sites on .CO</a>. With so many choices, entrepreneurs will be able to find the perfect TLD that compliments what they’re trying to bring to life.</p>\n<p dir=\"ltr\" style=\"text-align: left;\"><strong>How does .CO plan to react to this shift to TLDs?</strong></p>\n<p dir=\"ltr\" style=\"text-align: left;\">Before .CO, TLDs were always treated like utilities. So we’re sticking to the strategy we’ve had since we launched which has 3 key pieces. One, to build a global brand that is synonymous with innovation. Two, to target early adopters and tech startups that help us to accomplish the first point. Three, to build a global community of individuals and companies that help propel the brand forward. We want to be more than just a domain. Our <a href=\"http://2013.go.co/membership-perks/\">Membership Program</a> has helped us support the global community we’re building by offering .CO-ers free benefits like education, promotional support, networking and much more – basically, all the things they need to succeed. Apart from being a huge differentiator for us, there's nothing more rewarding than supporting the innovators who are building the future on .CO -- and watching them succeed.</p>\n<p dir=\"ltr\" style=\"text-align: left;\"><strong>What's been the biggest challenge for .CO, and how have you dealt with it?</strong></p>\n<p dir=\"ltr\" style=\"text-align: left;\">I think our biggest challenge has been one that’s very common in startups – consumer awareness and adoption. New technologies have a long adoption curve, and in our case, we’re dealing with 25+ years of .com dominance. We have to change public perception and break the .com tradition to disrupt the status quo.</p>\n<p style=\"text-align: left;\">The good news is, we’re seeing awareness of .CO increase, and public perception is changing. And just last week, nine .CO companies (including <a href=\"http://www.tinypost.co/\"> Tinypost.co</a>, <a href=\"http://www.fosbury.co/\">Fosbury.co</a>, <a href=\"https://mailstrom.co/\">Mailstrom.co</a>, <a href=\"http://simpler.co/\">Simpler.co</a>, <a href=\"http://www.shopinterest.co/\">Shopinterest.co</a>, <a href=\"https://vine.co/\">Vine.co</a>, <a href=\"http://www.angel.co/\">Angel.co</a>, <a href=\"http://www.deliv.co/\">Deliv.co</a> -- and of course, <a href=\"http://www.500.co/\">500.co</a>) were covered on TechCrunch in a 7 day period. I don’t think that's ever happened for any other domain extension besides .com.</p>\n<p dir=\"ltr\" style=\"text-align: left;\"><strong>What are 3 pieces of advice you can give to bootstrapped entrepreneurs trying to get their business off the ground?</strong></p>\n<p dir=\"ltr\" style=\"text-align: left;\">1. JFDI: Just F%#!n Do It!</p>\n<p dir=\"ltr\" style=\"text-align: left;\">2. Worry more about getting traction for your business and less about raising money. If you get traction, you’ll raise money. It’s not the other way around.</p>\n<p dir=\"ltr\" style=\"text-align: left;\">3. Build a solid team. A company’s growth and potential is only as big as the talent of its people. If you want to build something big, you have to hire big. Shoot for the stars, get your team aligned around a huge vision, and have at it!</p>",
    "type": "post",
    "path": "/2013/04/09/how-co-kicked-goliaths-ass/",
    "backgroundImage": "/backup/juan-960x540-2013-04-09-13-19-55.jpeg"
}