{
    "title": "How to Recover and Learn from Startup Burnout",
    "slug": "how-to-recover-and-learn-from-startup-burnout",
    "date": "2013-02-03T05:58:43.000Z",
    "url": "http://500.co/?p=1116725179",
    "uri": "http://500.co/2013/02/02/how-to-recover-and-learn-from-startup-burnout/",
    "postId": "1116725179",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/02/diesel@2x-300x220.jpg"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "kickfolio",
        "musings",
        "startups"
    ],
    "content": "<img class=\" wp-image-1116724963 alignleft\" style=\"padding-right: 3px;\" alt=\"diesel\" src=\"/backup/diesel@2x-300x220-2013-02-02-13-23-58.jpg\" width=\"210\" height=\"139\" align=\"left\" />\n\n<strong>Diesel Laws is the Co-Founder &amp; Head of User Experience at <a href=\"http://Kickfolio.com\" target=\"_blank\">Kickfolio.com</a>. Kickfolio is a 500 Startups-funded startup that lets users run native iPhone &amp; iPad apps in the browser, creating engaging experiences &amp; try-before-you-buy marketing opportunities. Tune into our <a href=\"http://www.livestream.com/500startups\">Demo Days livestream</a> on Wednesday, Feb. 6th at 1pm, PST</strong><strong> to see Kickfolio and their batchmates pitch.</strong>\n\nImagine you’re driving a race car. You’re slowing down to take a really tight corner, and braking around the corner properly is pivotal to finishing the race in 1st place. In that moment, it’s important to gather your bearings, plan your next few turns and gradually increase speed. If you’re too cautious, you’ll leave the corner too slowly and will lose the race. If you’re too fast, you may end up losing control of the car as you make the turn – and crash.\n\nAs an entrepreneur, I’ve often worked a ridiculous amount of hours fueled by passion and commitment. I’ve often worked early into the morning, hunched over a dimly lit keyboard with heavy bags under my eyes. Rarely moving from my seat, pizza quickly becomes my go-to source of nutrition and drinking water seems like a distant pastime (sound familiar?).\n\nBut this post isn’t about the countless measures I, or other entrepreneurs can take to avoid the dreaded burnout – we all know what we need to do. This is about mentally (and positively) accepting when we have to slam on the brakes and slow things down. The aftermath, if you will. Owning our failures and giving our bodies and minds the fuel they need to recover.\n\n<span style=\"color: #444444;\">When we find ourselves in that position of burnout, we should apply the brakes – at least temporarily.</span>\n\nHere are some thoughts &amp; tips on recovery:\n<p style=\"padding-left: 30px;\">Taking time to heal correctly is imperative – it’s not efficient or logical to only heal halfway to then hit burnout again a week later</p>\n<p style=\"padding-left: 30px;\">Remember that you didn’t get to where you are now on hard work and long hours alone</p>\n<p style=\"padding-left: 30px;\">While some ideas appear through focusing intensely, many come when you least expect it (shower, relaxing, partying with friends)</p>\n<p style=\"padding-left: 30px;\">Stress will slow you down, rather than speed you up – learn to avoid it</p>\n<p style=\"padding-left: 30px;\">Value is not based on effort – it’s based on results. Find ways to get results efficiently.</p>\n<p style=\"padding-left: 30px;\">Being healthy in mind and body increases efficiency</p>\n<p style=\"padding-left: 30px;\">Helping others with no monetary gain (feedback, advice, design, coding etc) is a brilliant way to re-energize and recover</p>\n<p style=\"padding-left: 30px;\">Taking some time out for yourself allows others in your network to step forward and grow</p>\n<p style=\"padding-left: 30px;\">Embrace personal distractions (this is your mind’s way of saying ‘something needs to change’) and learn how to use them to refuel</p>\n<p style=\"padding-left: 30px;\">Listen to your body more – if you have a quick thought that you should drink some water, do it (your work will be there when you get back)</p>\n<p style=\"padding-left: 30px;\">When you hit a brick wall, ask for help</p>\n<p style=\"padding-left: 30px;\">Network effects are real – if you are more social, you will have more people willing to help during your burnout</p>\nIn that race track corner, I often think about how far I have come and what it has taken to get there. I notice the new people I now converse with, the new businesses I have connected to and the many opportunities that have been presented in front of me. I have the time to take note of the direction we’re going with Kickfolio.\n\n<span style=\"color: #444444;\">During a burnout, you have time to get an objective view of your progress – and have a moment of clarity, focus and inspiration. If you don’t take time to recover from your failures, you may miss the chance to digest, reflect and learn from your experiences in the fast lane.</span>",
    "type": "post",
    "path": "/2013/02/02/how-to-recover-and-learn-from-startup-burnout/",
    "backgroundImage": "/backup/racecar-960x540-2013-02-02-13-23-58.jpg"
}