{
    "title": "How to Get Hired by a Startup (Even if You’re not Technical)",
    "slug": "how-to-get-hired-by-a-startup-even-if-youre-not-technical",
    "date": "2014-02-25T16:32:13.000Z",
    "url": "http://500.co/?p=1116731591",
    "uri": "http://500.co/2014/02/25/how-to-get-hired-by-a-startup-even-if-youre-not-technical/",
    "postId": "1116731591",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "employment",
        "english-major",
        "grads",
        "jobs",
        "startups",
        "startups"
    ],
    "content": "<p dir=\"ltr\">Joining the tech world might seem like a mysterious process, but I can assure that you don’t need magical powers, luck, or a blessing from Mark Zuckerberg to join a startup. Back in 2009, I was a completely non-technical recent grad (English Major, LOL) who didn’t know ANYTHING about startups. Somehow, I still managed to convince a now well-known file-sharing startup to hire me. If you don’t code or design, you probably won’t have the luxury of turning down offers from startups that are throwing themselves at you. But don’t let that discourage you; there are still plenty of ways to get a awesome startup to give you a chance. Here’s how:</p>\n<p dir=\"ltr\"><strong>Work your Network Like Crazy</strong></p>\n<p dir=\"ltr\">Tech is small. Like really small. Even if you move from one major tech hub to another – say from SF to Boston or NYC – you’ll run into people who know the people you used to work with. That’s why it’s insanely important to tap into your networks to figure out who can give you an intro to that startup you want to work at.</p>\n<p dir=\"ltr\">This isn’t to say that knowing someone per se will get you the job. What will get you the job is a recommendation or intro from someone the founder or hiring person trusts, which is way more convincing than hearing from a random person or reading a recommendation on LinkedIn. If someone who knows the team or founder is willing to vouch for you, that’s a sign you’re worth serious consideration.</p>\n<p dir=\"ltr\">Like I said, tech is tiny, so you probably have more connections to startups than you think. Don’t be annoying about it, but always take advantage of any opportunities to network or meet new people who might give you an intro to someone down the line. If you meet someone interesting in tech at a party or through friends, stay in touch with them! And don’t be embarrassed to outright ask them if they know a startup that’s looking for someone like you.</p>\n<p dir=\"ltr\"><strong>Have Side Projects</strong></p>\n<p dir=\"ltr\">A cool side project is a million times more impressive than a nice resume. If you’re non-technical, chances are you’re looking for a marketing or creative role, so this is your opportunity to show off your skills, personality, and ability to execute.</p>\n<p dir=\"ltr\">Side projects can be anything that requires a regular commitment from you, like a blog, podcast, app, whatever. For example “I’m passionate about food” is way more believable when you have a YouTube channel dedicated to funny, entertaining food reviews. Even if you don’t have a ton of views, it shows that you’re willing to stick to a project and see it through to completion.</p>\n<p dir=\"ltr\">Whatever your passion is, demonstrating that you’ve spent real time and effort on it (as opposed to just talking about it), shows startups that you don't just talk about things – you do them.</p>\n<p dir=\"ltr\"><strong>Know More than Expected</strong></p>\n<p dir=\"ltr\">Not being technical doesn’t mean you shouldn’t know startup basics. Startups run lean, so any extra skills you have – even if unrelated to your core expertise – make you a much more enticing hire.</p>\n<p dir=\"ltr\">Thanks to the internet, teaching yourself the basics of coding, design and distribution is incredibly easy (and free!). TAKE ADVANTAGE OF THIS.  Spend an hour a day on YouTube, Udemy, and other sites to beef up your skills. Other things being equal, having some technical knowledge might be what tips the scale in your favor.</p>\n<p dir=\"ltr\"><strong>Be Humble</strong></p>\n<p dir=\"ltr\">Startups aren’t glamorous. The pay is low, you work long hours and fail a lot. You’ll also be doing a lot of menial stuff if you work at a very early-stage company. For example, if you work for a fashion startup that ships out clothes every week – surprise – you’ll probably get to help pack a lot of boxes and iron clothes. Don’t think that joining a startup is going to automatically mean free food, awesome perks, and millions of dollars.</p>\nEven if you’re amazing at marketing, writing, or whatever, be humble. Don’t give the impression that you aren’t willing to do all the boring, crappy stuff that comes along with working at a startup. The smaller the startup, the more likely you’ll have to do things that aren’t technically “your job.”\n\nWorking at a startup is still work, and sometimes it really sucks. If you join an early-stage company in  a non-founder role, your salary probably wont be that competitive, especially compared to large companies like Google, Twitter, Apple, etc.  Make sure you find  something you're really passionate about, otherwise the trade-offs – long hours, tiny office (or no office), extreme ups and downs – wont be worth it.\n\nI'd recommend using AngelList to start your search. You can filter openings by all sorts of interesting criteria to find something that's right for you. Here's <a href=\"https://angel.co/jobs?slug=500startups\" target=\"_blank\">a list of all the openings at companies</a> that 500 has invested in. Good luck!",
    "type": "post",
    "path": "/2014/02/25/how-to-get-hired-by-a-startup-even-if-youre-not-technical/",
    "backgroundImage": "/backup/544413_10151582408158717_1898959563_n-960x540-2014-02-25-14-10-32.jpg"
}