{
    "title": "How to Interview a Designer",
    "slug": "how-to-interview-a-designer",
    "date": "2010-11-24T06:29:32.000Z",
    "url": "http://blog.500startups.com/?p=1116714525",
    "uri": "http://500.co/2010/11/24/how-to-interview-a-designer/",
    "postId": "1116714525",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "design",
        "designers",
        "guest-posts",
        "hiring",
        "interviewing",
        "jason-putorti",
        "mentors",
        "recruiting",
        "tips"
    ],
    "content": "<em>Written by <a href=\"http://twitter.com/#!/putorti\" target=\"_blank\">Jason Putorti</a>, a 500 Startups SuperMentor, Venture Advisor and Founder of <a href=\"http://votizen.com/\" target=\"_blank\">Votizen</a>. The post below is <a href=\"http://jasonputorti.com/post/1424283124/how-to-interview-a-designer\" target=\"_blank\">cross-posted</a> from his blog.</em>\n\nThese are the tenets I give people when they ask me how to evaluate a user experience designer for their startup. It’s not perfect, it’s not a guarantee, but this is my approach:\n<ol>\n\t<li><strong>Visual portfolio.</strong> Gut check ‘yes’ or ‘no’. Either you like it or you don’t. If you’re not sure what good is, my first filters are information priority (are the first through fifth most important things on the page obvious from the visual weight), information organization (are related ideas near each other), intuitiveness (what you’re supposed to do next), and clarity of copy.</li>\n\t<li><strong>Process.</strong> “This portfolio looks great, how did you get there? What problem were you given? How did you approach solving it? How did you iterate from idea to final product? How many concepts did you try? How did you decide which one to go with? Who was this designed for?” And so forth. The key here is to derive a rational, thoughtful design process that balances business needs with user needs— and empathy with those users. This separates designers from artists making pretty pictures.</li>\n\t<li><strong>Intellectual curiosity.</strong> Nobody knows <em>everything</em> about design, or anything else. “What do you read? Who/what inspires your thinking around user experience? What’s an example of a good user experience and why? How will you improve over the next year?” Granted you need to know some things up front, such as the definitions of user experience, design thinking, and perhaps something about various design philosophies like user-centered, activity-centered, etc. Wikipedia is your friend.</li>\n\t<li><strong>Trial and error.</strong> Give him or her a UI component to redesign, or present a problem you’ve been facing and ask for some ideas on how to solve it. I feel a discrete UI component is reasonable, not a redesign of an entire page UI. Deliverables should be low fidelity sketches. <a href=\"http://www.adaptivepath.com/ideas/essays/archives/000863.php\" target=\"_blank\">Adaptive Path</a> actually teaches that 10-15 minutes is optimum for sketching rough interface elements on a 6-up template, with no more than a few minutes per concept. They haven’t found that significantly more time improves the end-result at all. An exercise like this could even be done on the spot, or you can treat it as a take-home.</li>\n</ol>\nThis being said, I’m not sure if I would have nailed this test when I was hired at Mint in early 2007. I had the portfolio (but no consumer UIs), I had an engineering background so I could build what I designed, but my process was immature, and my user experience understanding was lacking. However, I grew in the job, learned from everyone around me, from practice, etc. So I think these principles will allow you to compare individuals with a common framework, but if you find someone smart, passionate, a culture fit, and hungry for a win, you might get more than you expect.\n\n<small>P.S. I cross-posted on <a href=\"http://qr.ae/7gxm\" target=\"_blank\">Quora</a> if you’d rather join the discussion there.</small>",
    "type": "post",
    "path": "/2010/11/24/how-to-interview-a-designer/"
}