{
    "title": "How to 10x Your Growth if You're a Startup with Early Traction",
    "slug": "how-to-10x-your-growth-if-youre-a-startup-with-early-traction",
    "date": "2013-06-13T18:42:06.000Z",
    "url": "http://500.co/?p=1116727901",
    "uri": "http://500.co/2013/06/13/how-to-10x-your-growth-if-youre-a-startup-with-early-traction/",
    "postId": "1116727901",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "10x",
        "accelerator",
        "ilya-lichenstein",
        "traction"
    ],
    "content": "<i>The BlueJay count on Team 500 has grown to 3 with our new intern! Samantha Siow is a rising junior studying </i><i>Chemical and Biomolecular Engineering at Johns Hopkins. This summer, she's taking a hiatus from wearing lab coats and safety goggles to something just as explosive (but less risk of chemical burn) – working with </i><i>the 500 Distribution Team. In this blog post, she summarizes Ilya Lichenstein's recent talk on how to 10x your growth in her own unique way. Follow her at <a href=\"https://twitter.com/samanthassiow\" target=\"_blank\">@samanthassiow</a></i>\n\n<header></header>\n<div>\n\nGOTTA GROW FAST amirite amirite har har har ok i’ll stop\n\nI recently watched the talk by Ilya Lichenstein, the CEO and co-founder of MixRank.  MixRank, a “spy tool for contextual and display ads”, is used to find out where your competitors are buying traffic and which of their ads are most effective. Lichenstein covered the topic of accelerating growth through simple market strategies for startups with some early traction.\n\nLichenstein started by saying that before you decide to focus on growth, you have to figure out whether your startup is ready to enter that stage. While growth is extremely important (because eventually you’ll want to grow to the point of becoming a successful business), it is important to keep in mind that this growth must be sustainable. In order to do so, you need to make sure that it is the right time to grow.\n\n“When is it the right time?? I gotta go fast, gotta get to the top, make the big $$, yo!”\n\nSlow down, son! First, you’ve got to make sure you fit some key characteristics.\n<ul>\n\t<li>You have to have <b>initial product/market fit</b>. This means that you’ve got your product ready and you know what is your target market and where they are.</li>\n\t<li>You need to be able to <b>understand key metrics</b>. If you don’t, you’re not going to know what metrics to focus on, what to do with them and how to use them to your advantage.</li>\n\t<li><b>Your numbers make sense</b>. You don’t want to be spending money on traffic that won’t be helping your business and you should be able to monetize this traffic now or eventually.</li>\n\t<li>Note: Lichenstein stated that sometimes, this monetization strategy may not be profitable in the short term, but it should eventually be able to make money. If not, you’re going to need to find a way to <b>make your numbers make sense!</b></li>\n\t<li>You should check that <b>organic demand matches your roadmap</b>. The plan for your future should match up with your users demands. If you’re users say, “make these Cheetos spicier! I love the feeling of having a mini campfire in my mouth!”, and your next step <i>was</i> to make the Cheetos spicier, then GOOD JOB. You’re on your way to being super awesome and you can both bring in new users and keep current users interested when you’ve hit the next milestone in your product design.</li>\n\t<li>Focus on growth <b>when you see opportunities to scale</b>. Take advantage of traffic sources and trends in the market. If you see an untapped traffic source that offers cheap, high volume traffic that is appropriate to your product, you can consider starting to invest in scalable marketing. This was extremely effective on the mobile platform where cheap traffic was highly available (e.g. placing an ad on Candy Crush Saga) and as long as you can monetize it, you can PROFIT!</li>\n</ul>\nNext on the list is to <b>identify your problems</b> and figure out whether they are growth or product problems.\n\nWhen something isn’t working, <strong>DON’T ROLL WITH IT.</strong> The problem is not going to magically be fixed if you start fiddling around with your product and trying to change things about it in an effort to make people realize that your product is fantastic.\n<ul>\n\t<li><b>Focus on finding out the fundamental reason why users are not converting</b>. Don’t spend time fixing things that are completely okay or adding things that no one wants.</li>\n\t<li><b>There will always be product problems. </b>Yes, you may think you’ve made the most amazing product in the universe. But not every one is going to think so. There’s always going to be something you can improve on or change with your product and you’re going to have to figure out what people want and how to achieve that.</li>\n\t<li><b>Are there people who want what you’re making badly enough?</b> You’re going to need people who are desperate for your product. So desperate that if you decide to make jellybeans instead of Hot Cheetos, there will be riots and picketing and stalkers waiting in your attic to find the secret recipe. They also need to want it badly enough that they’ll be willing to deal with your product going through phases of being totally crap and to stay on until it gets better.</li>\n\t<li><b>You cannot create demand</b>. Sure, you may think that your product is the most fantastic thing out there, but if no one thinks so, you’re screwed! It costs millions and millions of dollars to spend money on marketing, press, brand recognition and as a startup, that isn’t available to you. Your only option is to find existing demand that is not satisfied and align your product. THEN GROW, SON.</li>\n\t<li><b>Use growth hacking to accelerate existing processes. </b>The problem with most startups is that when they start growing, they choose to scale the wrong things. They may throw money at bad traffic, optimize non-core product features, get too caught up in the marketing side when the problem lies with their product… STOP THIS!!!!!! There’s a lot of pressure on startups to get as much traction and growth in as short a time as possible but this means nothing if the numbers are wrong and everything isn’t sustainable! Good traffic demands engagement and quality and leads to scalable growth. Non-scalable processes include blog posts, celebrity tweets, some press… this isn’t going to be spitting out money on a regular basis! Find a scalable way that produces more money constantly when you throw money in.</li>\n</ul>\nNow, the moment you’ve all been waiting for! *drumroll*\n\nTHE GROWTH PROCESS!\n<ol>\n\t<li><b>Qualify</b> the best users: who are they; what is unique about them; what makes them valuable.</li>\n\t<li><b>Identify</b> where they go online; what draws their attention.</li>\n\t<li><b>Access</b> distribution channels; how do we get them in those places?</li>\n\t<li><b>Automate</b> existing processes; scale it up!</li>\n</ol>\nLet’s go through it step by step.\n\nQualify:\n<ul>\n\t<li><b>Predictive metrics for revenue potential</b>.</li>\n\t<li><b>Engagement may not be the best indicator of revenue</b>. Reliable consistent subscribers are more valuable than high usage, non paying users.</li>\n\t<li><b>First party data</b>. Use different kinds of analytics. (Don’t just focus on page views! Which pages are being visited and where are the users going can be very important in deciding your next step.)</li>\n\t<li><b>Third party data.</b> Append and pull in other data sources about your users to understand and qualify them. Know as much as you can about them so that you can give them what they want where they want it!</li>\n\t<li><b>Track cross-channel activity.</b> If you’re sending out regular email ads, find out who opens the email, what time they open it, where they’re opening it from and use that to target that market through targeting-type campaigns (e.g. banner ads.)</li>\n\t<li><b>Cohort analysis. </b>Separate users into well-defined groups that have something in common in terms of the metrics you’re optimizing for. (e.g. group all the users in a certain demographic and figure out what works best for them)</li>\n</ul>\nIdentify:\n<ul>\n\t<li><b>Psychographics</b> (their interests, occupation, things you can retrieve from their facebook profile!) <b>&gt; Demographics</b> (e.g. not all girls like Barbies. But most people who like dolls would like Barbies)</li>\n\t<li><b>Find adjacent markets.</b> Who else is marketing to these people?  Consider making a distribution deal or partnership with them.</li>\n\t<li><b>What are they talking about now?</b> (e.g. track their twitter feed! What key words are they using?)</li>\n\t<li><b>Where do they spend their time?</b></li>\n\t<li><b>Who’s marketing to them?</b> What other content/ads do your users see along side yours? Who are your competitors?</li>\n</ul>\nAccess:\n\nTraffic Quality Is Everything! Low quality, cheap traffic with low monetization or no access to your product DROOLS. High quality, more expensive traffic with high monetization potential and easy access to your product RULES.\n<ul>\n\t<li><b>High monetization potential.</b> Don’t focus on getting cheaper clicks or a higher click through rate at the beginning, focus on ways to get a higher conversion rate! (But the former becomes more important after the user has converted so you can differentiate and gain leverage).</li>\n\t<li>Example: Groupon scaled quickly using highly untargeted, extra-cheap traffic across many different sites, but differentiated using locations in order to monetize untargeted traffic. Within these locations, the offers had wide enough appeal that allowed it to be scaled quickly!</li>\n\t<li><b>High share of voice.</b> This is the % of the marketing messages out there that belong to you. E.g. If I own 1 out of 10 ads on a page, my share of voice is 10%. Aim for as high a share of voice so you can gain people’s attention.</li>\n\t<li><b>Low overlap with existing audiences.</b> Within a certain site’s audience, 5-10% of the traffic has a high conversion. You want to find these people and target them. A great way to do this is through spreading your ads across many different audiences across many different sources, hone in the small percentage each time that converts and this will all add up to a massive, awesome conversion party for you. Track your users and find the ones with the most valuable/highest conversion/biggest potential! (e.g. avoid early adopters who are low retention, consider focusing on less tech savvy/international markets where users are less saturated!)</li>\n\t<li><b>Low opportunity to test.</b> It should be easy for you to test, get in and out of the market quickly, and then move on. Don’t make commitments to big media buys yet!</li>\n</ul>\nAutomate:\n<ul>\n\t<li><b>Any one on your team can be a growth hacker!</b> Excel is a great resource.</li>\n\t<li><b>Explore non-tech solutions!</b> Coding may seem like a great way to go, but cheap outsourcing may be a better way to solve problems.</li>\n\t<li><b>Avoid building from scratch! </b>Put your pride away for a bit and try to use other products or channels that may be more effective.</li>\n\t<li><b>Accomplish anything by gluing together external products. </b>Integrate!</li>\n\t<li><b>Does it scale?</b> Is this something that can give me leverage!? Can I get a disproportionate about of benefit from these people?! Focus on the ones with the most potential and who’s benefits are most scalable.</li>\n</ul>\n</div>",
    "type": "post",
    "path": "/2013/06/13/how-to-10x-your-growth-if-youre-a-startup-with-early-traction/",
    "backgroundImage": "/backup/gottagofast-2013-06-13-13-13-42.gif"
}