{
    "title": "How to Create a Successful Startup in Japan: In 10 Easy Steps!",
    "slug": "how-to-create-a-successful-startup-in-japan-in-10-easy-steps",
    "date": "2011-01-24T11:58:08.000Z",
    "url": "http://blog.500startups.com/?p=1116714815",
    "uri": "http://500.co/2011/01/24/how-to-create-a-successful-startup-in-japan-in-10-easy-steps/",
    "postId": "1116714815",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/01/image10-300x223.png",
        "http://500.co/wp-content/uploads/2011/01/image11-300x168.png",
        "http://500.co/wp-content/uploads/2011/01/image3-300x224.png",
        "http://500.co/wp-content/uploads/2011/01/image9-224x300.png",
        "http://500.co/wp-content/uploads/2011/01/image0-300x221.png",
        "http://500.co/wp-content/uploads/2011/01/image8-224x300.png",
        "http://500.co/wp-content/uploads/2011/01/image4-300x224.png",
        "http://500.co/wp-content/uploads/2011/01/image2-300x224.png",
        "http://500.co/wp-content/uploads/2011/01/image5-225x300.png",
        "http://500.co/wp-content/uploads/2011/01/image6-300x224.png",
        "http://500.co/wp-content/uploads/2011/01/image7-223x300.png",
        "http://500.co/wp-content/uploads/2011/01/image12-300x223.png",
        "http://500.co/wp-content/uploads/2011/01/image1-300x223.png"
    ],
    "creator": "",
    "categories": [
        "guest-posts",
        "international",
        "japan",
        "mygengo",
        "robert-laing",
        "startups",
        "translation"
    ],
    "content": "<em>This post is written by <a href=\"http://twitter.com/#!/robert_laing\" target=\"_blank\">Robert Laing</a>, co-founder of <a href=\"http://mygengo.com/\" target=\"_blank\">myGengo</a> (a 500 Startups company). A bit about Robert, in his own words: \"Two years ago I founded <a href=\"http://mygengo.com/\" target=\"_blank\">myGengo</a>, the API and platform for human translation (some call us a Mechanical Turk for translation) with <a href=\"http://twitter.com/#!/quanza\" target=\"_blank\">Matthew Romaine</a>, who’s half American, half Japanese. I’m from the UK, have been in Japan for 3.5 years, prior to which I worked in online advertising and web design at UK agencies. My Japanese is, um, OK.\"</em>\n\n[caption id=\"attachment_111671\" align=\"alignnone\" width=\"300\" caption=\"Matt’s on the left, I’m on the right. At the 500 Startups office.\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image10.png\"><img class=\"size-medium wp-image-1116714816 \" title=\"Matthew Romaine and Robert Laing of MyGengo\" src=\"/backup/image10-300x223-2011-01-24-11-05-58.png\" alt=\"Matthew Romaine and Robert Laing of MyGengo\" width=\"300\" height=\"223\" /></a>[/caption]\n\n<strong>The 10 steps:</strong>\n<ol><strong>\n\t<li>Know what a startup is</li>\n\t<li>Have a relevant reason for being in Japan, and always evaluate location</li>\n\t<li>Use the culture, learn the language</li>\n\t<li>Learn to straddle timezones</li>\n\t<li>Don’t worry about the local economy</li>\n\t<li>Figure out how to raise money</li>\n\t<li>Create a hiring strategy</li>\n\t<li>Consider creating a US entity</li>\n\t<li>Focus</li>\n\t<li>Profit!</li>\n</strong><strong> </strong><strong> </strong><strong> </strong><strong> </strong><strong> </strong></ol>\n<strong>Step 1: Know what a startup is</strong>\nThe first time I heard the word ‘startup’ was 2005, when I discovered <a href=\"http://techcrunch.com/\" target=\"_blank\">TechCrunch</a> in my (boring) lunchtimes at a design job in the UK. I went through the brain-opening process of realizing that you didn’t need ‘permission’ to start a company and you could do pretty much whatever you wanted. Wow.\n\nIf you are from the Bay Area you are probably thinking, <em>“What? I created my first startup pitch deck in the womb. This guy had his head stuck in the sand.”</em> But the amazing ‘startup’ idea is taken for granted in Silicon Valley: cultural, family, political support for innovation, plus local success stories.\n\n[caption id=\"attachment_1116714819\" align=\"alignnone\" width=\"300\" caption=\"Lunch at TechCrunch in January last year. How far we’ve come...\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image11.png\"><img class=\"size-medium wp-image-1116714819\" title=\"Robert Laing at TechCrunch's office in Jan 2010\" src=\"/backup/image11-300x168-2011-01-24-11-05-58.png\" alt=\"Robert Laing at TechCrunch's office in Jan 2010\" width=\"300\" height=\"168\" /></a>[/caption]\n\nBlogs like TechCrunch, Mashable etc have spread that idea around the world — for which they deserve more praise — but there’s still a long way to go. Our hope is that <a href=\"http://500hats.typepad.com/\" target=\"_blank\">Dave McClure</a>’s efforts in tossing briefcases full of seed money at every far-flung entrepreneur who <a href=\"http://www.xconomy.com/boston/2010/10/15/twitter-plea-helps-baydin-get-seed-money-from-angel-investor-dave-mcclure-startup-moving-to-the-valley-next-month/\" target=\"_blank\">gives him a ride</a> will spread this ethos even further, by creating more and more local startup successes.\n\nIn Japan people call a startup a ‘venture’ pronounced ben-cha — but <a href=\"http://gree.co.jp/\" target=\"_blank\">GREE</a>, <a href=\"http://mixi.co.jp/\" target=\"_blank\">Mixi</a> et al (both public companies) are still considered ben-cha. There is still cultural stigma here about joining a company that isn’t one of the well-known local giants like Sony, Toyota or whatever. So if you do it, ESPECIALLY if you are a local, you have big balls — hats off to the Japanese entrepreneurs like <a href=\"http://flutterscape.com/\" target=\"_blank\">Flutterscape</a> and Sano-san, CEO of <a href=\"http://www.cookpad.com/\" target=\"_blank\">Cookpad</a>!\n\nEXPERT TIP: If you meet an entrepreneur who is successfully building a startup in a country without a vibrant startup culture, they are probably the real deal. Please fund them.\n\n<strong>Step 2: Have a relevant reason for being in Japan, and always evaluate location</strong>\nWe would not have come up with the idea for myGengo if we weren’t living and working in Japan. We simply would not have understood language as the massive, unsolved problem that it is. So the company’s conception is partly due to our location. People ‘get’ the <a href=\"http://mygengo.com/talk/blog/translation-blunders-in-japan-how-i-became-a-translator/\" target=\"_blank\">translation problem</a> here, whether they are running a billion-dollar company or a <em>ramen</em> shop. Being in the heart of the problem space is good for us.\n\nHowever some things about Japan are hard, so if there was no longer a compelling reason to be here (or if we had started a service that would only work in the US), we wouldn’t sacrifice the company for the country, we’d move. Since a startup is probably 100% of your focus it would be crazy to stay just because you like <em><a href=\"http://en.wikipedia.org/wiki/Onigiri\" target=\"_blank\">onigiri</a>.</em>\n\n[caption id=\"attachment_1116714820\" align=\"alignnone\" width=\"300\" caption=\"Matt enjoying matsuri-time. There is a matching photo of me from the other perspective which is extremely flattering too..\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image3.png\"><img class=\"size-medium wp-image-1116714820\" title=\"Matt enjoying matsuri-time. There is a matching photo of me from the other perspective which is extremely flattering too..\" src=\"/backup/image3-300x224-2011-01-24-11-05-58.png\" alt=\"Matt enjoying matsuri-time. There is a matching photo of me from the other perspective which is extremely flattering too..\" width=\"300\" height=\"224\" /></a>[/caption]\n\nEXPERT TIP: Do not come to Japan <em>in order</em> to start a company. That is insane. You will fail.\n\n<strong>Step 3: Use the culture, learn the language</strong>\nOMG Japan is, like, the most convenient place in the world! <a href=\"http://blog.greggman.com/blog/combini/\" target=\"_blank\">Combini</a> (convenience stores) appear every 16 metres on every street in the land, and in between those are vending machines that dispense t-shirts and <a href=\"http://en.wikipedia.org/wiki/Gyoza\" target=\"_blank\">gyoza</a> 24/7. Service is so good that IKEA will replace your 2-year-old sofa with a new one for free if they don’t have a replacement cover, AND give you Y40,000 ($480) coupons*. The transport is so reliable that aggregated annual delays on the <a href=\"http://en.wikipedia.org/wiki/Shinkansen\" target=\"_blank\">shinkansen</a> network are measured in <em>picoseconds</em>.\n\n[caption id=\"attachment_1116714823\" align=\"alignnone\" width=\"224\" caption=\"Matt clearing out IKEA for our office setup.\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image9.png\"><img class=\"size-medium wp-image-1116714823\" title=\"Matt clearing out IKEA for our office setup.\" src=\"/backup/image9-224x300-2011-01-24-11-05-58.png\" alt=\"Matt clearing out IKEA for our office setup.\" width=\"224\" height=\"300\" /></a>[/caption]\n\n*This one actually happened to us, but partly because my wife is omnipotent.\n\nJapan is alternately futuristic and stuck in the past. For example, when you go to the bank to set up an account, the teller will give you a little piece of paper for you to *write* your PIN on, and then she’ll read it and tap it into the machine herself. Nice and secure.  <a href=\"http://www.dannychoo.com/post/en/515/Tokyo+Property+Purchase.html\" target=\"_blank\">Real estate agents</a> use huge bound books of faxes to show you properties. You can’t use a credit card in most restaurants. On the other hand we have probably the best mobile network in the world, with consistent 3G mobile access all over town and the biggest internet tubes that never get clogged.\n\nBut in all seriousness, Japan does a lot of things right when it comes to service, largely because people care about doing a great job and customers have very high expectations. Few people are bullish about the Japanese economy as a whole, but Japanese companies like Toyota still kick ass with quality and efficiency. (The <a href=\"http://en.wikipedia.org/wiki/2009%E2%80%932010_Toyota_vehicle_recalls\" target=\"_blank\">accelerator pedal </a>thing was, in my opinion, <a href=\"http://en.wikipedia.org/wiki/2009%E2%80%932010_Toyota_vehicle_recalls#cite_note-DFP2-110\" target=\"_blank\">complete bullshit</a> if you read the science) Actually, if you run a startup that has to do with production of anything you must read <a href=\"http://www.amazon.com/Toyota-Way-Jeffrey-Liker/dp/0071392319\" target=\"_blank\">The Toyota Way</a> right now. (Yes, instead of finishing this blog post).\n\n[caption id=\"attachment_1116714824\" align=\"alignnone\" width=\"300\" caption=\"One of the rare days when only five myGengo employees wore the t-shirt..\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image0.png\"><img class=\"size-medium wp-image-1116714824\" title=\"One of the rare days when only five myGengo employees wore the t-shirt..\" src=\"/backup/image0-300x221-2011-01-24-11-05-58.png\" alt=\"One of the rare days when only five myGengo employees wore the t-shirt..\" width=\"300\" height=\"221\" /></a>[/caption]\n\nThis is a good thing — and we try very hard to combine this philosophy with that of running a lean startup, which is healthy but hard. As you can imagine, quality of output is something we obsess about, and <a href=\"http://en.wikipedia.org/wiki/Kaizen\" target=\"_blank\">kaizen</a> is crucial for us to keep increasing quality and efficiency of translation. We do not create enough public visibility of this cultural impact on myGengo right now, but it is most definitely there, a great advantage to us, and something we will make more of.\n\n[caption id=\"attachment_1116714825\" align=\"alignnone\" width=\"224\" caption=\"Hoping our next hire has bowling alley experience..\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image8.png\"><img class=\"size-medium wp-image-1116714825\" title=\"Hoping our next hire has bowling alley experience..\" src=\"/backup/image8-224x300-2011-01-24-11-05-58.png\" alt=\"Hoping our next hire has bowling alley experience..\" width=\"224\" height=\"300\" /></a>[/caption]\n\nLanguage is obviously a pretty big issue. I survive by understanding (most) Japanese but expecting Matt to talk when we need to say intelligent things in public here. Sometimes I (regrettably) use staff as interpreters, but this makes me look more important :) and also avoids me saying stupid things. But essentially we solve language issues by a) hiring appropriately and b) creating a product that takes away direct project management of translation.\n\nEXPERT TIP: Do not take on negative local habits — like the Japanese tradition of people hanging around in the office late at night doing largely nothing except waiting for the boss to leave. Or the practice of having 10 people attend a meeting when only 1 is required. Or cramming 5,000 words on every PowerPoint slide.\n\n<strong>Step 4: Learn to straddle timezones</strong>\n\n<strong> </strong>\n\n[caption id=\"attachment_1116714826\" align=\"alignnone\" width=\"300\" caption=\"8 IKEA clocks, $9 each. The sound of 8 cheap clocks ticking when you’re trying to work in peace, hmm, not so priceless.\"]<strong><a href=\"http://500.co/wp-content/uploads/2011/01/image4.png\"><img class=\"size-medium wp-image-1116714826\" title=\"8 IKEA clocks, $9 each. The sound of 8 cheap clocks ticking when you’re trying to work in peace, hmm, not so priceless.\" src=\"/backup/image4-300x224-2011-01-24-11-05-58.png\" alt=\"8 IKEA clocks, $9 each. The sound of 8 cheap clocks ticking when you’re trying to work in peace, hmm, not so priceless.\" width=\"300\" height=\"224\" /></a></strong>[/caption]\n\nIf we look back on 5 of the last enterprise deals myGengo did, 4 of them were with clients we have only ever met over Skype. Timezone becomes more of a limiting factor than distance, because you have to cram calls into a short time period and you miss people. We do calls with the US pretty much every morning, and calls with Europe every evening because of the time difference, and I wish we had more time.\n\nGROUP WORK: Discuss your ‘pet hate’ timezone. From Japan: Eastern Standard Time, you suck! Shall I take that call at 6am or 11pm? Hmm, nice choice.\n\n<strong>Step 5: Don’t worry about the local economy</strong>\nJapan is universally panned for its low birth rate, aging population, pension crisis, and poor political leadership. However, writing about Japan’s failings has been done and overdone and done again. All that stuff is probably only a 0.5% factor in your success. To grossly paraphrase <a href=\"http://www.amazon.com/Four-Steps-Epiphany-Steven-Blank/dp/0976470705/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1295771383&amp;sr=1-1\" target=\"_blank\">Steve Blank</a>, if the probability of X is lower than the probability of your company not surviving to the next milestone, forget about it. We’ve doubled revenue quarter on quarter over the past year, despite Japan’s gloomy macroeconomic forecasts.\n\n[caption id=\"attachment_1116714828\" align=\"alignnone\" width=\"300\" caption=\"myGengo friends disregarding the local economy in fine style\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image2.png\"><img class=\"size-medium wp-image-1116714828\" title=\"myGengo friends disregarding the local economy in fine style\" src=\"/backup/image2-300x224-2011-01-24-11-05-58.png\" alt=\"myGengo friends disregarding the local economy in fine style\" width=\"300\" height=\"224\" /></a>[/caption]\n\nAnd anyway, there’s way more that’s the *same* about a startup in Japan and a startup in, say, Italy, than differences. The fact that founding a startup is hard is the same. That you need to get out of the building and actually understand the customer is the same. That you need to find good people is the same. That you need to constantly iterate is the same.\n\nIN YOUR OWN TIME: Come up with 10 reasons why it’s harder in *your* country than anywhere else. Then realize there are entrepreneurs in Iraq and Afghanistan and whatever war zone you care to name. If you are reading this post, you have all the head-start you need.\n\n<strong>Step 6: Figure out how to raise money</strong>\nIf your startup is in Japan or almost any area outside of Silicon Valley, you should get smart about raising money and fast. All the blog posts and other literature that comes out of Bay Area startups is relevant, but it’s written in the context of being in the most vibrant angel and VC investing community in the world. There will always be local sources of angel/seed funding, but if you want to meet angels who are experienced, helpful, easy-going and in useful numbers, making a trip to the US makes a huge difference.\n\nOur seed round involved 9 different angels and nearly as many nationalities – but many of the connections came through Dave McClure. Having at least one initial tie to Silicon Valley made it massively easier.\n\n[caption id=\"attachment_1116714829\" align=\"alignnone\" width=\"225\" caption=\"We gave this man a t-shirt to try to stop him walking around half-naked and shouting expletives. We were 50% successful.\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image5.png\"><img class=\"size-medium wp-image-1116714829\" title=\"We gave this man a t-shirt to try to stop him walking around half-naked and shouting expletives. We were 50% successful.\" src=\"/backup/image5-225x300-2011-01-24-11-05-58.png\" alt=\"We gave this man a t-shirt to try to stop him walking around half-naked and shouting expletives. We were 50% successful.\" width=\"225\" height=\"300\" /></a>[/caption]\n\nEXPERT TIP: Get onto <a href=\"http://angel.co/\" target=\"_blank\">AngelList</a> by hook or by crook — it puts you in front of 100s of great people. AngelList is improving international communication between entrepreneurs and angels massively, so hats off to <a href=\"http://venturehacks.com/\" target=\"_blank\">Naval and Nivi</a> for their efforts.\n\n<strong>Step 7: Create a hiring strategy</strong>\nWe don’t have such a large pool of people to pick from here in Tokyo — but we also don’t have the cut-throat competition for talent. Even though we’re a small company, we’re pretty visible to developers and we have a *much* more interesting environment to work in, so we’ve been able to attract great people.\n\n[caption id=\"attachment_1116714830\" align=\"alignnone\" width=\"300\" caption=\"Our hiring strategy is totally foolproof..\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image6.png\"><img class=\"size-medium wp-image-1116714830\" title=\"Our hiring strategy is totally foolproof..\" src=\"/backup/image6-300x224-2011-01-24-11-05-58.png\" alt=\"Our hiring strategy is totally foolproof..\" width=\"300\" height=\"224\" /></a>[/caption]\n\nBut in my opinion, if your startup doesn’t view hiring as a constant challenge, you’re not being selective enough.  Hiring is something we think about constantly and an area where we need to be just as creative as when building our product. The next 12 months will be a real test to our hiring tactics, not just because of location, but I’m confident we can win.\n\nEXPERT TIP: Actually sit down and set a strategy for hiring as you would anything else. Be prepared to bring people in from a long way away. Make sure you don’t choose people who just fancy a holiday. Learn the visa rules!\n\n<strong>Step 8: Consider creating a US entity</strong>\n\n<strong> </strong>\n\n[caption id=\"attachment_1116714831\" align=\"alignnone\" width=\"223\" caption=\"An important part of our trips to the US is riding Google bikes. Yes it is..\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image7.png\"><img class=\"size-medium wp-image-1116714831\" title=\"An important part of our trips to the US is riding Google bikes. Yes it is..\" src=\"/backup/image7-223x300-2011-01-24-11-05-58.png\" alt=\"An important part of our trips to the US is riding Google bikes. Yes it is..\" width=\"223\" height=\"300\" /></a>[/caption]\n\nOur company now consists of a US parent <a href=\"http://en.wikipedia.org/wiki/Delaware_corporation\" target=\"_blank\">corporation</a> (myGengo, Inc.)  and a Japanese <a href=\"http://en.wikipedia.org/wiki/Kabushiki_gaisha\" target=\"_blank\">kabushiki kaisha</a> (株式会社 myGengo), which is fully owned by the US corp. This was initially to receive US-based investment (a US company is way easier for people to understand investing in, wherever they are based).\n\nThere have been other benefits too. It has actually made dealing with people outside Japan a lot easier — for instance, subcontractors (i.e. our translators) are very suspicious of tax forms in Japanese, understandably, because they can’t understand them and often the requirements seem arbitrary. So having things come from the US makes sense.\n\nGROUP WORK: Talk to startups who’ve raised money while having their main entity overseas. They’ll have tips on how to do it without incurring massive legal fees or creating absurdly complex structures.\n\n<strong>Step 9: Focus</strong>\nWe don’t have the constant events and networking opportunities of the Bay Area. So what we do is gorge on these when we go to the US, and then come back here and focus. Particularly in the early stages, we’ve always been glad to get back to Japan and have time to give the product our full attention. Over time we see ourselves as bridging Japan and the US a lot more (and we already have fantastic myGengo team members in San Francisco).\n\n[caption id=\"attachment_1116714833\" align=\"alignnone\" width=\"300\" caption=\"Horizontal, but focused, front-end developer superstar. Go Adam!\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image12.png\"><img class=\"size-medium wp-image-1116714833\" title=\"Horizontal, but focused, front-end developer superstar. Go Adam!\" src=\"/backup/image12-300x223-2011-01-24-11-05-58.png\" alt=\"Horizontal, but focused, front-end developer superstar. Go Adam!\" width=\"300\" height=\"223\" /></a>[/caption]\n\nEXPERT TIP: Use the best advice from the Bay Area and combine it with the best of local talent.\n\n<strong>Step 10: Profit!</strong>\nIn all seriousness, it’s worth having at least a cursory thought about potential exits (if that’s what you want), and whether or not that will be in Japan or overseas. In a general sense, Japan is known more for early acquisitions rather than later, $500MM+ ones. Also, it’s possible to IPO here on much lower revenue numbers (note there are exceptions!). But if you’ve done Step 8 and set up a US entity, you’ll potentially have a whole different set of options. As always, the important thing is to concentrate on building a strong, profitable company :)\n\n[caption id=\"attachment_1116714834\" align=\"alignnone\" width=\"300\" caption=\"Treating our bodies like temples allows us to be 10x more productive than startups who don’t. Watch out.\"]<a href=\"http://500.co/wp-content/uploads/2011/01/image1.png\"><img class=\"size-medium wp-image-1116714834\" title=\"Treating our bodies like temples allows us to be 10x more productive than startups who don’t. Watch out.\" src=\"/backup/image1-300x223-2011-01-24-11-05-58.png\" alt=\"Treating our bodies like temples allows us to be 10x more productive than startups who don’t. Watch out.\" width=\"300\" height=\"223\" /></a>[/caption]\n\nThanks for reading. Stay tuned for my future post about how to (try to!) break into the Japanese market. And drop <a href=\"http://mygengo.com/\" target=\"_blank\">myGengo</a> a line if you want to know more — check out <a href=\"http://mygengo.com/string\" target=\"_blank\">String</a> if you want to localize your services, and our <a href=\"http://mygengo.com/services/api\" target=\"_blank\">API</a> for high-volume, good-quality human translation. :)",
    "type": "post",
    "path": "/2011/01/24/how-to-create-a-successful-startup-in-japan-in-10-easy-steps/"
}