{
    "title": "How We Pivoted Right After 500 Startups' Demo Day – and Survived",
    "slug": "how-we-pivoted-right-after-500-startups-demo-day-and-survived",
    "date": "2013-03-28T01:55:45.000Z",
    "url": "http://500.co/?p=1116726455",
    "uri": "http://500.co/2013/03/27/how-we-pivoted-right-after-500-startups-demo-day-and-survived/",
    "postId": "1116726455",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/03/chickendance.gif"
    ],
    "creator": "",
    "categories": [
        "300-mg",
        "advice",
        "import2",
        "pivots",
        "startups",
        "startups"
    ],
    "content": "<p dir=\"ltr\"><em><strong>Post Contributed by <a href=\"https://twitter.com/markkofman\">Mark Kofman</a></strong></em>. <em>He and <a href=\"https://twitter.com/shmonder\">Anton Litvinenko</a> are the co-founders of <a href=\"https://www.import2.com/\">Import2</a>, an online service for automated data migration. With three startups behind them, today they help businesses and consumers to move their data when switching CRMs, help desks or other software.</em></p>\n<p dir=\"ltr\">This is the story of how we shifted gears and changed our team communication tool, 300.mg, into a totally new business idea just a few weeks after we graduated from 500 Startups’ Accelerator. We’re not quite Twitter or Amazon yet, but we still have some insights to share.</p>\n<p dir=\"ltr\"><strong>How it All Started</strong></p>\n<p dir=\"ltr\">In the beginning, things went relatively smoothly; we thought a tool that would integrate all the flows of documents, tasks, and conversations would be indispensable for teams, and people shared our vision. After receiving seed funding from angels and getting into 500 Startups, we launched our product. But something was missing.</p>\n<p dir=\"ltr\">It turned out beta users just didn’t feel 300.mg was an irreplaceable tool for their productivity. We spent way too much time trying to figure out how to make it indispensable by coming up with thousands of new ideas – and none of these worked. Sometimes startup ideas just fail, but with all the effort we put into this startup as two co-founders, we were afraid to say it out loud. Finally, someone else did.</p>\n<p dir=\"ltr\"><strong>Sh!t Gets Real</strong></p>\n<p dir=\"ltr\">I remember seeing a tweet from Fab.com CEO Jason Goldberg that said, “If you spend a year on something and you haven’t figured it out, move on to something else… You can’t iterate your way to a business model.” This was the decisive moment for our startup, and it was the day we started to discuss the idea of pivoting or closing down.</p>\n<p dir=\"ltr\">We were really lucky to be part of 500 Startups family at the time. We spent hours bouncing ideas off our advisors (a special word of gratitude to Yee Lee), and our fellow batch startups helped us during difficult times (thanks to our Australian mates from<a href=\"http://make.switchcam.com/\"> Switchcam</a>).</p>\n<p dir=\"ltr\">But it was far from a smooth shift. While people may call it a “pivot,” it feels like killing something you believed in and worked super hard for with your bare hands. And as hard as it is to admit to yourself that you’ve failed, it gets a hundred times worse when you feel like you’re letting down the people who believed in you. So in a word, this transition was devastating.</p>\n<p dir=\"ltr\">I used to go on so-called “walking meetings” with my co-founder Anton, where we wandered around the city, talking and trying to understand what we wanted to do with our startup and our lives. Did we want to close down the company and start from scratch? Or if we pivot, to what? We also had a couple of job offers on the table as well as some new ideas, like – how’s this for ambitious –  reinventing postal services with focus on online shopping.</p>\n<p dir=\"ltr\"><strong>We Find Our New Idea</strong></p>\n<p dir=\"ltr\">After long hours of introspection,  we finally decided to go in a completely new direction; we wanted to build something that would solve people’s real problems.</p>\n<p dir=\"ltr\">First, Timo Rein, my friend from Estonia and co-founder of great CRM startup <a href=\"http://www.pipedrive.com/\">Pipedrive</a>, happened to be in Silicon Valley. One weekend when we went hiking to Santa Cruz mountains together, the conversation quickly turned to our startups (because seriously, what else can startup founders talk about when they aren’t at work?). Timo told me how importing data for new users was a constant headache for their customer support team. 300.mg used to be a cloud integration hub, so he had this ‘crazy’ idea of using the 300.mg code to help people easily export their data from Highrise into Pipedrive. I thought, “Why not?” and shared the idea with Anton. He liked the suggestion, and we’ve been unstoppable ever since.</p>\n<p dir=\"ltr\">We sent out a 300.mg shutdown notice, and funnily enough, it finally got us into TechCrunch. Too little, too late, but oh well. We then arranged a couple meetings with other SaaS vendors to ask if they had similar problems with data migration for their new users – getting 100% validation. And suddenly... jackpot! One vendor wrote us a $5k check to build an import service specifically for his product.</p>\n<p dir=\"ltr\">We were like:</p>\n<p dir=\"ltr\"><a href=\"/backup/chickendance-2013-03-27-13-19-55.gif\"><img class=\"alignleft size-full wp-image-1116726457\" alt=\"chickendance\" src=\"/backup/chickendance-2013-03-27-13-19-55.gif\" width=\"340\" height=\"192\" /></a></p>\n<p dir=\"ltr\">And this is how <a href=\"http://import2.com/\">Import2.com</a> was born without a single working line of code.</p>\n<p dir=\"ltr\">While the beginning was pretty sweet, we still had our work cut out for us. Data migration is not the easiest problem to tackle. There were big exciting challenges for us to overcome, but also a lot of less exciting routine work.</p>\n<p dir=\"ltr\">Our first customer, Brendan Tjahjadi from Australian SEO company QuantumLinx (who we’ll always remember), wrote us a great review after moving all their company’s records from Highrise to Salesforce with Import2. More customers came in, and they were happy to spend money on a service that saved them so much money and, most importantly, time. As more and more positive reviews were posted online, we finally began to see that we were doing something that real people used and appreciated.</p>\nFast forward 6 months, and we’ve helped hundreds of customers move between online services like Highrise, Wordpress, Salesforce, Tumblr, Pipedrive and many others. That is, in total, more than 3 million records of data moved.\n\n<strong>Here are some of the big lessons from our experience:</strong>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Always validate the customer pain.</strong> Don’t just believe what people tell you...ask people if they’re willing to pay for solving their problem before you start solving it. If they say yes, that’s a good indicator that the problem is big.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Help each other during difficult times.</strong> We can’t imagine how this story would have turned out for us without the support of our advisors and friends.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>500 Startups is family.</strong> We met so many people through 500 who helped us grow and see problems from a different perspective. And the sense of belonging to this big community that is always ready to help when you need it is priceless.</p>\n</li>\n</ul>\n<p dir=\"ltr\">Of course, this is just part of our larger pivot story. If you have any questions for me, feel free to leave a comment below or <a href=\"https://twitter.com/markkofman\">send me a message on Twitter.</a> You can keep up with what’s happening at Import2 by <a href=\"http://www.angel.co/import2\">following us on AngelList.</a></p>",
    "type": "post",
    "path": "/2013/03/27/how-we-pivoted-right-after-500-startups-demo-day-and-survived/",
    "backgroundImage": "/backup/cliff1-960x540-2013-03-27-13-19-55.jpg"
}