{
    "title": "How to (Sustainably) Make the Startup Office More Livable",
    "slug": "how-to-sustainably-make-the-startup-office-more-livable",
    "date": "2010-10-11T17:39:01.000Z",
    "url": "http://blog.500startups.com/?p=1116714267",
    "uri": "http://500.co/2010/10/11/how-to-sustainably-make-the-startup-office-more-livable/",
    "postId": "1116714267",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/10/captainunderpants-150x150.jpg",
        "http://500.co/wp-content/uploads/2010/10/daveschappell-150x150.jpg",
        "http://500.co/wp-content/uploads/2010/10/ts-office.jpg?w=225",
        "http://500.co/wp-content/uploads/2010/10/zach-and-stella.jpg?w=300"
    ],
    "creator": "",
    "categories": [
        "captain-underpants",
        "dave-schappell",
        "dogs",
        "guest-posts",
        "mentors",
        "mentors",
        "office",
        "seattle",
        "space-design",
        "startup-office",
        "startups",
        "teachstreet",
        "tips"
    ],
    "content": "<div><a href=\"http://500.co/wp-content/uploads/2010/10/captainunderpants.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714304\" title=\"captainunderpants\" src=\"/backup/captainunderpants-150x150-2010-10-11-10-12-39.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a><a href=\"http://500.co/wp-content/uploads/2010/10/daveschappell.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714305\" title=\"daveschappell\" src=\"/backup/daveschappell-150x150-2010-10-11-10-12-39.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a></div>\n<em>Meet one of our super-mentors, <strong>Captain Underpants</strong> (aka <a href=\"http://twitter.com/daveschappell\" target=\"_blank\">Dave Schappell</a>). In his own words: “I’m the founder, CEO and door-desk-builder at <a href=\"http://www.teachstreet.com/learn\" target=\"_blank\">TeachStreet </a>– a Seattle-based local/learning startup, helping people find great local (and online) teachers/schools/classes, and helping those schools and teachers with effective online advertising/lead-gen/payment processing tools.\" </em>\n\n<em>In this post, Dave talks about how to make your startup office space livable while not breaking the bank.</em>\n\nLet’s face it – all pre-entrepreneurs dream of a garage-, basement- or coffee shop-catalyzed startup, run with a frugal mindset and a just-do-it mentality (we all hate The Man and his cubicle farms, right?!?)  And a huge percentage of startups do just that, for a few days, weeks or even months.  But after the shine wears off, you start longing for a little bit of space between work and loved ones (or fellow coffee patrons).\n\nThis post helps share some best practices that we learned along the way.\n\n<strong>1. A (nice) office doesn’t need to cost you a lot.</strong>\nWe’re in downtown Seattle, next to a Whole Foods, and in the same area of town as the new Amazon.com headquarters.  We’re paying $13 per sq ft (per year), at the same time as other startups are blindly paying in the $20s.  That gets us a nice 1,700 SF space that we comfortably fit ~10 employees, plus a number of non-employees (who we charge per-desk fees… see #10 below).  So, that’s $1,842 per month (before netting out our subleases) – yes, that’s not ‘free’, but it’s not bank-breaking either.\n\n<strong>2. Get a Real Estate advisor/rep</strong>\nI honestly don’t know how they make money (I assume they get a % of the lease amount, and are busting their butts because they know that some of these startups may become the next Google), but <a href=\"http://wapartners.com/People/Seattle/?eid=3\">our Real Estate advisor/consultant/tenant rep</a> is awesome – find one like him near you.  He represents the biggest companies in town, but treats our little startup the same.  Benefits include finding us all available space, negotiating down rates (as much as 30% off list price), and helping with any lessor issues.  You’re foolish not to have someone manage this for you.\n\n<strong>3. Office furniture can be acquired cheap</strong>\nI know everyone already knows this, but <a href=\"http://craigslist.org/\">Craigslist </a>is amazing. We outfitted our original office for less than $200, not including desks. We also bought some raw materials and <a href=\"http://blog.teachstreet.com/homepage/learning-to-make-door-desks/\">assembled a number of door desks</a> in a few days. It probably wasn’t worth the sweat and labor vs. IKEA, but it’s still always cool to have a door desk, no?\n\nVideo of team during construction below. (Doesn’t that look like fun?)\n\n<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"480\" height=\"385\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"http://www.youtube.com/v/LVxtGF1IvBU?fs=1&amp;hl=en_US\" /><param name=\"allowfullscreen\" value=\"true\" /><embed type=\"application/x-shockwave-flash\" width=\"480\" height=\"385\" src=\"http://www.youtube.com/v/LVxtGF1IvBU?fs=1&amp;hl=en_US\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>\n\n<strong>4. Snacks!</strong>\nEarly on, we asked the team what could make the office a little more palatable (pardon the pun) during the long work hours/launch sessions.  Their answer was “snacks would be nice”.  I was shocked at how easy this one was to say “yes” to – for less than $75 a week (a tiny amount compared to salaries), you add some variety and a ‘perk’ that you don’t/won’t find at larger companies. It’s crazy that more companies don’t do this!  We made this less of a chore for any one person by having the responsibility for ordering shared among all co-workers (one person gets snacks each week).  That allows for some personal preferences to be accommodated, and it makes it a community task that’s sort of fun.  (Note – AmazonFresh delivery service makes this one quite easy)\n\n<strong>5. Paint &amp; Comfort-ize</strong>\nAfter inhabiting our office for over a year, someone commented that it felt a little like an asylum, with white walls, no comfortable furniture, no decoration, etc.  So, one of our more creative souls picked out a bunch of paint swatches, bought some supplies, and we made a day of no-TeachStreet-work and got to painting, couch-buying and decorating – end result looks pretty sweet, if we do say so ourselves, and we all did it together!\n<a href=\"http://500.co/wp-content/uploads/2010/10/ts-office.jpg\"><img class=\"alignnone size-medium wp-image-1116714288\" title=\"ts office\" src=\"http://500.co/wp-content/uploads/2010/10/ts-office.jpg?w=225\" alt=\"\" width=\"225\" height=\"300\" /></a>\n\n<strong>6. Cleaning Weekly</strong>\nIn addition to sharing ‘snack duties’ each week, we also have one person responsible for emptying the sink (when the elves magically leave dirty dishes without cleaning them…), emptying odoriferous trash cans, excess garbage, etc. We occasionally ‘splurge’ on a cleaning service (about once a week). It costs all of $150/month (&lt;$40/week) for this extravagance, but it removes the need for anyone to sport the vacuum cleaner.  Trust me, this one’s worth it.\n\n<strong>7. Weekly celebrations (yes, make it happen every week!)</strong>\nBeers on Friday afternoons, along with some ping pong, music, and fun. In addition, we have a <a href=\"http://www.danshapiro.com/blog/2010/06/your-company-culture-is-a-meaningless-platitude/\">quirky team exercise</a> where a different team member teaches everyone else ‘something new’ each Friday (it fits with our TeachStreet brand/mission) – almost all startups can find something that fits with their mission too.  It’s nice to not talk about work, and unwind a little bit before the weekend (when even more work often occurs).  And, we share beer-buying duty too… usually the same person who’s ‘Teaching Something New’.\n\n<strong>8. Reward (TV, music)</strong>\nWe recently pondered moving to a new neighborhood, which would mean an increase in $/sq ft but a reduced commute for many of us.  We decided against it, for a variety of reasons.  But we still wanted to celebrate a string of recent successes.  We chose to pimp up the office a bit more – voila, a $749 big-screen (from Costco) and a $300 Sonos for group music – pretty sweet, eh?  And, you can follow our <a href=\"http://www.last.fm/user/teachstreet\">kick-ass shared TeachStreet Last.fm</a> music channel (any terrible songs are courtesy of our CTO <a href=\"http://www.twitter.com/daryn\">@daryn</a> and his warped tastes)\n\n<strong>9. Dogs. Arf!</strong>\nIf you’re the dog-loving variety, include them in your lease.  Just be sure to make dog owners accountable for cleaning up after any messes.  And, if anyone is allergic to dogs, fire them. (Just kidding. Or am I?)\n\nThese are our security dogs, <a href=\"http://www.dogster.com/dogs/394257\" target=\"_blank\">Zach the Dog</a> and <a href=\"http://www.dogster.com/dogs/1158692\" target=\"_blank\">Stella the Frenchie</a>. (By the way, isn’t Stella much cuter than <a href=\"http://twitter.com/nickeythepug\">Nickey</a>, the ferocious <a href=\"http://500startups.com/\">500 Startups</a> guard pug?)\n\n<a href=\"http://500.co/wp-content/uploads/2010/10/zach-and-stella.jpg\"><img class=\"alignnone size-medium wp-image-1116714289\" title=\"zach and stella\" src=\"http://500.co/wp-content/uploads/2010/10/zach-and-stella.jpg?w=300\" alt=\"\" width=\"300\" height=\"250\" /></a>\n\n<strong>10. Sublease</strong>\nInvariably, most of you will lease a space slightly larger than what you need.  You’ll also happen upon fellow entrepreneurs who only need 1-2 desks until they validate their business and/or secure some funding.  Share some of your space (and get some other entrepreneurial energy in your office)!  We charge a below-market $250/desk to a few folks, and thus reduce our net out-of-pocket rent expense to &lt;$1k.  And, yes, we’re a venture-funded startup, but we see no reason to waste that $ on things that don’t help customers.\n\nI’m sure I missed a bunch of other great ideas, so please share yours in the comments below.\n\nI hope that some of the above helps you to make the jump to your own World Headquarters in a way that doesn’t strain your resources. You’ll be amazed how many of your friends are envious of your office. It’ll hard for them to hide their jealousy when they wander in and experience the energy behind an organic startup space, complete with dog!",
    "type": "post",
    "path": "/2010/10/11/how-to-sustainably-make-the-startup-office-more-livable/"
}