{
    "title": "How We Doubled Our Conversion Rate - Bombfell Co-Founder Bernie Yoo",
    "slug": "how-we-doubled-our-conversion-rate-bombfell",
    "date": "2014-03-24T16:30:48.000Z",
    "url": "http://500.co/?p=1116731935",
    "uri": "http://500.co/2014/03/24/how-we-doubled-our-conversion-rate-bombfell/",
    "postId": "1116731935",
    "description": "",
    "images": [
        "https://d262ilb51hltx0.cloudfront.net/max/874/1*Kc8uWhi5VkVIG_bXhd4kWA.png",
        "https://d262ilb51hltx0.cloudfront.net/max/800/1*Q0KpIc78G6gRS-M1butxUg.png",
        "https://d262ilb51hltx0.cloudfront.net/max/800/1*W1iiRkxdEwD2PFWUfAJicw.png"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "distribution",
        "distribution",
        "growth",
        "guest-posts",
        "marketing",
        "startups",
        "startups"
    ],
    "content": "<strong><em>Bombfell is a 500 Startups-backed company, and completed the 500 Startups Accelerator program in 2012. This post from Bombfell co-founder Bernie Yoo is part of our Distribution series, presenting actionable material your startup can use today. </em></strong>\n\n<em><strong>More marketing tips @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and via <a title=\"Join the Distrosnack newsletter\" href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">Distrosnack</a>, our daily email of bite-sized marketing tips and awesome GIFs.</strong>\n</em>\n\n<span style=\"line-height: 1.5em;\">We recently 2x’d the conversion rate for </span><a style=\"line-height: 1.5em;\" href=\"https://medium.com/r/?url=http%3A%2F%2Fwww.bombfell.com%2F\">Bombfell</a><span style=\"line-height: 1.5em;\">: </span>\n\n<figure><img alt=\"\" src=\"https://d262ilb51hltx0.cloudfront.net/max/874/1*Kc8uWhi5VkVIG_bXhd4kWA.png\" width=\"700\" height=\"324\" data-width=\"874\" data-height=\"404\" data-action=\"zoom\" data-action-value=\"1*Kc8uWhi5VkVIG_bXhd4kWA.png\" /></figure>&nbsp;\n\nOddly, we did this by making things more complicated.\n\nSome context: the first question people want to know if you position yourself as a monthly subscription is <em>how much will it cost every month? </em>You have to answer that question for a potential customer <strong>clearly</strong>.\n\nBut for a service like ours, which sources an extensive variety of products (Button-down shirts! Jeans! Coats! Wallets! Oh, and bags! And much more..) from third-party designers at a wide range of price points, communicating pricing expectations clearly can be challenging.\n\nSo, we outsmarted ourselves. To be clear we had to make it <em>simple</em>, right? For much of 2013 we simplified our pricing explanation as much as possible — down to just three options. Below is the “three-tier” budget system we came up with:\n\n<figure><img alt=\"\" src=\"https://d262ilb51hltx0.cloudfront.net/max/800/1*Q0KpIc78G6gRS-M1butxUg.png\" width=\"654\" height=\"209\" data-width=\"654\" data-height=\"209\" /></figure>Essentially, you set a maximum $ ceiling that you’re willing to pay each month for clothes — a monthly clothing budget. Easy peasy.\n\nBut something gnawed at us for months after we rolled it out. Prospective users kept asking for clarification on how pricing works. Not all the time, mind you, but it was common. <em>So if I’m on the premium tier, will everything I’m sent cost $129? Am I committing to spend at least $129 every month? </em>\n\nNo, we’d patiently explain, that’s not how we do things. We’d tell them it’s just a budget ceiling, further explain how that budget works, then they’d understand and either they’d sign up or they wouldn’t. <em>Silly customers</em>, we’d chuckle to ourselves, <em>it’s laid out right there on the website!</em>\n\n<strong>NO! BAD DOG. Stop telling them how you do things, and start listening.</strong>\n\nHere’s the problem we were encountering: most people don’t pencil out a general “clothing” budget for the year. It’s just not how they think about buying clothes. Forcing them to pick an overarching, general budget creates uncertainty and confusion: how much will I spend, and what exactly will I get? These feelings aren’t conducive to trying something new.\n\nSo how <em>do</em> people think about buying clothes?\n\nWell, look all around — clothing is a huge, established market so there’s a precedent for pricing that everyone’s comfortable with. Prices vary across categories, they vary according to quality, they vary depending on the brand, they just vary, period. And we all understand and accept that, no explanation necessary.\n\nAs a result, what you’re willing to pay for a pair of jeans? For most guys that’s very different from what you’re willing to pay for a polo shirt, for a pair of shorts, for a winter coat, and on and on.\n\nWe started A/B testing a new variant on pricing, one that was more complicated and required more work from the user. But, we thought it might be more intuitive as well. It threw out the idea of setting a single overall clothing budget, which might look cleaner and more like a typical web app, but was actually confusing and stalling users.\n\nInstead, we tested the idea that your budget varies depending on the type of clothing:\n\n<figure><img alt=\"\" src=\"https://d262ilb51hltx0.cloudfront.net/max/800/1*W1iiRkxdEwD2PFWUfAJicw.png\" width=\"373\" height=\"482\" data-width=\"373\" data-height=\"482\" /></figure>And well, it destroyed the old pricing model in a split-test. We rolled it out sitewide on December 25, and the graph at the top shows what’s happened since.\n\nSo let me be the first to say: I’m sorry, potential customers we turned away in 2013. We were too busy telling you how things are to allow us to hear how things <em>should be</em>. We’ll try hard to listen better going forward.\n\n(But why don’t you understand what <a title=\"Bombfell Threads Men's Subscription Clothing Online\" href=\"https://www.bombfell.com/threads\" target=\"_blank\">type of clothes we send</a>? I mean, it’s right there on the website…)\n\n<em>Bernie Yoo is co-founder of <a title=\"Bombfell.com\" href=\"http://bombfell.com\" target=\"_blank\">Bombfell</a>, the subscription clothing startup that's been blowing up guy's closets since completing the 500 Startups Accelerator program in 2012. </em>\n<h2 dir=\"ltr\"></h2>\n<h2 dir=\"ltr\">What's Next?</h2>\n<p dir=\"ltr\">If you enjoyed this post, first check out these additional resources for how you can up your game from the 500 Distribution team:</p>\n\n<ul>\n\t<li><a title=\"5 Distribution Experiments You Can Do For $10 Or Less\" href=\"http://500.co/2014/03/13/5-distro-experiments-you-can-do-on-10-or-less/\" target=\"_blank\">5 Distribution Experiments You Can Do For $10 Or Less</a></li>\n\t<li><a title=\"How to Suck Less at E-mail Marketing\" href=\"http://500.co/2013/08/13/how-to-suck-less-at-e-mail-marketing/\">How to Suck Less at Email Marketing</a></li>\n\t<li><a title=\"The Power of Trigger Emails\" href=\"http://500.co/2013/10/25/the-power-of-trigger-emails/\">The Power of Trigger Emails</a></li>\n</ul>\n<p dir=\"ltr\">Next, sign up to get a daily bite-sized distro hack (and an awesome GIF) delivered to your inbox:</p>\n<strong>&gt;&gt; <a title=\"Distrosnack 500 Startups Distribution Email Newsletter\" href=\"http://eepurl.com/BfYXn\">Subscribe to Distrosnack here</a> &lt;&lt;</strong>",
    "type": "post",
    "path": "/2014/03/24/how-we-doubled-our-conversion-rate-bombfell/",
    "backgroundImage": "/backup/bombfell_box_500_co-800x540-2014-03-24-14-10-30.jpg"
}