{
    "title": "How to Hack Distribution for AngelList and Get MORE MONEY",
    "slug": "how-to-hack-distribution-for-angellist-and-get-more-money",
    "date": "2013-07-23T21:01:14.000Z",
    "url": "http://500.co/?p=1116728777",
    "uri": "http://500.co/2013/07/23/how-to-hack-distribution-for-angellist-and-get-more-money/",
    "postId": "1116728777",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/07/money.gif",
        "http://500.co/wp-content/uploads/2013/07/glamour.jpg",
        "http://500.co/wp-content/uploads/2013/07/fcc5d754f88f9ab057613075800a4927-original.png",
        "http://500.co/wp-content/uploads/2013/07/47a6d58c56d46027a943c3ebd18432ba-original-1024x434.png",
        "http://500.co/wp-content/uploads/2013/07/Screen-Shot-2013-07-23-at-1.45.02-PM.png",
        "http://500.co/wp-content/uploads/2013/07/awkward.gif"
    ],
    "creator": "",
    "categories": [
        "angellist",
        "distribution",
        "distribution-tuesday",
        "investors"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em>\n\n<a href=\"http://angel.co\" target=\"_blank\">AngelList</a> is easily one of the most disruptive platforms available to start-ups today. It is potentially ahead of its time, but lucky for us, “Oh, these times they are a-changing.” The big gears at the SEC are turning, and as a result, pointing to a pending shift in how start-ups and investors can raise money. Yes, this might actually work. So are you ready to take full advantage of AngelList?\n\n<a href=\"/backup/money-2013-07-23-13-16-01.gif\"><img class=\"aligncenter size-full wp-image-1116728829\" alt=\"money\" src=\"/backup/money-2013-07-23-13-16-01.gif\" width=\"500\" height=\"237\" /></a>\n\nBy way of background, I recently had a tough run with fundraising—like most founders today. You read a great deal about companies receiving huge amounts of cash on crazy terms, but the truth is that most companies don’t have this experience. Instead, it’s a brutal fight for every dollar. As the traditional channels had stopped working for me, I turned to AngelList. Heck, I even turned to craigslist to sell extra equipment for cash—but that’s a whole other story.\n\nOver the course of a few months, I added 1,000+ followers to my company’s and personal AngelList’s profiles. We received 90 introductions from investors and actually managed to raise some decent cash purely via those introductions. This was something completely different from climbing up Sand Hill Road. Indeed, something much better.\n\nBased on my recent experience, here are my recommendations along with some things I’d have done differently.\n<h2><b>Looking Good</b></h2>\nHey, guess what? Looks and presentation do really matter. In fact, having a great presentation and some semblance of a brand is actually the price of entry for start-ups today. The same goes for AngelList, so make sure your profile is complete, well thought out, and presents your company in the best possible light. This is the first step to getting distribution and attracting the right investors. Some general tips include:\n<ul>\n\t<li>Have really kick-ass team AngelList profiles. Ensure every key member of your team has a good photo and bio that establishes why they all are kick ass.</li>\n\t<li>The “Product” text area is your chance to quickly inform an investor exactly what your company does. Avoid too many buzzwords and jargon and instead, make quick, bold statements. This is also a good  chance to add a link to additional information or to reviews of your company. Keep this to around 250 words total.</li>\n\t<li>Add the customers and press if you have either. Capture all important press events here and show that you’re able to create small news cycles that extend beyond your launch.</li>\n\t<li>Do not be shy. Be upfront with your traction and your success. Stop hiding this critical material deep within your presentation materials and AngelList profile. Let it be free, especially if you have data points worth bragging about.</li>\n</ul>\nRegarding the images that appear on your profile, it’s best to nail the following:\n\n<b>1) Website Screenshot or Product Photo</b>\n\nYour first inclination may be to throw up a website screenshot. This is OK in most cases, unless your website is incredibly unsexy and not terribly compelling. Regardless, make sure it’s a nice high-quality screenshot roughly around the size/scale of 1020x574. This size should look good in both the small preview and larger image when clicked. If you’re shipping a physical product, here’s the best place to show your highest-quality product photo. This is your glamour shot!\n\n<a href=\"/backup/glamour-2013-07-23-13-16-01.jpg\"><img class=\" wp-image-1116728847 alignnone\" alt=\"glamour\" src=\"/backup/glamour-2013-07-23-13-16-01.jpg\" width=\"512\" height=\"399\" /></a>\n\n<b>2) Big-Ass Traction Graph</b>\n<p style=\"text-align: center\"><a href=\"/backup/fcc5d754f88f9ab057613075800a4927-original-2013-07-23-13-16-01.png\"><img class=\"aligncenter  wp-image-1116728809\" style=\"border: 1px solid black\" alt=\"fcc5d754f88f9ab057613075800a4927-original\" src=\"/backup/fcc5d754f88f9ab057613075800a4927-original-2013-07-23-13-16-01.png\" width=\"614\" height=\"415\" /></a></p>\n<p style=\"text-align: left\">/via <a href=\"https://angel.co/wittlebee\">Wittlebee</a></p>\nRemember how we discussed the need to stop being shy? Show the damn numbers, <a href=\"http://www.bothsidesofthetable.com/2013/07/16/ring-the-freaking-cash-register/\">ring the freaking cash register</a>, or do something to demonstrate your hard work—preferably in graph format that is going up and to the right. It doesn’t have to be “hockey sticking,” but I hope you’re able to show some degree of month-over-month growth.\n\n<b>3) Team Photo</b>\n\nHere’s something you don’t see much on AngelList profiles: big high-quality photos of the team behind the company. I realize the team members’ profile photos also appear further down the page, but the team is extremely important to investors. As such, you might want to consider a pseudo-professional group shot or something that reinforces authority in your vertical.\n\n<b>4) UI/UX + Multi-Screens</b>\n<p style=\"text-align: center\"><a href=\"http://500.co/wp-content/uploads/2013/07/47a6d58c56d46027a943c3ebd18432ba-original.png\"><img class=\"aligncenter  wp-image-1116728807\" alt=\"47a6d58c56d46027a943c3ebd18432ba-original\" src=\"/backup/47a6d58c56d46027a943c3ebd18432ba-original-1024x434-2013-07-23-13-16-01.png\" width=\"655\" height=\"278\" /></a>\n/via <a href=\"https://angel.co/outbox\">Outbox</a></p>\nOK, fine. I understand you’re quite proud of some of the little buttons and other UI tricks in your app. These probably mean very little to investors, but it’s still OK to show them off. If your app works across multiple screens, you’ll also want to show all those form factors in one shot.\n\n<b>5+) Culture and/or Customers  </b>\n\nJust as with the team photo, here’s where you can further illustrate the people behind the company and company culture or feature marquee customers who are using your product. Make it look relatable and as though their money can help you gain more customers and users just like them.\n<h2><b>Always Be Hiring</b></h2>\nAngelList also allows you to post job openings in your company. This feature is great for several reasons. To start with, you’ll get extremely well-qualified prospects to review. So even if you’re not hiring today, this is great way to start narrowing down candidates or to begin getting to know who’s on the market. Furthermore, companies that are hiring get featured on the AngelList homepage and elsewhere more often. It’s not bad for optics, too, for investors to see you building out the team.\n<h2><b>Getting Distribution</b></h2>\nLet’s get right down to it and talk about how to maximize distribution and investor reach. Your mileage will vary. But here are some general techniques I have used or seen other founders take great advantage of.\n\n<b>Use the Native Follow Buttons:</b>\n\nLike most social networks, AngelList offers follow buttons that can be embedded on a website or blog. I highly recommend using them and placing them in every relevant location. Some good examples of where you might include them is on your “About Us” page and author byline or even in the footer of your website. You can locate these buttons under your company page by clicking the \"Embed\" link.\n\n<b>Put It in the Signature:</b>\n\nAnother great location to place your AngelList profile link is in the signature of your e-mail. If your brand is more consumer focused, you can also set up a separate e-mail signature that is more investor themed. In this case, strip out all the extra junk and simply include a single link to your AngelList profile with a call to action to follow you.\n\n<b>Use CRM and Mailchimp for Investors:</b>\n\nKeeping track of investors is not easy. Are they reading your e-mails? Have you kept in touch after the initial introduction? Some easy ways to better manage these communications is with a Gmail plugin called Streak (<a href=\"http://streak.com\">http://streak.com</a>) or with the well-loved e-mail marketing tool <a href=\"http://mailchimp.com\">MailChimp</a>. Within MailChimp or most ESPs (e-mail service providers), you can easily set up and manage a list of investor leads. Using a service like this allows you to see which investors open your e-mails and when to set up autoresponders to automate some of your communications. Of course, this also gives investors an easy way to unsubscribe if they no longer want to hear from you. If that happens, it’s likely a strong signal they’re not going to write that check.\n\n<b>Build Something Cool with the AngelList API</b>\n\nDo you have some developer capabilities?  Set them loose on the <a href=\"https://angel.co/api\">AngelList API</a>. Here is one of the more underutilized APIs out there, so it’s ripe for innovation. In my case, I set up <a href=\"http://angel5.co\">Angel5</a>, a simple blog that sorts and ranks investors by region, market, and other factors. This weekend project generated press, investor interest, and much more for us. What can you do to impress investors and give back to other founders in your same position?\n\n<b>Get To Know the AngelList Staff</b>\n\nThe team at AngelList works extremely hard to feature and help the start-ups on its platform. If your start-up is generating enough interest from investors, the AngelList staff actually actively reach out. For some start-ups, they help promote you through their e-mail and other channels. You can also reach out anytime, and you’re likely to find they are ready and willing to point you in the right direction or assist in other ways.\n\n<b>Coordinate Your Perfect Storm</b>\n\nHere’s where it all comes together. Creating that “perfect storm”-like campaign is the Holy Grail for most marketing efforts. In the case of AngelList, you probably want to time this for the beginning of your fundraising efforts or at a point when you need that extra push. Think of ways you can generate a great deal of interest in a short window of time. The best way to start is to approach existing investors (if applicable) and to have them follow and share your profile on AngelList. Next, you want to encourage them and any investors you speak with to click the “’I’m Interested” option located under the follow buttons. This is the strongest signal you can send to AngelList and the best way to influence its trending algorithms. It's also important that high-quality investors express interest in your company. More information on that is <a href=\"https://angel.co/help/startups#trend\">available here</a>.\n\nGenerally I would recommend dedicating a specific day to growth for your AngelList page. That's the day you want to <del>beg</del> politely ask for a follow, reshare or more. In other words, call in a few favors and ask your existing investors to do the same with their own networks.\n\n<img class=\"aligncenter size-full wp-image-1116728801\" alt=\"Screen Shot 2013-07-23 at 1.45.02 PM\" src=\"/backup/Screen-Shot-2013-07-23-at-1-45-02-PM-2013-07-23-13-16-01.png\" width=\"423\" height=\"153\" />\n\nWhile there are no silver bullets to achieving success on AngelList, or for fundraising in general, I hope these tips help. Above all, your focus should be on finding the right investors for your start-up and getting the ones with a high degree of authority engaged with your profile. It’s not easy, but it sure beats awkwardly waiting in those lobbies on Sand Hill Road.\n\n<a href=\"/backup/awkward-2013-07-23-13-16-01.gif\"><img class=\"aligncenter size-full wp-image-1116728833\" alt=\"awkward\" src=\"/backup/awkward-2013-07-23-13-16-01.gif\" width=\"500\" height=\"250\" /></a>\n\nBest of luck.<a href=\"#_msocom_19\">\n</a>",
    "type": "post",
    "path": "/2013/07/23/how-to-hack-distribution-for-angellist-and-get-more-money/",
    "backgroundImage": "/backup/money-960x540-2013-07-23-13-16-01.jpg"
}