{
    "title": "How to Talk to Investors about Marketing and Growth",
    "slug": "how-to-talk-to-investors-about-marketing-and-growth",
    "date": "2013-07-02T16:46:22.000Z",
    "url": "http://500.co/?p=1116728195",
    "uri": "http://500.co/2013/07/02/how-to-talk-to-investors-about-marketing-and-growth/",
    "postId": "1116728195",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/07/quote1.jpg",
        "http://500.co/wp-content/uploads/2013/07/I-have-no-idea-what-I-am-doing.jpg",
        "http://500.co/wp-content/uploads/2013/07/quote2.jpg",
        "http://500.co/wp-content/uploads/2013/07/quote3.jpg",
        "http://500.co/wp-content/uploads/2013/07/qoute4.jpg",
        "http://500.co/wp-content/uploads/2013/07/quote5.jpg",
        "http://500.co/wp-content/uploads/2013/07/brentrambo.gif",
        "http://500.co/wp-content/uploads/2013/07/quote6.jpg"
    ],
    "creator": "",
    "categories": [
        "distribution",
        "distribution-tuesday",
        "investors"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em>\n\nIn the ultra-competitive world of startups, having engineering power and a great design is merely the price of admission. Marketing is the element that will actually grow your business enough to get it funded, or better yet, make it sustainable. So, do you know how to speak about marketing in your pitch meetings? Here are a few examples of what not to say and what to say that will help score you points with investors.\n<h2>Things to never say:</h2>\n<img class=\"aligncenter size-full wp-image-1116728215\" alt=\"quote1\" src=\"/backup/quote1-2013-07-02-13-11-46.jpg\" width=\"800\" height=\"100\" />Stop saying this, and especially stop saying it with a huge smile on your face. This is not something to be proud of, and any investor of note will think this sounds really stupid. You might as well save your breath and hand the investors a piece of paper with the following image:\n<p style=\"text-align: center;\"><img class=\"aligncenter\" alt=\"\" src=\"/backup/I-have-no-idea-what-I-am-doing-2013-07-02-13-11-46.jpg\" width=\"441\" height=\"238\" align=\"center\" /></p>\n\n\n<hr />\n\n<img class=\"aligncenter size-full wp-image-1116728219\" alt=\"quote2\" src=\"/backup/quote2-2013-07-02-13-11-46.jpg\" width=\"800\" height=\"100\" />WRONG. Investors are looking for big businesses so if your business is never going to need actual marketing, then it must be operating on a pretty small scale. Every business, especially the biggest ones, must aggressively market their products or services. The bigger your business becomes, the truer this is. Having a product or service go viral is nice, and important, but only the outliers can build an entire business on virality alone.\n\n<hr />\n\n<img class=\"aligncenter size-full wp-image-1116728221\" alt=\"quote3\" src=\"/backup/quote3-2013-07-02-13-11-46.jpg\" width=\"800\" height=\"100\" />Great! But remember: press hits are just that, hits. And trust me, the hits rarely keep coming. If you’re riding the ups and downs of press hits, you’re about to find out that hits are almost never sustainable. At the same time, if you’re leaning heavily on technology press, you’re barely scratching the surface in terms reaching your audience at scale. Your company needs press but press coverage should be supplemental to your larger marketing plans.\n\n&nbsp;\n<h2>Things you should say:</h2>\n<img class=\"aligncenter size-full wp-image-1116728227\" alt=\"qoute4\" src=\"/backup/qoute4-2013-07-02-13-11-46.jpg\" width=\"800\" height=\"100\" />Regardless of scale or budget you should always be testing many different marketing channels.  In this example, notice that the number of marketing channels mentioned is in double digits, implying that you have tried more than 10. Also, this statement should end with some form of brilliant marketing insight you’ve managed to pull out of these tests. This could be a data point about your demographic or a marketing technique that worked extremely well.\n\nIt’s incredibly important that an investor feels you’re not going to be “learning on the job” with their money. So you want to show them you already know where you’re going to be spending the money effectively. That scores you a lot of points and, in the end, likely saves everyone involved a lot of money.\n\n<hr />\n\n<img class=\"aligncenter size-full wp-image-1116728229\" alt=\"quote5\" src=\"/backup/quote5-2013-07-02-13-11-46.jpg\" width=\"800\" height=\"100\" />That’s a bold statement and it’s critical to nail it early on for some businesses. The ability to put a hard number down for your acquisition costs is no easy feat, I get that. However, those who can do it gain a huge advantage with investors. It helps investors understand whether your business is scalable or some kind of fluke. It shows them you understand how this number works and shapes your business. Most of all, it shows you know your shit.\n\n<a href=\"/backup/brentrambo-2013-07-02-13-11-46.gif\"><img class=\"size-full wp-image-1116728255 aligncenter\" alt=\"brentrambo\" src=\"/backup/brentrambo-2013-07-02-13-11-46.gif\" width=\"320\" height=\"240\" /></a>\n\nOne note: It’s important that this number be both accurate and exact. So don’t use ranges when referring to acquisition costs. Let the investor know you’ve figured this out literally down to the penny.\n\n<hr />\n\n<img class=\"aligncenter size-full wp-image-1116728231\" alt=\"quote6\" src=\"/backup/quote6-2013-07-02-13-11-46.jpg\" width=\"800\" height=\"100\" />A common question asked during a pitch is “Where/how are you going to scale this business?” Here’s your chance once again to show off anything you’ve learned during your initial tests. Bonus points if you can add any additional flavor in terms of why that channel is such a strong (and scalable) source of marketing for your business.\n\nOver time your best channel for user acquisition may change. In those early days it's more important to identify the first major veins you'll be mining against. In many cases your best marketing channel will prove to be a total surprise.\n\n<hr />\n\n&nbsp;\n\nEvery business has different marketing needs. But in almost every case, having a deeper understanding of marketing during the early stages will only benefit your company in the long run. Instead of throwing up your hands with regard to growth, stand confident. Show investors you’re well equipped to produce measurable results they can get excited about. Show them that even if you’re an underdog, you’re ready for the challenges that lie ahead.\n<p style=\"text-align: center;\"><strong>Are you a 500 company who needs help with distribution? <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">Let's talk</a>.</strong></p>",
    "type": "post",
    "path": "/2013/07/02/how-to-talk-to-investors-about-marketing-and-growth/"
}