{
    "title": "Implementing Mixpanel: What You NEED to Know",
    "slug": "implementing-mixpanel-what-you-need-to-know",
    "date": "2013-12-04T17:46:47.000Z",
    "url": "http://500.co/?p=1116730765",
    "uri": "http://500.co/2013/12/04/implementing-mixpanel-what-you-need-to-know/",
    "postId": "1116730765",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/12/people.png",
        "http://500.co/wp-content/uploads/2013/12/events.png"
    ],
    "creator": "",
    "categories": [
        "analytics",
        "distribution",
        "event-analytics",
        "google-analytics",
        "mixpanel"
    ],
    "content": "<p dir=\"ltr\"><em>This post is part of the ongoing Distribution series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em></p>\nYou might be overwhelmed by the sheer number of analytics platforms for startups. In my opinion, event-based analytics provide the most insight, unlike a platform like Google Analytics that focuses on usage metrics like pageviews and time on site. After testing out a few options, I've come to really like <a href=\"http://mixpanel\" target=\"_blank\">Mixpanel</a> because it's simple, fast, and has great documentation so you can get up and running quickly.\n<p dir=\"ltr\">But even with great documentation, there are a few mistakes that first timers are likely to make. Here’s what you need to know to get started.</p>\n\n<h1 dir=\"ltr\">Client vs. Server Side Implementation</h1>\n<p dir=\"ltr\">The first thing to know is the difference between a client side and server side implementation. With a client side implementation, you are sending events/properties to Mixpanel via javascript. The javascript gets triggered from your user’s computer, as opposed to a server side implementation which gets sent directly from your servers.</p>\n<p dir=\"ltr\">There aren’t many differences between the two types of implementation, but this is why I think server side is the way to go:</p>\n<p dir=\"ltr\">With client side implementation, many features of Mixpanel are built right into the javascript library. The idea of super properties (don’t worry, I’ll explain later), aliasing new users to existing or newly registered users, setting and creating distinct IDs –  all of this is just built in. But even with all of these features, I <strong>still</strong> choose to do server side implementations.</p>\n<p dir=\"ltr\">Doing everything server side is more manual, and this means you have more control over everything. You will need to code certain features yourself, but you’ll have a better understanding of how everything works. Lastly, you will notice that sending events and properties server side is more accurate. The vast majority of internet users have javascript enabled in their browser, but it’s still not 100%. I want control and accuracy, which is why I choose server side. The rest of this blog post will assume you are using a server side implementation.</p>\n\n<h1 dir=\"ltr\">Distinct IDs</h1>\n<p dir=\"ltr\">Distinct IDs are the way all event based analytics platforms associate different events that occur on websites to the individual users who perform those events. Each user, whether signed in or not, should have a distinct ID. With a server side implementation, you will need to create and store distinct IDs for both brand new and existing users.</p>\n<p dir=\"ltr\">A distinct ID is any string of characters that can uniquely identify a user of your product. You will send the distinct ID along with each event to tell Mixpanel which events were performed by which users. Since we’re doing everything server side you will need to create this distinct ID yourself.</p>\n<p dir=\"ltr\"><strong>But what do you actually do with your distinct ID?</strong> When do you create a new one? What about existing users? <strong>Here’s how to create and assign distinct IDs for different users that come to your site.</strong></p>\n<p dir=\"ltr\">The distinct ID for users can be stored in 2 places: in our database, or in a cookie on the user’s computer. We should always try to use the database version first, which requires that a user is registered and logged in.</p>\n<p dir=\"ltr\">When a user visits our website, we first need to check if they’re logged in. If they are, that means they are registered and can’t be a new user; if they aren’t, check if the user already has a cookie from our website. A user could already be registered but not logged in, and if that’s the case, they should already have a cookie from us.</p>\n<p dir=\"ltr\">If we determine that a user is brand new (not logged in and doesn’t have a cookie), we need to create a distinct ID for them.They aren’t registered yet, so we shouldn’t store their distinct ID in our database. That’s because we don’t have a good way to associate this user with a database record. Instead, we’ll create and store their distinct ID in a cookie on their computer. When they register, we’ll store their distinct ID in our database.</p>\n\n<h1 dir=\"ltr\">People vs. Events</h1>\n<p dir=\"ltr\">Mixpanel breaks down analytics into two parts: people and events. Events are actions that happen on a website, such as a registration, purchase, or a click.  People are the customers that perform these events. In the screenshots of Mixpanel below, everything under “engagement” has to do with events, and everything under “people” is – obviously – people.</p>\n<p dir=\"ltr\"><a href=\"/backup/people-2013-12-04-13-11-46.png\"><img class=\"alignleft size-full wp-image-1116730781\" alt=\"people\" src=\"/backup/people-2013-12-04-13-11-46.png\" width=\"157\" height=\"185\" /></a> <a href=\"/backup/events-2013-12-04-13-11-46.png\"><img class=\"alignleft size-large wp-image-1116730783\" alt=\"events\" src=\"/backup/events-2013-12-04-13-11-46.png\" width=\"156\" height=\"209\" /></a></p>\n\n<h1 dir=\"ltr\">Super Properties</h1>\n<p dir=\"ltr\">Super properties are extremely powerful. Using them, you can set up persistent properties that are sent with every event to Mixpanel. Normally, properties are only sent once per event, but with super properties, we can set a property that gets sent with every future event a user takes. We use this feature to conduct split tests. When running a split test, it’s important to pay attention to two things: the<strong> outcome of the page the experiment is testing</strong> (of course) and <strong>how the different variants in the split test affect their actions going forward</strong>.</p>\n<p dir=\"ltr\">Super properties are one of the features that come built in the Javascript library. However, we need to build this feature ourselves when running a server-side implementation. To accomplish this, we need a function that stores any number of properties to a cookie for the user. Then we need to wrap the mixpanel.track() function with functionality that reads every super property from the cookie and sends them with the event. Lastly, set each super property to the user’s “people” property since we also might want to segment our users based on their super properties.</p>\n\n<h1 dir=\"ltr\">Conclusion</h1>\nMixpanel is a great tool, but it can be a little overwhelming to set up. Be sure to think through how you want to model your product using Mixpanel before you start coding. Even after implementing Mixpanel on 10+ products, I often require revisions after the first implementation. As with everything, analytics is an ongoing process. Understanding why things happen in your product is critical for every startup, so the time required to get analytics up and running is well worth it.\n<h1 dir=\"ltr\"></h1>\n<h1 dir=\"ltr\"><em>What's Next?</em></h1>\n<p dir=\"ltr\">If you enjoyed this post, first check out these additional resources for how you can up your game from the 500 Distribution team:</p>\n\n<ul>\n\t<li><a title=\"5 Distribution Experiments You Can Do For $10 Or Less\" href=\"http://500.co/2014/03/13/5-distro-experiments-you-can-do-on-10-or-less/\" target=\"_blank\">5 Distribution Experiments You Can Do For $10 Or Less</a></li>\n\t<li><a title=\"How We Doubled Our Conversion Rate – Bombfell Co-Founder Bernie Yoo\" href=\"http://500.co/2014/03/24/how-we-doubled-our-conversion-rate-bombfell/\" target=\"_blank\">How We Doubled Our Conversion Rate - Bombfell Co-Founder Bernie Yoo</a></li>\n\t<li><a title=\"How to Suck Less at E-mail Marketing\" href=\"http://500.co/2013/08/13/how-to-suck-less-at-e-mail-marketing/\">How to Suck Less at Email Marketing</a></li>\n\t<li><a title=\"The Power of Trigger Emails\" href=\"http://500.co/2013/10/25/the-power-of-trigger-emails/\">The Power of Trigger Emails</a></li>\n</ul>\n<p dir=\"ltr\">Then, sign up to get a daily bite-sized distro hack (and one awesome GIF) delivered to your inbox:</p>\n<strong>&gt;&gt; <a title=\"Distrosnack 500 Startups Distribution Email Newsletter\" href=\"http://eepurl.com/BfYXn\">Subscribe to Distrosnack here</a> &lt;&lt;</strong>",
    "type": "post",
    "path": "/2013/12/04/implementing-mixpanel-what-you-need-to-know/",
    "backgroundImage": "/backup/featuredimage-960x540-2013-12-04-13-11-46.png"
}