{
    "title": "Interview: Fadi Ghandour on Middle-Eastern Startups and Bootstrapping",
    "slug": "interview-fadi-ghandour-on-middle-eastern-startups-bootstrapping-and-more",
    "date": "2013-10-14T19:10:39.000Z",
    "url": "http://500.co/?p=1116729961",
    "uri": "http://500.co/2013/10/14/interview-fadi-ghandour-on-middle-eastern-startups-bootstrapping-and-more/",
    "postId": "1116729961",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/10/Fadi-Blog-Post-pic-1024x681.jpg"
    ],
    "creator": "",
    "categories": [
        "aramex",
        "fadi-ghandour",
        "interviews",
        "investing",
        "middle-east",
        "middle-eastern",
        "startups",
        "vc"
    ],
    "content": "<p dir=\"ltr\">The Founder of Aramex and one of the most active early-stage investors in the Middle East, Fadi Ghandour, has been hugely instrumental in developing the region’s entrepreneurial ecosystem. His experiences, opinions on Middle East startups, and thoughts for the future are shared in this interview. We’re thrilled to include Fadi as a<a href=\"http://geeksonaplane.com/\"> Geeks on a Plane</a> (#GOAP) Ambassador for our Middle East trip taking place this Nov 4th - 17th, making stops in Istanbul, Amman, Dubai, &amp; Abu Dhabi.</p>\n<p dir=\"ltr\">For more information on our Geeks on a Plane trip or to join, email sheila@500.co.</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"http://500.co/wp-content/uploads/2013/10/Fadi-Blog-Post-pic.jpg\"><img class=\"wp-image-1116729965 aligncenter\" alt=\"Fadi Blog Post pic\" src=\"/backup/Fadi-Blog-Post-pic-1024x681-2013-10-14-13-14-10.jpg\" width=\"502\" height=\"334\" /></a></p>\n<p dir=\"ltr\"><strong>You've described yourself as an 'accidental entrepreneur' - can you share with us how you became an entrepreneur of the first ever Arab-based company to be listed on Nasdaq?</strong></p>\n<p dir=\"ltr\">Accidental in the sense that I did not plan for it and never thought that I was going to be one. But like all entrepreneurs, you get an idea or share one with a friend, and the minute you decide that you want to act on that idea or do something about it, boom, you are an adventurer, an explorer, an entrepreneur. So my friend Bill Kingson and I talked about the idea of starting a “courier company in the Middle East” and we simply decided to build it. Not knowing how difficult and how rough, and what it was going to take to make it happen. We simply said let’s give it a shot.</p>\n<p dir=\"ltr\"><strong>What was the biggest challenge for Aramex in the early days? How did you overcome it?</strong></p>\n<p dir=\"ltr\">We were able to raise money from family and friends plus we got two other funders, (who stayed on for no more than a year or a bit more, then decided this was not going to work). There were no VCs then and banks were not interested in giving you loans unless you had 100% collateral (which we did manage to do with a personal guarantee). So yes, like everyone else access to capital was an issue, just like it is today only 100 times more difficult.</p>\n<p dir=\"ltr\">But the biggest challenge was attracting talent to work in a startup, and maneuvering the Arab bureaucracy of establishing a company that was going to compete with the post office. It was hell, full of regulatory hurdles, monopolies, and laws that discouraged foreign investors and ownerships. Most days of the year I was on the road from city to city in the region finding local partners who would believe that I have a viable business for them to partner with me and get us a local set up. Political instability in our region is an issue we permanently face, starting with Beirut right after the Israeli invasion of 1982, we had to learn and operate in wars and uncertainty. But we never left. Overcoming all the challenges was simply a product of patience, perseverance and hard work, knocking on enough doors, until one opens. It involved small steps, tiny two people operations in several cities, and building a skeleton of a network.</p>\n<p dir=\"ltr\">Our biggest breakthrough came when we found our niche which we leveraged for the first ten years of our life as a business. Airborne express (later acquired by DHL) decided that they do not mind us being their partner in the middle east to deliver their parcels on their behalf (since they were not interested to be in the region with their own operation) from Airborne we eventually focused on selling to all the express courier companies who needed a network in the region and did not want to do it themselves (we called it Whole sale) we practically got every company in the business to give us a try, from New York to London, to Singapore, we became the courier company of courier companies delivering the middle east. The big prize came after years of trying, in 1987 FedEx finally believed in us and gave us all their business to the region (from Istanbul to Karachi and anything in between). We financed the business from these clients, but most importantly, we learned how the industry operates, we learned the importance of technology and systems (and later developing our own track and trace technology in house which is used today used by our network of international partners), customer care, operations standards, and more. They taught us because they wanted us to deliver quality for their clients and we sucked and absorbed every piece of knowledge we could get from them. We are today a product of the greatest school of them all, our clients.</p>\n<p dir=\"ltr\"><strong>What challenges do Middle Eastern startups face today? How are these challenges different from when you were a startup?</strong></p>\n<p dir=\"ltr\">Startups face similar problems that we faced back in ‘82 but some on a smaller or different scale. Access to capital even though a much smaller issue today but still is very much a challenge, opening Arab markets for businesses to scale is still a challenge, finding talent is an ever continuous challenge especially with our education systems are becoming more and more irrelevant, legislation and ease of doing business is smoother but still a challenge and not yet incentivized.</p>\n<p dir=\"ltr\"><strong>What do you think are the 3 key changes that need to take place in the region to create a more vibrant and viable entrepreneurial ecosystem?</strong></p>\n<p dir=\"ltr\">1. Open markets and ease of setting up businesses on a regional basis.</p>\n<p dir=\"ltr\">2. Education system needs to be fixed to focus on 21st century skills rather than prehistoric rote learning systems.</p>\n<p dir=\"ltr\">3. Access to capital. VC money, angel networks and very importantly banks availing debt to SMEs. Where only 8% of banks loan portfolios are for Small and Medium size companies; that says a lot about where our banking system is. If they are risk averse, then governments should step in provide loan guarantees to help startups and small businesses.</p>\n<p dir=\"ltr\"><strong>What are the main things you look for in a potential investment?</strong></p>\n<p dir=\"ltr\">1. The entrepreneur and the team. Key word: team</p>\n<p dir=\"ltr\">2. His/her ability to get clients</p>\n<p dir=\"ltr\">3. How does he/she intend to scale their business outside their “home market”</p>\n<p dir=\"ltr\"><strong>There has been unprecedented growth of use of social media and e-commerce in the Middle East in recent years. In your opinion, what are the largest trends you see taking hold in the region?</strong></p>\n<p dir=\"ltr\">1. Arabic content and localizing global businesses in the region. What I call copy, paste and then innovate.</p>\n<p dir=\"ltr\">2. E-commerce is happening big time; it is the biggest new happening business in the region. The GCC e-commerce industry is estimated to grow to US $15bn by 2015, up from $3.5bn in 2010.</p>\n<p dir=\"ltr\">3. Smart phone and mobile services/applications are going to be the biggest and fastest businesses in the region. Mobile phone penetration is already at over 100% here.</p>\n<p dir=\"ltr\"><strong>Knowing what you know now, what advice would you give to bootstrapped entrepreneurs trying to get their business off the ground?</strong></p>\nBootstrap is the key word here. Preserve your cash by spending where it matters to build the business. Build your team, focus on client acquisition to prove your model. Find a mentor and engage her/him all the time, and don’t fall for the hype certainly not yours. And be flexible so that you pivot and change and adapt to what you discover as you are building the business.",
    "type": "post",
    "path": "/2013/10/14/interview-fadi-ghandour-on-middle-eastern-startups-bootstrapping-and-more/",
    "backgroundImage": "/backup/jordan-960x540-2013-10-14-13-14-10.jpg"
}