{
    "title": "It's Not Michelin Star Cuisine: Why Venture Capital Can (and Should) Scale",
    "slug": "its-not-michelin-star-cuisine-why-venture-capital-can-and-should-scale",
    "date": "2013-04-12T00:11:08.000Z",
    "url": "http://500.co/?p=1116726803",
    "uri": "http://500.co/2013/04/11/its-not-michelin-star-cuisine-why-venture-capital-can-and-should-scale/",
    "postId": "1116726803",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "innout",
        "jiro",
        "michelin-star",
        "scale",
        "startups",
        "venture-capital",
        "venture-capital"
    ],
    "content": "<p dir=\"ltr\"><strong>TL;DR: Venture capital, like other kinds of businesses, can scale beyond traditional constraints like time and space. Investors that make \"too many deals\" can add lots of value outside of just a check.</strong></p>\n<p dir=\"ltr\">When I ask an entrepreneur why they are picking us or anybody else as their investors, I get a very similar answer:</p>\n<p dir=\"ltr\"><em>\"It's because of the value you bring to the table.\"</em></p>\n<p dir=\"ltr\">I agree with the broad idea that there's some value an investor can bring on top of their checkbook. However, I believe most people in the startup world are misguided about how that value is delivered.</p>\n<p dir=\"ltr\">At 500, people are always asking why we make so many investments – usually implying that we are participating in way too many deals. Then the usual follow up question is, “how can 500 add value to so many investments if your time is so limited?” That’s a fair question. How is it possible to add value to 450+ companies and counting, with only ~10 people on the investment team? This question is what keeps me up at night, yet at the same time, makes me most excited about our future.</p>\n<p dir=\"ltr\"><strong>Why don’t people ask this question in other industries?</strong></p>\n<p dir=\"ltr\">Someone would never ask a restaurant owner or retailer why they have so many customers. That’s because we're all familiar with the concept of repeatable processes. If a restaurant’s food is good, the waiters are nice, and the space is enjoyable, then we don’t complain that they’re serving too many other customers. (unless we're hipsters, but that's a different story)</p>\n<p dir=\"ltr\">It's widely known that there are multiple ways a company can scale without having the head chef welcome every single customer, show them the menu and prepare every dish directly. Moreover, we understand that chefs can transfer their knowledge and even create branches of a whole franchise.</p>\n<p dir=\"ltr\">Most of us have realized the underlying mechanics of scale, and we praise companies like Google, Amazon, eBay for being able to grow their services to provide value to as many people as possible. Who would argue that Apple creates less value because they have millions of customers? Or that startups’ products becomes less useful when more people use them?</p>\n<p dir=\"ltr\">This is why the question about 500 investing in so many startups fascinates me. Why do people assume a venture capital firm can’t do what so many businesses have -- scale? Why do people think investment firms should be run as boutique mom and pop shops? Why is it that most VCs (and other players) equate value to time spent in front of founders?</p>\n<p dir=\"ltr\"><strong>For decades, people in our industry have acted like they’re running a Michelin Star restaurant.</strong></p>\n<p dir=\"ltr\">Many VCs perpetuate the perverse idea that personal attention is key, but despite delusions of grandeur, (most) investors aren't 4-star chefs  <a href=\"http://en.wikipedia.org/wiki/Sukiyabashi_Jiro\">I love Jiro</a>, but restaurant owners – or in our case, VCs –  are being delusional if they believe that our entire industry should operate like Jiro.</p>\n<p dir=\"ltr\">Professional investors compete to back the most talented people pursuing some of the most ambitious businesses. While they certainly control where the money goes, they still need to convince entrepreneurs that their dollars are more valuable than a competitor's.</p>\n<p dir=\"ltr\"><strong>Venture capitalists invented terms like \"smart money,\" \"value add\" and \"partner time\" to prevent people like you and me from taking their money at face value. While it's true that facetime can be a nice thing to have, there are many other things a good investor brings to the table – especially in the age of the internet.</strong></p>\n<p dir=\"ltr\"><strong>What’s so great about a Venture Capital firm that can scale on a massive level?</strong></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Branding</strong></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\">An investor can lend a personal or business brand. Mark Cuban writing you a check for $10k is different from me writing you a check for $100k. This value has nothing to do with time. And the Maverick himself doesn’t have to spend lots of time with every single company in his portfolio to keep building a strong brand.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Family</strong></p>\n<p style=\"padding-left: 30px;\">When a firm does 200+ deals a year, they’re going to have a LOT of portfolio companies. And while these companies may not get face time with investors, they can reach out to them (and each other) over the Internet for advice, networking and even just to meet up for a beer. A large network of peers is what makes programs and funds like Y Combinator, TechStars, First Round Capital, and 500 such great communities for entrepreneurs.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\">The bigger your startup becomes, the more this matters. When you try to expand your business into other regions or new markets, you’ll be thankful to have friends in other parts of the world and other industries. As an investor, few things feel better than saying \"Hey, you should talk to Jane at Startup X; they are a portfolio company and the founders know a lot. Email her directly and put 500 in the subject line.”</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>The Network Effect</strong></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\">Each company adds their unique combined knowledge to the network, so our network gets smarter as we participate in more deals. 500 holds the combined lessons of hundreds of companies that have gone through thousands of ups and downs. And what some will discover, others will use as preemptive knowledge.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\">By standing on the shoulders of their peers, our startups are able to see farther than companies that are going it alone.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Functional support</strong></p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\">At scale, it’s easier to help companies with clear challenges. Some investment firms will offer access to marketing, tech, finance, public relations or even legal staff. These are all activities that almost every company needs, but especially when they're still small.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\">It’s definitely a challenge to hire a comprehensive full time staff for this. Firms like Andreessen Horowitz and Google Ventures have set the standard for this. We salute and admire what they’ve accomplished.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\">At 500, we’re all about constantly iterating and trying new things, making mistakes (and even big f*ck ups) in the process, then optimizing. Our companies don’t get a ton of facetime with the 500 staff, but they get one of the biggest, best networks in the startup world; It’s a slight trade-off, but we think it’s worth it. Especially when our companies have access to mentors, founders and partners on nearly every continent.</p>\n<p dir=\"ltr\">**Additional note to the entrepreneur: If you really want the venture capital equivalent of a Michelin 3-star experience, make sure you pick one of the maybe 10 people in the world who can provide it. *Wink* *wink*, we are not in the list.</p>",
    "type": "post",
    "path": "/2013/04/11/its-not-michelin-star-cuisine-why-venture-capital-can-and-should-scale/",
    "backgroundImage": "/backup/michelin-vs-innout-final-960x540-2013-04-11-13-19-11.png"
}