{
    "title": "JAI HO! 500 Helps Indian Startups March to Victory",
    "slug": "jai-ho-500-helps-indian-startups-march-to-victory",
    "date": "2013-02-16T03:46:51.000Z",
    "url": "http://500.co/?p=1116725611",
    "uri": "http://500.co/2013/02/15/jai-ho-500-helps-indian-startups-march-to-victory/",
    "postId": "1116725611",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "accelerator",
        "india-2",
        "teliportme",
        "tradebriefs",
        "who-is-500",
        "who-is-500-2"
    ],
    "content": "<strong>Every day this month, we’ll give you an inside look at 500 Startups. Today, we’re whisking you away to the country behind Bollywood, the Taj Mahal and Sanskrit: India. If you’re an Indian entrepreneur who wants to blow up your startup in our Spring 2013 Accelerator batch, <a href=\"https://angel.co/500startups\">apply here</a> before the March 1st deadline.</strong>\n\nI've seen dramatic changes in the Indian startup community over the last 6 years. Younger people are more willing to work at a startup (or found their own), rather than work for a big company. More accelerator programs are popping up, more investors are putting their money to work, and more entrepreneurs than ever have support from mentors. India is truly the country of MORE right now – even big Indian companies are realizing the importance of new ideas and innovation by <a href=\"http://www.livemint.com/Industry/tDr4iXm1d5dYNPisSY9sHP/Why-Indian-IT-firms-are-hiring-failed-entrepreneurs.html\">hiring \"failed entrepreneurs\"</a>.\n\nSo why is India's economy so conducive to a burgeoning tech scene? Over the last decade, GDP has gone from around 400 billion to over $1.8 trillion. And everywhere you look, it shows: new roads are being built, internet speeds are increasing, lower priced smartphones and tablets are becoming more widely available, and higher priced iPads and other devices are seen regularly. Best of all, many of the poor are sending their children to schools instead of having them work.\n\nIt’s pretty clear why we think investing in and supporting Indian startups is a smart bet. In our last batch of startups, 4 companies came from India, and our fourth batch included the Indian company <a href=\"http://www.teliportme.com/\">TeliportMe</a>, a social network for immersive visual experiences. Here’s what some of them have to say about their time at 500:\n\n<em>\"My stint at 500 was very enriching. The kind of friends I’ve made is something I’m proud of and will cherish throughout my life. Being surrounded by really bright and hardworking people throughout the period is quite an eye-opener. The number and caliber of investors that come into 500 startups demo days is overwhelming. I believe that the whole feeling about being a part of the 500 Startups community is what helps startups immensely down the road.\"</em>\n\n<strong>Vineet Devaiah, co-founder, <a href=\"https://angel.co/teliportme\">TeliportMe</a></strong>\n\n<em>\"When I joined the accelerator program in October, I was hoping it would make up for the year that I missed by dropping out of business school to start my company. Oh, it did that and much more! When you are using your skills in an actual, real-life business, the experience is completely amazing. TradeBriefs went from being an unsexy email newsletter business that our subscribers loved but most had not heard of, to one of the most promising startups in India. We now have the credibility to strive to be a global player. The group in the accelerator batch is diverse and a great bunch, and every company here has the potential to become a great company. We have also seen some good pivots and excellent improvements in strategies and tactics, thanks to feedback from the extensive network of mentors. You get value out of the program if you participate and ask questions (and there are no wrong questions), incorporate the feedback and keep iterating. The 500 brand is getting stronger every year and we are all family.\"</em>\n\n<strong>Sreekumar (Sree) Vijaykumar, Managing Director, <a href=\"https://angel.co/tradebriefs\">TradeBriefs</a> </strong>\n\nWe’re so passionate about the region that our <a href=\"http://geeksonaplane.com/\" target=\"_blank\">Geeks on a Plane tour</a> made its way to India just over a year ago and will head back later this month. Check out our mini documentary about the enlightening trip below:\n\n<object width=\"560\" height=\"315\" classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"http://www.youtube.com/v/II1zouAdaPk?version=3&amp;hl=en_US&amp;rel=0\" /><param name=\"allowfullscreen\" value=\"true\" /><embed width=\"560\" height=\"315\" type=\"application/x-shockwave-flash\" src=\"http://www.youtube.com/v/II1zouAdaPk?version=3&amp;hl=en_US&amp;rel=0\" allowFullScreen=\"true\" allowscriptaccess=\"always\" allowfullscreen=\"true\" /></object>\n\nStill wondering why we love India so much? As the need for technology increases along with the broader economy, more and more of the brightest Indians are opting NOT to leave India, but to stay and build exciting new businesses in one of the oldest civilizations on the planet. To us, this represents a new, exciting opportunity for growth where <strong>in a really bad year, GDP grows at 5%.</strong>\n\nLike any country, India isn't without challenges. But problems become opportunities for the brightest entrepreneurs, and 500 is excited to discover and support them in the future. Think you’re one of ‘em? Apply for our Spring Accelerator batch by <a href=\"https://angel.co/500startups\">going to our AngelList page.</a>\n\n<em><strong>Post contributed by<a href=\"http://www.twitter.com/pjain\" target=\"_blank\"> Pankaj Jain</a>, Venture Parter at 500 Startups.</strong> He regularly kicks ass &amp; takes names of Desi founders to help build a vibrant startup ecosystem in India. When he isn't busting the chops of noob startups or predatory angel investors, or firing up Startup Weekend in Bangalore or Mumbai, you will find him devouring unsuspecting vegetables at Delhi’s best vegetarian sushi joint.</em>",
    "type": "post",
    "path": "/2013/02/15/jai-ho-500-helps-indian-startups-march-to-victory/",
    "backgroundImage": "/backup/858031_580003405360584_378292406_o-960x540-2013-02-15-13-21-46.jpg"
}