{
    "title": "Launch or Die at a StartupWeekend Near You",
    "slug": "launch-or-die-at-a-startupweekend-near-you",
    "date": "2012-04-27T22:44:15.000Z",
    "url": "http://500.co/?p=1116719923",
    "uri": "http://500.co/2012/04/27/launch-or-die-at-a-startupweekend-near-you/",
    "postId": "1116719923",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/04/500_darius.jpg"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<a href=\"http://500.co/2012/04/27/launch-or-die-at-a-startupweekend-near-you/500_darius/\" rel=\"attachment wp-att-1116719924\"><img class=\"alignleft  wp-image-1116719924\" title=\"500_darius\" src=\"/backup/500_darius-2012-04-27-12-17-44.jpg\" alt=\"\" width=\"130\" height=\"130\" /></a>\n\n<i>Guest posted by Darius “Bubs” Monsef, a 500S mentor &amp; founder living on the Big Island of Hawaii eating malasadas and smelling the plumerias. Follow him <a href=\"http://twitter.com/#!/bubs\">@bubs</a> or at his blog (<a href=\"http://www.hellobubs.com\">hellobubs.com</a>)</i>\n\nI was signed up to be a judge &amp; mentor at <a href=\"http://honolulu.startupweekend.org/\">StartupWeekend Honolulu</a> this weekend, but the more I thought about how I could best help local founders, I decided that maybe the best thing I could do would be to back my talk up with some walk.  So, I’m going to go with an idea, and leave with a launched product… hopefully leading by example and documenting everything along the way to give more inexperienced founders a solid road map for launching their ideas.\n\nAnd with that idea in mind, I thought I’d pre-event share my thoughts and strategy going into the weekend…\n\n<strong>My Founder Story</strong>\n\nI’m a fan of StartupWeekends.  Having lived in Portland at a time where there weren’t many signs of life of actual startup companies, it brought in an opportunity to get networked with actual builders &amp; founders.  Amongst a sea of events for wantrepreneurs, it was a chance to see people actually build and launch things.\n\nThe first weekend I participated in was several years ago and since then I’ve had the opportunity to learn a lot about startups by building my own, having founder friends and being an alumni of programs like Y Combinator &amp; 500Startups.  And now that I’ve earned some scars I advise a few startups and mentor with 500Startups, DesignerFund &amp; PIEPDX.\n\nAlong my own founder journey, I’ve built <a href=\"http://colourlovers.com/\">COLOURlovers</a> into a top design community with +1.6 Million registered users, raised venture capital from some of the best investors in the game, I’ve had my products acquired and I’ve acquired other companies.\n\nMy two previous SW experiences I just hung out and supported teams and didn’t try and lead with my ideas.  In a SW-esque challenge to myself when I worked at Microsoft though, I partnered up with one of my COLOURlovers co-founders, Chris and designed, built &amp; launched an idea in two weeks while working full time at Microsoft. With FriendsCall.Me, we had a similar challenge to get an MVP built and shipped as quick as possible and the resulting product had great reception and we <a href=\"http://techcrunch.com/2010/01/21/social-media-identity-startup-knowem-acquires-friendscall-me/\">eventually sold it</a> to another company in the space.\n\n<strong>StartupWeekend: First, Foremost &amp; Everything</strong>\n\nStartupWeekend is a build event.  If you can’t demo a working product by the end, you failed.  I’ve seen enough examples of this to know it’s true, but if you don’t have a working product with beta users poking at it… the weekend will end and everybody will drift back to their normal lives.  You need a product to keep the group together.\n\nStartupWeekend is not a business plan event.  The huge opportunities in founding a web startup is the speed at which you can build and the low cost to do so.  It’s really really hard to start a more traditional physical goods company in a little more than 2 days with 0 startup capital.\n\nSo, if you’re a marketing/business/strategy type, then all hope isn’t lost for you.  There is still a place for you at the event, but if you can’t get any developers to actually help you build your own idea… take the opportunity to join another team where you can learn more about the development process and find ways to add value to the idea.\n\n<strong>Without Makers. Nothing is Made.</strong>\n\nThe most important people at SW events are the developers and then the designers.  Without somebody to build the product there isn’t much reason to be there. In the absence of developers, an awesome designer in a weekend could design a polished flow for the app that could later be built out… but again, the point of SW is to launch something.\n\nIt’s not a bad idea to bring a couple developer/designers that you know to a SW event as a self-contained way to work on your idea without any of the mucky details that might prevent them from signing on for an indefinite period of time working on it.  Give it a weekend and if the product justifies it… keep working on it.\n\n<strong>Some things to watch out for during the weekend…</strong>\n\n<strong>WARNING: Ship or Die.\n</strong>As mentioned before.  Without a working product/service by the end of the weekend your chances of survival post weekend are very slim.  Your whole process and strategy should be on organizing a team that can build something, getting it outlined to a minimum viable product that is engaging and shippable… and then busting ass to get it out.\n\n<strong>WARNING: No Plans.</strong>\nDon’t get me wrong, having a strategy and plan for how you’ll spend your time during the weekend is a great idea… but don’t waste any time planning for after the weekend.  Business plans are a huge waste of time for idea stage projects… You can build, ship, test, iterate &amp; capture data faster than you can write a thorough bullshitted business plan. So just build.\n\n<strong>WARNING: Avoid All Rabbit Holes.\n</strong>No decision you make needs to survive 54 hours.  So does it really matter if you use a .ly domain or a proper .com?  No.  If you launch and have ridiculous traction that means going out to try and spend the $ to acquire the .com version… well, that’s not really a bad problem to have.  More likely it will be an ok name and if you have enough progress to keep working away, you can always deal with the name later. (ie, TheFacebook.com, GetDropbox.com, etc.)\n\n<strong>WARNING: MVP OR GTFO</strong>\nYou can’t build an entire social network in 54 hours… what you could build is the ability to browse profiles organized from another data-set. What you need is the the simplest most engaging aspect of your overall idea that can capture user interest.  Boil down your idea and features until you get to the MVP… then build.\n\n<strong>WARNING: No LaunchRock’ing</strong>\nI love the <a href=\"http://www.launchrock.com/\">LaunchRock</a> product and team, but you don’t need a coming soon site.  You need a working now product.  So don’t worry about your LaunchRock page during the weekend, throw it up later when you actually have a working beta you’re iterating on and want to capture user interest as you prepare for wide-scale launch.\n\n<strong>My 54hr Startup Weekend Strategy…</strong>\n\n<strong>Team.</strong> The team is paramount.  I’m lucky to have two developers from my company that I’m bringing to the event to work with me. (granted they could get poached by another idea) The rest of the team I’ll do my best to enlist during the initial idea pitch time… Designer &amp; iOS Dev.  Once the team is solidified and we’re ready to go, we’ll do a quick intro for everyone, share skills, drink preferences &amp; expected roles and contributions.\n\n<strong>Concepting. </strong>Once teams are solidified, there are only a few more hours of the night… and that’s the perfect time to do your concepting…\nWhat’s the big idea?\nWho is the customer?\nWhat is their problem?\nHow can you solve it?\nWhat’s the simplest version of the idea?\nWhat’s the most engaging feature of that simple idea?\nWhat’s the company called?\nWhat technology do you need to leverage?\n\nAnd now you have enough information for the different team members to head home with a good understanding of what to do next.  Devs know what services to get signed up for / quickly research.  Designers know what branding concepts to start kicking around. Ops folks know what needs to be researched, gathered and organized for the makers.\n\n<strong>MVP.</strong> And with the first full day starting you can start designing &amp; building your MVP.  Whiteboard the UX flow, ie. Sign-up/in &gt; Create Profile &gt; Upload Content &gt; Rate/Comment Content &gt; Share Content.  Once that simple outline is complete the designers can start putting pen to pixels and the devs can start writing the code to make it work.\n\n<strong>MAKE.</strong> All that matters now is to get something built and ready to demo / share with friends &amp; family users.  If you’re a super fast team and get a solid MVP built, launched and capturing data… figure out with that next layer of additional functionality is and get it built.\n\n<strong>CHECKPOINTS.</strong> Don’t wait until the last hour to realize you’re 50% of the way done.  Create short internal checkpoints to evaluate progress so if you’re way over on time with a specific feature you can early on decide to cut it or chose a 70% solution of that feature that gets you most of the way there.  This is what mountain climbers do so if they slip, they only fall 10 feet to where they last tied in, instead of falling to their deaths.\n\n<strong>LAUNCH.</strong> You shouldn’t need to worry about building a pitch deck for your presentation to the judges, hopefully a killer working product can be quickly demo’d.  But the real winner isn’t the one who takes home the judge’s vote, but who takes home a working product that has the chance to become a great company.\n\n++++\n\nAnd with all that being said, I hope for your StartupWeekend idea you’ll consider <a href=\"http://hellobubs.com/post/21354507373/more-than-money-matter\">making something that matters</a>.",
    "type": "post",
    "path": "/2012/04/27/launch-or-die-at-a-startupweekend-near-you/"
}