{
    "title": "Leah Buley on Design, Research, & Business Strategy",
    "slug": "leah-buley-on-design-research-business-strategy",
    "date": "2013-12-04T21:45:46.000Z",
    "url": "http://500.co/?p=1116730795",
    "uri": "http://500.co/2013/12/04/leah-buley-on-design-research-business-strategy/",
    "postId": "1116730795",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "design",
        "design",
        "finance-2",
        "interview",
        "intuit",
        "ui",
        "ux"
    ],
    "content": "We interviewed design strategist Leah Buley, who works on the future of small business and personal finance at Intuit. Her work spans a variety of industries, including media, mobile, financial services, education, and non-profit. Check out what Leah has to say about a UX team of one, user research, building design into your business strategy, and more:\n\n<strong>\nHaving worked as a lead UX designer at Barclays, Adaptive Path, and now with Intuit, how has your approach to UX changed over the years?</strong>\n\nI feel like I've been on a fifteen year trek up that long river that is the product development process. I actually first started out as a developer, way down the river, near where it empties out to the sea. Then when I transitioned into UX I moved a little further upstream and started focusing on user interface design. In particular, I became very gung ho on heuristics and design patterns and usability testing. I was just fascinated by the question of what makes an interface good, and how can it be made better. But over time, I learned (sometimes quite painfully) that without proper user research and strategy, the subtle nuances of interface design are irrelevant. I became more interested in how you know for sure that you're designing in support of the right goals, which naturally required me to paddle a little further upstream.\n\nThese days, my interests are taking me almost off the product roadmap completely. I recently transitioned into a new role at Intuit focusing on growth and development for Intuit's sizable user experience community. So now I'm thinking a lot about people's skills and interpersonal dynamics and how they impact a big organization's ability to consistently make better products. Basically, how they help or hinder the skiffs that you send down river.\n\n<strong>\nMost startups have a UX team of one and it can be struggle with how much needs to be \"taught\" to the rest of their team. What are the most important principles a UXer should teach his or her team in order to be successful?</strong>\n\nA few of my favorite principles, in no particular order:\n<ul>\n\t<li>You are (probably) not your user. Imaging how you would use it is not enough.</li>\n\t<li>Spending lots of time with real users leads to better products. (For more on this, see: http://www.uie.com/articles/user_exposure_hours/)</li>\n\t<li>Great experiences are focused. To make great products, simplify.</li>\n\t<li>User experience isn't just UI design. The products we love best are coherent and harmonious and reliably awesome across every customer touchpoint.</li>\n\t<li>Everyone on the team owns the user experience. It's not just the UX person's job.</li>\n</ul>\n<strong>What are the best strategies for inviting ones colleagues, and skeptics into the user-centered design process? Why is it even important to do this?</strong>\n\nWhat a funny question…I guess it's a matter of faith for me that products that are designed based on user needs naturally result in better experiences for people. And that organizations that are driven by user centered values are more likely to make well designed products. So, how to invite people into that process? This may sound weird, but I think the first and best thing you can do is to make UX work visible and tangible by making it physical. Put up pictures of customers on the wall. Put up product sketches on the wall. Invite team members to pick up a marker and sketch on top of those things. This makes it their process -- and through some kinetic magic the team starts engaging with design from a more empathetic, energetic, constructive, \"let's roll up our sleeves and work on this together\" kind of place. I don't know how it works, but I've seen it in action enough that I know that it does.\n\n<strong>\nWhen should a company invest in user research? What are some common mistakes that companies make with approaching research?</strong>\n\nAs the inimitable Nate Bolt says, \"Designing without research is like getting into a taxi and just saying, 'Drive.'\" The short answer is that any team that designs a product should also do user research—both to validate that the product works as intended, and also to provide inspiration and exploratory ideas to inform what the product could be in the future. Design should be the yummy middle of a research sandwich. Getting people to invest in usability-style validation research is usually an easy sell. The exploratory research can be harder to get people to invest in, precisely because you don't know what you'll learn and therefore can't predict the value of it. But exploratory design research is so important. It fuels empathy. It provides inspiration. It gives you stories and anecdotes that can help you remind your team again and again what users are really like. And it feeds into handy tools like personas and design principles, both of which can be used almost like a laser level throughout the design process to continually reevaluate whether the foundation you're designing lines up with your vision and customers' needs.\n\nBut this notion of \"investing\" is actually part of the problem. When people talk about user research as a discrete chunk of work that you do or don't allot time and budget for, they often decide not to do it. User research shouldn't be a project. It should be a mindset and a set of practices that are shared by everyone on the team—and that you do in lightweight ways all the time.\n\n<strong>\nOther than Intuit, which company has your favorite UX?</strong>\n\nAh, my latest guilty pleasure is Houzz. I guess their business model is to put homeowners in touch with residential contractors, but they have a clever strategy that hooks you in by featuring lots and lots and lots of interior design photography and articles. Basically, it's shelter porn. Their web and mobile interaction design probably isn't groundbreaking (though it's a nice, clean design). But their content strategy is so well executed. The high quality photography, the feature length articles with a chatty, \"here are some tips\" writing style, the information architecture, the approach to community generated content. With the rise of responsive design, content strategy is becoming one of the most important disciplines for UX (if it wasn't already), and Houzz's content strategy is great.\n\n<strong>\nWhat advice do you have for bootstrapped startups on integrating UX practices?</strong>\n\nDesign is more powerful when coupled with user research. That may sound like 'no duh' to you, clever reader, but I'm always amazed how many people I meet who claim to be user centered designers but never actually spend time with customers. If you do nothing else, start there.",
    "type": "post",
    "path": "/2013/12/04/leah-buley-on-design-research-business-strategy/",
    "backgroundImage": "/backup/intuitlogo-788x540-2013-12-04-13-15-45.png"
}