{
    "title": "Livin' La Vida Startup - in Beantown",
    "slug": "livin-la-vida-startup-in-beantown",
    "date": "2010-11-04T00:10:41.000Z",
    "url": "http://blog.500startups.com/?p=1116714432",
    "uri": "http://500.co/2010/11/03/livin-la-vida-startup-in-beantown/",
    "postId": "1116714432",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/11/optimusprime-150x150.jpg",
        "http://500.co/wp-content/uploads/2010/11/royrodenstein-150x150.jpg",
        "http://500.co/wp-content/uploads/2010/11/dart-dinner-cropped-300x175.jpg",
        "http://500.co/wp-content/uploads/2010/11/p1030502-300x225.jpg",
        "http://500.co/wp-content/uploads/2010/11/img_5009_2-300x261.jpg"
    ],
    "creator": "",
    "categories": [
        "beantown",
        "boston",
        "going",
        "guest-posts",
        "harvard",
        "mentors",
        "mentors",
        "mit",
        "mit-media-lab",
        "optimus-prime",
        "roy-rodenstein",
        "startup-events",
        "startups",
        "tips"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2010/11/optimusprime.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714435\" title=\"optimusprime\" src=\"/backup/optimusprime-150x150-2010-11-03-10-18-10.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a><a href=\"http://500.co/wp-content/uploads/2010/11/royrodenstein.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714434\" title=\"royrodenstein\" src=\"/backup/royrodenstein-150x150-2010-11-03-10-18-10.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet Optimus Prime, aka 500 SuperMentor <strong>Roy Rodenstein</strong>. Roy co-founded Going.com, a pioneering startup in local events and ticketing acquired by AOL in 2009, and led product and online marketing. Before that he led product marketing at a search startup acquired by IBM, and was a researcher at the MIT Media Lab. Roy (<a href=\"http://twitter.com/royrod\" target=\"_blank\">@royrod</a>) was a founding member of HackerAngels and blogs at <a href=\"http://how2startup.com\" target=\"_blank\">how2startup.com</a>. </em><em>In this post, Roy gives you a taste of what the startup environment and startup life is like in Beantown (Boston).</em>\n\nDriving up 101, looking at the mountains off in the distance. Ads for engineer jobs in the billboards on the highway. A pool in every apartment complex. Hearing \"try google.stanford.edu\" for the first time. Biking from Mountain View to the PARC campus on Coyote Hill overlooking Palo Alto, and taking Caltrain back in the evenings.\n\nMy memories of life in the Valley are many - they were wonderful times. Fast forward two graduate degrees, and after doing early research in what became known as social networks at the MIT, I settled into the startup life in <strong>Boston</strong>. There are some analogues- instead of the pilgrimage to Sand Hill Rd. in search of mucho VC $$, there's a well-worn path to Winter St. in Waltham. And working at the cooler startups here is not that different from the west coast. At my first startup job out of grad school, the company was backed by Sequoia's Mike Moritz, we got dinner brought into the office every night, and part of the hiring process was candidates playing (aka getting smacked down) by the CEO at ping-pong. There are many things that make the startup scene in Boston special though…\n\n<strong>Hanging Out</strong>\n\n<a href=\"http://500.co/wp-content/uploads/2010/11/dart-dinner-cropped.jpg\"><img class=\"alignnone size-medium wp-image-1116714437\" title=\"Dart Dinner Cropped\" src=\"/backup/dart-dinner-cropped-300x175-2010-11-03-10-18-10.jpg\" alt=\"\" width=\"300\" height=\"175\" /></a><a href=\"http://500.co/wp-content/uploads/2010/11/dart-dinner-cropped.jpg\">\n</a><em> (I'm 2nd from the right) With entrepreneurs at Dart Family Dinner, one of many events at NERD</em>\n\n<em></em>If you spend a bit of time here going to startup events, chances are you'll soon find yourself at <a href=\"http://microsoftcambridge.com/Events/tabid/57/Default.aspx\" target=\"_blank\">NERD</a>. That is the cleverly named Microsoft New England R&amp;D building which has played host to everything from Startup Weekend to Techstars Investor Day to the Boston Angel Bootcamp to Open Angel Forum. For a more casual spot head to <a href=\"http://www.andalacafe.com/home.php\" target=\"_blank\">Andala Cafe</a> in Central Square, with some of the coolest Middle Eastern inspired cushy seating around which seems to attract entrepreneurs. The Au Bon Pain by MIT in Kendall is a common hangout spot for the Boston Globe's tech journalist Scott Kirsner, and is also the site where I first blurted out the idea that eventually became my startup, Going.com. (It all started in 2005 because it was too hard to find awesome things to do on a date, and four years later we were acquired by AOL.)\n\n<a href=\"http://web.mit.edu/\" target=\"_blank\">\"77 Mass Ave\"</a> is a meme known to all MIT students as the 'tute's main entrance, which leads to the Infinite Corridor. A decade after graduating, I still love walking through it and feeling the buzzing activity from current students. At the end of the Corridor is the <a href=\"http://media.mit.edu\" target=\"_blank\">Media Lab</a>, the most interdisciplinary school in the world with sculptors working next to physicists next to hardware hackers next to musicians next to ethnographers next to Marvin Minsky, father of AI (whose class I was lucky enough to take).\n\n<strong>The (Recruiting) Scene</strong>\n\nIf you like being a big fish in a small pond, Boston is a good place to be. If you're a cool startup, it's much easier to attract and retain great technical talent because there's just a lot less competition from other cool startups. Actually <em>finding</em> people is another matter…\n\n<a href=\"http://500.co/wp-content/uploads/2010/11/p1030502.jpg\"><img class=\"alignnone size-medium wp-image-1116714436\" title=\"P1030502\" src=\"/backup/p1030502-300x225-2010-11-03-10-18-10.jpg\" alt=\"\" width=\"300\" height=\"225\" /></a>\n<em>Day-after-Halloween 2009, testing the straw hat look, waiting for the T in Harvard Square</em>\n\nIn the valley you can't swing a cat without hitting 5 hackers. If you have an event and get a couple of interesting founders or speakers attending, presto, you get a bunch of hackers showing up. In Boston there are not many places or events with a high concentration of techies. <a href=\"http://startupweekend.org/\" target=\"_blank\">Startup Weekend</a> is definitely one of the best at tapping hackers and designers, and <a href=\"http://hfboston.com/\" target=\"_blank\">Hackers &amp; Founders</a> is ramping up. Geographically, Cambridge's Kendall Square (Akamai HQ and site of the <a href=\"http://www.cictr.com/\" target=\"_blank\">Cambridge Innovation Center</a> startup space, and of more biotech firms than you can shake a stick at), Central Square (home to Techstars, Zynga Boston, and the <a href=\"http://oneforty.com\" target=\"_blank\">oneforty</a> crew's rocking parties), Harvard Square (birthplace of YCombinator, and of … that site that that Social Network movie was about), and Davis Square (where the reddit guys used to throw rooftop parties) are some of the highlights.\n\nEven if you find a great hacker or designer, they'll often be highly suspicious and reticent to make the jump. Many of the best designers in town have been locked up at agencies or in-house at large companies for years, wary of setting out on their own. But I have managed to recruit an SEM guru from the Google AdWords team and pull other rabbits out of hats. While in the Valley you might open with \"We're like if Animoto got busy with Google Wave in the back of a Tesla, and we're going to totally make the iPad look like MySpace,\" in Boston you're best off pitching stability along with a more sober level of excitement. \"We have plenty of money in the bank, an experienced team with a vision to own the X market, and we're doing the coolest AJAX hackery around- but we have a real revenue model and deals to prove it\" works well. If all else fails, take the candidate AND their significant other to a nice Italian dinner in the North End (doh, just gave one of my best tricks away). Yes, it can really test your recruiting chops to get top talent interested. The good news is once they join you you don't need to worry (much) about Google or Facebook or UberCab poaching them.\n\n<strong>Hometown Inspirations</strong>\n\nWhile the latest rage with consumers, Instagram or whatever it is this week, may rarely start in Boston, there are so many sexy <em>and </em>solid businesses to admire here. Kayak, the minimalist travel search engine. Skyhook Wireless, the original geolocation vendor to Apple for the iPhone, and Quattro Wireless, Apple's acquisition as its mobile advertising platform. ITA, which probably has the largest weapons cache of math PhD algorithm hackers around thanks to its brain teaser ads on the T (the nickname for Boston's subway- the Red Line will get you to most startups). HubSpot, the epicenter of the Inbound Marketing megatrend, and growing like wildfire. Zipcar, Compete.com, TripAdvisor, BrightCove, ScanScout, RueLaLa, iRobot, IdeaPaint, SCVNGR, Backupify, the list is longer than most people -even here!- realize.\n\nInspirational entrepreneurs, hackers and investors abound too: John Resig, creator of jQuery; Tom Leighton of Akamai; Robin Chase of Zipcar; Jeremy Allaire of Allaire and now Brightcove; David Cancel of Compete and now Performable; Dharmesh Shah of HubSpot, the most prolific, modest hacker you can meet; Paul English of Kayak, whose talks on full-court-press recruiting are now legen-wait for it-dary; Dave Frankel and Eric Paley of Founder Collective, the #1 most active first-round microVC according to the WSJ's new stats.\n\nOf course, several of the <a href=\"http://500startups.com/companies.php\" target=\"_blank\">500 Startups</a> have roots in Boston too. If you need to transfer money abroad, Iker Marcaide of innovator <a href=\"http://www.peertransfer.com\" target=\"_blank\">peerTransfer</a> is your man. And I can personally attest that Alex Moore's email sanity lifesaver <a href=\"http://www.baydin.com\" target=\"_blank\">Baydin</a> is so useful that when I have to use a computer that doesn't have it installed I want to throw it out the window. Of course I would never use its amazing Send Later feature when emailing <em>you</em> :)\n\n<strong>So What Does It All Mean?</strong>\n\nStartup life in Boston is different than in California. Maybe it's a little like the weather. In LA people complain when the temperature drops below 80. In Boston, as long as it's sunny, 47 degrees is considered gorgeous (yes, people say exactly that). Likewise, the Boston startup community is very tight-knit. You can't just walk into any bar here and find your startup sisters and brothers, but once you do they'll do anything to support your fledgling idea. I guess you just come to appreciate things more when you have to work for them a bit.\n\n<a href=\"http://500.co/wp-content/uploads/2010/11/img_5009_2.jpg\"><img class=\"alignnone size-medium wp-image-1116714438\" title=\"IMG_5009_2\" src=\"/backup/img_5009_2-300x261-2010-11-03-10-18-10.jpg\" alt=\"\" width=\"300\" height=\"261\" /></a>\n\n<em>A picture of the first Going office, aka my co-founder's apartment. That red couch was my \"desk\" for a year.</em>",
    "type": "post",
    "path": "/2010/11/03/livin-la-vida-startup-in-beantown/"
}