{
    "title": "Making Your Startup A Platform",
    "slug": "making-your-startup-a-platform",
    "date": "2010-10-22T17:52:11.000Z",
    "url": "http://blog.500startups.com/?p=1116714341",
    "uri": "http://500.co/2010/10/22/making-your-startup-a-platform/",
    "postId": "1116714341",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/10/greenlantern-150x150.jpg",
        "http://500.co/wp-content/uploads/2010/10/ben-lewis-136x150.gif"
    ],
    "creator": "",
    "categories": [
        "android",
        "ben-lewis",
        "ex-googler",
        "green-lantern",
        "guest-posts",
        "iphone",
        "mentors",
        "mentors",
        "mobile",
        "monetization",
        "platform",
        "startups",
        "tapdefense",
        "tapjoy",
        "tips",
        "virtual-currency",
        "virtual-goods"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2010/10/greenlantern.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714259\" title=\"greenlantern\" src=\"/backup/greenlantern-150x150-2010-10-22-10-12-52.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a><a href=\"http://500.co/wp-content/uploads/2010/10/ben-lewis.gif\"><img class=\"alignnone size-thumbnail wp-image-1116714344\" title=\"Ben-Lewis\" src=\"/backup/ben-lewis-136x150-2010-10-22-10-12-52.gif\" alt=\"\" width=\"136\" height=\"150\" /></a>\n\n<em>Meet Green Lantern, aka super-mentor Ben Lewis. Ben is a co-founder and VP of Product at <a href=\"http://tapjoy.com\">Tapjoy</a>, a platform offering mobile publishers solutions for application discovery, rich advertising, and virtual good sales. Before life as an entrepreneur, Ben was a product manager at Google and worked on consumer products such as Toolbar, Search, and Checkout. Ben was also an engineer on the original Xbox Live team.</em>\n\nAs one of the cofounders of Tapjoy, I hear a lot of ideas for iPhone and Android based companies.  These ideas usually fall into one of the following two categories:\n<ul>\n\t<li>I'm going to build an app or game</li>\n\t<li>I'm going to build a platform or ad network to help other developers</li>\n</ul>\nThe $100M question is which method is the best way to build a successful company. In short, I don't believe there is a universally right answer to that question. But having been on both sides of the ball I'll describe some of the pros/cons to each that I've seen and share my experience with Tapjoy.\n\n<em><strong>How Tapjoy got started</strong></em>\nTapjoy started out as an idea between my co-founder <a href=\"http://www.crunchbase.com/person/lee-linden\" target=\"_blank\">Lee Linden</a> and me. In the summer of 2008 we decided to build an iPhone game. We knew the market was growing and saw people making hundreds of thousands of dollars even though the app store was only a few months old. So we started designing a tower defense game that would eventually launch as <a href=\"http://toucharcade.com/2008/11/25/tapdefense-ad-supported-tower-defense-game/\" target=\"_blank\">TapDefense</a>.  Three months and a lot of hard work later our game launched. It's a story that has been repeated thousands of times since then by developers across the world. However, we were fortunate enough to see our game rise quickly to the #1 overall position in the Top 25 Free Apps list where it remained over Christmas and generated over six figures in ad revenue that month. Not bad for two guys doing this in their spare time.\n\nIt was that Christmas break where we decided to pursue Tapjoy full time. I quit my job when I returned to San Francisco in January and Lee joined me soon after. Of course, the big question remaining was how to grow our business.  We started by building tools to maximize our revenue:\n<ul>\n\t<li>An ads mediation platform to improve ads revenue</li>\n\t<li>A cross-promotion engine to increase the viability of new titles</li>\n\t<li>High scores</li>\n\t<li>A virtual goods store (this ended up being our most successful tool by far, leading to a 4x increase in revenue over banner ads)</li>\n</ul>\nSome of the developers we knew asked us about using these tools in their titles so we bundled them into a library that we could offer.  At first this was something we only shared with a few close friends, but it quickly expanded to dozens of apps, then hundreds, and now thousands.\n\nToday the focus of the Tapjoy platform is a virtual goods and virtual currency monetization system. We help games and apps with virtual goods make money with an alt-pay system. For users who are unwilling or unable to pay through in-app payments (many iPod Touches for instance have no credit cards associated with their account), the users can complete a marketing action in order to earn those virtual goods. These marketing actions translate directly into dollars flowing through Tapjoy to our publishers. By far the most successful marketing action is to download another app. Even developers of free apps are more than happy to pay for these incented installs. And today, with hundreds of live publishers and thousands of live advertisers (app developers), Tapjoy is the #1 paid app distribution network on the iPhone and Android platforms.\n\n<em><strong>A few things I learned in this time</strong></em>\nWhile both are challenging, I will say that it certainly isn’t as easy to build a platform as it is to build a single app/game. But the upside is that you have reduced risk. Assuming you can get partners on your platform, it’s only natural that some of these titles will be hits, thus giving you enough exposure to be successful. That much we realized back in the early days of Tapjoy. But here are some things we didn’t understand until living through them:\n<ol>\n\t<li><strong>You are always selling</strong>. The success of your platform depends on the number of partners using it. Even if you’ve never spent a day of your life in sales, be prepared to start. At a small company everyone needs to pitch in and help grow the business. Conferences, parties, reunions, etc all make great opportunities to add to your sales. When even a single partner can materially affect your overall numbers, it’s important to make a sale at any opportunity.</li>\n\t<li><strong>You are always on call. </strong>When your big partners (or your small ones) have a portion of their business dependent on your company you need to be available 24/7 to support them. Our (admittedly small) company couldn't take a real vacation until after we were acquired and added much needed troops to our workforce.</li>\n\t<li><strong>Reputation is key</strong>. Want to raise a Series A round? Any serious VC will be contacting your partners to see what kind of platform you run. Want to get acquired? Same deal. This is a very open community and the people you’re looking to for an investment or acquisition will know someone who is working for you. When we were looking to expand we had many of our big partners tell us “X was asking about you. We said good things.”.</li>\n\t<li><strong>Cash is key.</strong> One very important thing to keep in mind if you raise little or no money (like we did) is that when you get paid and when you have to pay are two totally different things. As a small company you aren’t in a great position to demand strong payment terms by your partners. If you want to work with big companies like Google or Microsoft, you’ll get paid when they want to pay you. And that can sometimes mean 60 or 90 days after you’ve spent their money. Likewise, if you’re paying out partners they often demand payment within 30 days or less. If you’re not careful this can create a cash flow situation where your bank account dwindles as your platform grows. We were able to mitigate this problem by capturing a higher volume of small company partners rather than a lower volume of large company volumes. The small companies tended to pay quickly which overshadowed our accounts receivable for the larger companies, keeping our business cash flow positive. If you don’t have the luxury or fortune to depend on this I highly recommend raising more money or negotiating accounts receivable based bank loans.</li>\n</ol>\n<em><strong>When it works</strong></em>\nPerhaps the biggest benefit of all to running a platform is watching other people’s businesses grow and knowing you're helping to make that happen. I’ve been able to write very large checks to partners I now consider my friends.\n\nAs tough as it is sometimes when your partners are upset or your servers are crashing, it can be a pretty amazing experience to embark on building a platform that powers other startups like yourself.\n\n<em>Tapjoy was acquired by Offerpal Media earlier this year, which has since re-named itself to Tapjoy. You can check out a video interview of Ben and his co-founder Lee <a href=\"http://techcrunch.com/2010/03/22/offerpal-media-acquires-tapjoy-gains-beachhead-for-mobile-app-monetization/\" target=\"_blank\">here</a>.</em>",
    "type": "post",
    "path": "/2010/10/22/making-your-startup-a-platform/"
}