{
    "title": "Marc Shedroff, VP of Samsung’s Open Innovation Center, on What He Looks for in Startups",
    "slug": "marc-shedroff-vp-of-samsungs-open-innovation-center-on-what-he-looks-for-in-startups",
    "date": "2013-11-08T19:45:06.000Z",
    "url": "http://500.co/?p=1116730485",
    "uri": "http://500.co/2013/11/08/marc-shedroff-vp-of-samsungs-open-innovation-center-on-what-he-looks-for-in-startups/",
    "postId": "1116730485",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/11/samsung2-1024x682.jpg"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "interviews",
        "investment",
        "samsung"
    ],
    "content": "<i>Samsung launched the Open Innovation Center (OIC) in Silicon Valley this past January, which operates four main functions – strategic investments, acquisitions and partnerships as well as an accelerator, with locations on both coasts. We interviewed Marc Shedroff, OIC’s Vice President, who previously worked as head of entertainment and sports partnerships at YouTube. Check out what Marc has to say about Samsung’s OIC and Accelerator:</i>\n<p style=\"text-align: center;\"><a href=\"http://500.co/wp-content/uploads/2013/11/samsung2.jpg\"><img class=\"aligncenter  wp-image-1116730491\" alt=\"samsung\" src=\"/backup/samsung2-1024x682-2013-11-08-13-13-45.jpg\" width=\"614\" height=\"409\" /></a></p>\n<strong>For so long, Samsung was very focused on manufacturing hardware and devices. Now, over the past couple years, you’re focusing more on software. Can you share how Samsung OIC is doubling down on software innovation?</strong>\n\nSamsung has seen amazing growth. We are the market leader in TV and mobile and, in just the last year, we grew revenue from $143BB in 2011 to $187BB in 2012. One of the ways we will sustain that growth is through continuing to make great devices. But, to differentiate experiences and accelerate growth over time, we must create a thoughtful integration of our existing hardware expertise with world-class software and services. OIC is organized to cover the entire spectrum of innovation from startups, ranging from investment, to partnerships, acquisitions, and even incubating our own in the Samsung Accelerator.\n\n<strong>OK, let’s start with Investing in startups. What are the top 5 things that Samsung OIC looks for when considering making a new investment in a startup?</strong>\n\nThere are two main axes on which we evaluate an investment – (1) what do we think of the company, and (2) the strategic fit for Samsung as a partner. In regards to the company, we examine the strength of the investment in terms of innovation – does it solve a big problem? What is the ultimate value to our consumers? If the investment team has passion, the drive to win and a true willingness to listen and push boundaries – that’s very important too. Lastly, we look at the competitive differentiation – technology, domain expertise, execution and market position.\n\nIn terms of strategic fit for Samsung, we intend that every one of our venture investments ultimately has some sort of collaboration with a Samsung business unit. To accomplish this we only invest in companies that we think have that potential, and we also involve our business unit colleagues in the evaluation.\n\n<strong>What are your investment sizes?</strong>\n\nSeed, Series A, and Series B or up to $3MM.\n\n<strong>OK, let’s talk about Accelerator. From a startup’s perspective, what does the Samsung Accelerator offer that other Accelerators don't offer?</strong>\n\nWhile the Accelerator provides the traditional benefits of a startup - agility, small and collaborative teams and risk-taking energy - what separates us from the rest of the pack is access to Samsung’s considerable resources.\n\n<strong>Can you elaborate on the distribution traction, people and plans that startups who partner with Samsung will have access to?</strong>\n\nEach startup requires a unique set of resources and assets, so it does vary. All Accelerator startups have access to internal Samsung teams, product roadmaps and key decision makers as needed.\n\n<strong>How can startups apply for your accelerator?</strong>\n\nThose interested in applying can do so directly via sam@samsungaccelerator.com.\n\n<strong>What advice can you give to bootstrapped startups trying to get their startup off the ground?</strong>\n\nRemain focused, concentrate on attracting top talent and, during the initial incubation phase, consider issues that challenge consumers the most. Additionally, always have the big picture in the back of your mind and set your sights on adding value – regardless of the product. It’s become fairly cheap, and quick, to “bootstrap” a v1 MVP, and you can get a pretty good sense of whether the product is resonating with users. What’s not easy is to build a scaled, full-featured product and even harder yet is to build a company. So my advice would be to know that success is found over multiple years, not months. The other thing I would suggest is to think a lot about distribution and user adoption. There are hundreds of thousands of apps in the app store and millions of websites, so discovery is a huge challenge.",
    "type": "post",
    "path": "/2013/11/08/marc-shedroff-vp-of-samsungs-open-innovation-center-on-what-he-looks-for-in-startups/",
    "backgroundImage": "/backup/samsung-960x540-2013-11-08-13-13-45.jpg"
}