{
    "title": "Mentor Like You Mean It",
    "slug": "mentor-like-you-mean-it",
    "date": "2012-03-19T23:21:33.000Z",
    "url": "http://500.co/?p=1116719487",
    "uri": "http://500.co/2012/03/19/mentor-like-you-mean-it/",
    "postId": "1116719487",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/03/jenniferlum.jpg",
        "http://500.co/wp-content/uploads/2012/03/davebalter.jpg"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<a href=\"http://500.co/2012/03/19/mentor-like-you-mean-it/jenniferlum-2/\" rel=\"attachment wp-att-1116719488\"><img class=\" wp-image-1116719488 alignleft\" title=\"jenniferlum\" src=\"/backup/jenniferlum-2012-03-19-12-17-21.jpg\" alt=\"\" width=\"153\" height=\"153\" /></a>  <a style=\"font-weight: bold;\" href=\"http://500.co/2012/03/19/mentor-like-you-mean-it/jenniferlum-2/\" rel=\"attachment wp-att-1116719488\"> </a><strong><a href=\"http://500.co/2012/03/19/mentor-like-you-mean-it/davebalter/\" rel=\"attachment wp-att-1116719489\"><img class=\"alignleft  wp-image-1116719489\" title=\"davebalter\" src=\"/backup/davebalter-2012-03-19-12-17-21.jpg\" alt=\"\" width=\"153\" height=\"153\" /></a>  </strong><strong></strong>\n\n<i><em><strong>Jennifer Lum</strong> (<a href=\"http://www.twitter.com/jenniferlum\" rel=\"nofollow\" target=\"_blank\">@jenniferlum</a>) is a mobile entrepreneur and investor. She is a co-founder of Apricot Capital and mentors at 500 Startups and TechStars. Her start-up experience includes: Quattro Wireless, m-Qube, and WebHosting.com</em>\n\n<em><strong>Dave Balter </strong>(<a href=\"http://www.twitter.com/DaveBalter\" rel=\"nofollow\" target=\"_blank\">@DaveBalter</a>) is the founder and chief executive officer of the social marketing company BzzAgent. He is also a founder and executive chair of skill-testing platform Smarterer, and an investor or advisor to a dozen startups.</em>\n\n<em>This post is reblogged from the <a href=\"http://www.inc.com/dave-balter-and-jennifer-lum/how-to-be-a-great-mentor.html\">original post on Inc.</a></em></i>\n\nSomething magical is happening in Boston right now, and it's going to make history.  Like many start-up scenes, Boston's is truly exploding, vibrant with passionate founders and bold teams who are backed by a fresh crop of seed funds and experienced venture capitalists.  But it isn't merely a rehash of the late 90s or early 2000s. It's something entirely different.\n\nIn 2011, Boston's start-up \"ecosystem\" began to deeply interconnect—like some massive neural network—and it's now on the precipice of becoming one of the greatest startup organisms ever created.  The reason for this is simple: the Boston community is nurturing, embracing, and considerate of its entire being.  This start-up system has bucked convention in a city where people don't make eye contact on the T, and a honk and the finger is all part of the morning commute.  What was once an environment of competition and posturing has been replaced by one of cultivation and brotherhood.\n\nThe momentum that's brought Boston into 2012 is irrefutable.  Everywhere you turn new nodes are being created and synapses are firing.  We're seeing a similar trend in cities around the country like Austin, Las Vegas, Salt Lake City, and New York.  But even with all of the wonderful things happening around the country, there's a real danger that we could miss the multi-billion dollar opportunity that lies in front of us.  That's because this interconnectivity is merely the beginning.  What will make or break 2012 isn't the validity of the ideas created, the energy of the founders, or the willingness for capital to be deployed.  Individuals will make the difference—entrepreneurs and mentors alike—by proactively fostering and enabling results through two specific activities: what I call spiderweb mentorship and horizontal entrepreneurism.\n<ul>\n\t<li><strong>Spiderweb mentorship:</strong> Successful entrepreneurs and executives actively pushing people<em> up and into</em> the ecosystem.</li>\n</ul>\n<ul>\n\t<li><strong>Horizontal entrepreneurism:</strong> Collaboration <em>across </em>companies, with entrepreneurs enthusiastically supporting each other.</li>\n</ul>\n<div><span style=\"font-size: 14px; line-height: 23px;\">\n</span></div>\nBoston is rife with examples of horizontal entrepreneurism. <a href=\"http://workvibe.com/explore\" rel=\"nofollow\">Workvibe</a> profiles local start-ups to draw in new talent, <a href=\"http://bostinno.com/2011/04/27/whats-a-rubyriot/\" rel=\"nofollow\">#RubyRiot</a> (which Jennifer helped organize) encourages community members to \"pay it forward,\" and <a href=\"http://www.bizjournals.com/boston/stories/2009/03/30/story13.html?page=all\" rel=\"nofollow\">BzzAgent</a> (where Dave is CEO) offers office space to start-ups.\n\nBut a \"horizontal\" entrepreneur ecosystem also runs a very dangerous risk: It can turn into something like a start-up high school clique.  There are those on the inside, and then those who are unknown, disconnected, and unintentionally undermined.  Whether Boston has splintered into its own <a href=\"http://en.wikipedia.org/wiki/Heathers\" rel=\"nofollow\">Heathers</a> vs. Everyone Else environment is up for debate but what's critical now is to consciously avoid this trap and to take specific actions that ensure we continue to grow our start-up scene and not shatter it.\n\nThat brings us to \"spiderweb mentorship,\" which we believe is the determining factor in whether or not a start-up ecosystem splinters and cliques—or becomes robust enough to optimize the likelihood for companies to thrive and succeed.\n\nThis is about creating the strongest start-up \"web\" possible, by weaving an incredible tapestry of ideas and connections, allowing for random new offshoots, connecting divided webs, and oscillating the whole entrepreneurial ecosystem into action.\n\nThis occurs when experienced veterans (mentors) focus not on making each individual entrepreneur better, but on making the system as a whole stronger.  Mentors must be open and willing to (a) connect with people beyond only those with the right \"credentials\" and (b) focused on the development of \"web-like\" interconnectivity to other mentors and other entrepreneurs.  This can be accomplished by mentors actively engaging in this set of critical behaviors:\n\n<strong>1</strong><strong>. Take the unknown meetings with ambiguous agendas.</strong>  Regardless of someone's experience or who they know, spiderweb mentors connect with people who reach out to them, to create new connective threads.  The strongest mentors are willing to take a meeting, just to listen and share, with no specific agenda.  We both have spiderweb mentors to thank for helping start our careers.\n\n<strong>2</strong><strong>. Follow the law of three introductions.</strong>  Once you meet with an entrepreneur, it's key that you introduce him or her to at least three others – two active or known entrepreneurs and one mentor—to facilitate more connections across the horizontal entrepreneur web.\n\n<strong>3.</strong> <strong>Be constructive—and critical</strong>.  Push each other to grow and improve. While it is important to celebrate and talk about the wins, cheerleading alone will not ensure business success.  As they say: If you see something, say something.\n\n<strong>4. I</strong><strong>f you're a big spider, show up!</strong>  Executives at mature companies need to engage with the community, too.  You big guys know who you are and you have a lot of knowledge to share.  This is one of the best ways for you to give back.\n\n<strong>5. </strong><strong>Start your own web.</strong>  Have the initiative to take charge, reach out, and speak up.  As the mentor it's up to you to activate the web.  Get involved with universities, sit on panels, hold open office hours.  Whatever it takes, make yourself available.\n\nSo, this is a call to every start-up city to inspire your entrepreneurs and mentors to do the work.  To protect against the one virus that can take us down: failure to support each other.  We need to go out of our way to make it happen. Spiderweb mentorship and horizontal entrepreneursim can ensure our organism thrives and survives.  This is the moment.  Let's weave the web people!",
    "type": "post",
    "path": "/2012/03/19/mentor-like-you-mean-it/"
}