{
    "title": "Mexico: The Sleeping Giant",
    "slug": "mexico-the-sleeping-giant",
    "date": "2013-04-05T23:49:45.000Z",
    "url": "http://500.co/?p=1116726729",
    "uri": "http://500.co/2013/04/05/mexico-the-sleeping-giant/",
    "postId": "1116726729",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/04/mexico-1024x682.jpg"
    ],
    "creator": "",
    "categories": [
        "500strong",
        "latin-america",
        "mexicanvc",
        "mexico",
        "musings",
        "who-is-500",
        "who-is-500-2"
    ],
    "content": "<p dir=\"ltr\"><strong>TL;DR: If you think Mexico is a violent, derelict nation with a couple really nice beaches, think twice. This economic and cultural powerhouse represents one the most overlooked investment opportunities on the planet.</strong></p>\n<p dir=\"ltr\">Over the last few decades, Mexico's reputation has suffered tremendously. From the late seventies to the mid-nineties, the government’s economic policy proved to be flawed, creating two unfortunate effects: a substantial increase in undocumented immigration to the US and a spike in organized crime. Clearly, these are major issues, and there are still challenges ahead. But they do not represent Mexico in its entirety.</p>\n<p dir=\"ltr\">During the last 15 years, Mexicans have built upon a couple of their core strengths: relentlessness and creativity. The work of many has yielded returns, and today the country is climbing up the ladder. We’re now in the position to become a top ten economy before the end of the next decade.</p>\n<p dir=\"ltr\">For starters, Mexico is a 120-million-people land of opportunity, and it's GDP per capita is larger than everyone's favorite emerging market – Brazil.  Even though commodities such as oil rank high in terms of GDP contribution, other industries like tourism and manufacturing are at least as important. In fact, Mexico is the second largest trade partner of the US, only behind Canada.</p>\n<p dir=\"ltr\">In spite of this, the 12th largest economy of the world has been often ignored as an investment destination. But this is finally changing.</p>\n<p dir=\"ltr\">Over the last five years, a younger generation of Mexicans has seen drastic social and economic change. This educated group of digital natives is more than aware of global opportunities, and is working hard to make Mexico more innovative. In just the last 18 months, Mexico went from zero to the second largest player in the <a href=\"http://startupweekend.org/\" target=\"_blank\">Startup Weekend Community</a>, with 23 cities and more than 40 events, putting us just behind the United States. Communities such as SuperHappyDevHouse, Women 2.0, Sandbox Network and Global Shapers have very strong chapters in Mexico, and even the <a href=\"http://www.technologyreview.com/\" target=\"_blank\">MIT Technology Review</a> is holding an event for top innovators in Mexico City.</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"http://500.co/wp-content/uploads/2013/04/mexico.jpg\"><img class=\"wp-image-1116726741 aligncenter\" alt=\"mexico\" src=\"/backup/mexico-1024x682-2013-04-05-13-17-49.jpg\" width=\"730\" height=\"486\" /></a></p>\n<p dir=\"ltr\">The timing couldn't be better. A digital revolution seems to be right around the corner, as internet penetration has recently shown record growth rates. Just after the dotcom crash of the late nineties, Mexico had just over 3 million people connected to the Internet. That number will be 20 times larger by the end of 2015.</p>\n<p dir=\"ltr\">And there's more to come. A recent reform could end a long-lasting monopoly in the telecommunications sector. Competition will certainly increase the quality of service and prices could eventually go down, making it easier for people to get connected. Mexico’s banking system is also stronger than ever, with profitable, well-capitalized private banks. Ironically, Banamex accounts for 15% of Citigroup's profits, which makes the Mexican subsidiary its most profitable unit.</p>\n<p dir=\"ltr\"><strong>So, is it a good time to invest in the market? We think so.</strong></p>\n<p dir=\"ltr\">Mexico has an active entrepreneurial ecosystem that’s solving real problems. Hundreds of founders are building Internet-powered businesses to improve education, health, access to financial services, transactional platforms, commerce, and transportation, just to name a few spaces. And these entrepreneurs are  revenue-oriented instead of just being driven by growth. This seems to be a response to the historical lack of venture capital and the need to bootstrap their own endeavors. But again, things are getting better; the recent arrival of new funds and accelerators is increasing the odds for entrepreneurs, who now can find equity financing and grow their businesses much faster.</p>\n<p dir=\"ltr\">Macroeconomic trends have aligned with grassroots entrepreneurship in Mexico, and we believe a \"perfect storm\" is on its way. We’re putting our money where our mouth is by investing in entrepreneurs who will make it one of the biggests markets in the next decade.</p>\n<b id=\"internal-source-marker_0.3781815776601434\"> It may take some time, but Mexico will soon shed its violent reputation and become one of the biggest players in the global economy. </b>",
    "type": "post",
    "path": "/2013/04/05/mexico-the-sleeping-giant/",
    "backgroundImage": "/backup/7239915476_32332c6524_o-960x540-2013-04-05-13-17-49.jpg"
}