{
    "title": "Mobile App Distribution for Dummies",
    "slug": "mobile-app-distribution-for-dummies",
    "date": "2013-08-27T17:42:09.000Z",
    "url": "http://500.co/?p=1116729369",
    "uri": "http://500.co/2013/08/27/mobile-app-distribution-for-dummies/",
    "postId": "1116729369",
    "description": "",
    "images": [
        "http://media.tumblr.com/5daa77b8c7ed9f105ef01b2a236e6e06/tumblr_inline_mqjviwJ1Gi1qz4rgp.gif",
        "http://24.media.tumblr.com/7b6264f933ea76c48c22b403c12a7c57/tumblr_mmrm6dGb8W1squcpjo1_250.gif",
        "http://wixmobile.com/wp-content/uploads/2011/11/sonic.jpg",
        "http://media.tumblr.com/tumblr_m6rcaxa17d1r6o2d6.gif",
        "http://www.insidemobileapps.com/wp-content/uploads/offers-333x500.png",
        "http://media.tumblr.com/5fc40d0fc00acabaa2d74b35e9922558/tumblr_inline_miytrjlCW81qz4rgp.gif",
        "http://m.mediapost.com/publications/73/maddenapp-b.jpg",
        "http://media.tumblr.com/3be502474d7b131a9681a70a790cf362/tumblr_inline_mmknekvghA1qz4rgp.gif"
    ],
    "creator": "",
    "categories": [
        "advertising",
        "banner-ads",
        "distribution",
        "distribution",
        "distribution-tuesday",
        "mobile",
        "mobile-apps",
        "mobile-monetization",
        "video-advertising"
    ],
    "content": "Do you have an awesome mobile app? Is it the most glorious piece of software you have ever set your eyes on? A true revelation in the mobile app industry that is sure to blow people's minds all across the universe?\n\nIf you answered yes to all those questions, you obviously don't need to do any mobile app distribution. Since your product is SO awesome, you're obviously going to attract users and you'll be at the top of the charts in no time.\n\nNOT.\n\n<img class=\"alignnone\" alt=\"\" src=\"/backup/tumblr_inline_mqjviwJ1Gi1qz4rgp-2013-08-27-13-12-42.gif\" width=\"500\" height=\"204\" />\n\nEven if you have the most amazing app in the world, no one's going to know about it unless you are acquiring users through some kind of distribution channel. In a perfect world, people would magically gravitate towards the beautiful pieces of technology you've created but unfortunately, we don't live in a perfect world so that's not going to happen (most of the time).\n\nBut it's going to be okay because we have this guide here to make sure you DO know how to distribute your amazing app so that you're one step closer to app stardom, with your app's name up in lights next to Angry Birds, Candy Crush and Temple Run. So stop waiting, start acquiring!\n<h4>Mobile App Distribution Slang (i.e. Key Terms)</h4>\n<ul>\n\t<li><strong>CPI</strong> - Cost per Install: The cost to you when someone downloads your app.</li>\n\t<li><strong>CPC</strong> - Cost per Click: The cost to you when someone clicks on your ad.</li>\n\t<li><strong>CPM</strong> - Cost per Impression: The cost to you when someone views your ad.</li>\n</ul>\n\"<em>WOAH, HOLD UP.</em>\"  You say.\n\n<img class=\"alignnone\" alt=\"\" src=\"/backup/tumblr_mmrm6dGb8W1squcpjo1_250-2013-08-27-13-12-42.gif\" width=\"250\" height=\"173\" />\n\n\"<em>Dude, I want to GET money when people download my app. Why should I be the one paying?</em>\"\n\nOften, it's very difficult to be discovered in the app store. Your app is lying right at the 10,000th page of the Games category and it's going nowhere because, seriously, who wants to scroll through 10,000 pages of apps? So you pay ad companies to display your ads and for every person that clicks/installs your game, you have to pay the CPC/CPI respectively to that company. This process <strong>drives downloads</strong> which <strong>drives rankings</strong> for your game and provided you either buy enough installs/have enough people discovering your app organically through social networks or friends, you'll end up at Number 30 on the App Store! Sure, it's not Number 1, but being closer to the top <strong>drives organic downloads</strong> which are your main goal -- when people are discovering your app through the app store and downloading it, telling their friends, etc. and no more fees for you! Yay.\n\nSo let's get started with some ways you can distribute your app.\n<h3>Types of Mobile Ads:</h3>\n<h4>Non-incentivized -- (Users have no incentive to interact with your ad)</h4>\n<ul>\n\t<li>Traditional Banner Ads</li>\n\t<li>Video Ads</li>\n</ul>\n<h4>Incentivized -- (Offers users in-game currency for install)</h4>\n<ul>\n\t<li>Offer Walls</li>\n\t<li>Video Ads</li>\n</ul>\n<h4></h4>\n<h3>Money-spangled Banner Ads</h3>\n<p style=\"text-align: center\"><img class=\"aligncenter\" alt=\"\" src=\"/backup/sonic-2013-08-27-13-12-42.jpg\" width=\"300\" height=\"254\" /></p>\nThese are exactly what you think they are! A banner displaying the ad for your game.\n<p style=\"padding-left: 30px\"><strong>Pros:</strong> Cheap, easily integrated, not too annoying to users.\n<strong>Cons:</strong> Users spend little time looking at ads, ads need to be eye-catching and well-designed in order for users to click through.</p>\n<strong>What to look for:</strong>\n\nLook for a distribution service provider with a low CPI and high volume OR (and this would be even better) customers with a high LTV. You'll need <strong>a lot</strong> (and I mean, <strong>SERIOUSLY THOUSANDS</strong>) of installs to get anywhere near the top of the App Store charts and for people to see your app. It's also important that your app discovery platform has a large inventory for ads (meaning that they have a large network of advertisers who are willing to display your ad on their app). And lastly, <strong>be picky</strong> about your banner ad publisher's designs because you want as many people as possible to click and install your game and there's no other incentive for that besides the attractiveness of your ad. Ads that are integrated in a native setting do not look out of place from the app itself and are more effective if they seem more like a suggestion and less like a \"<em>BUY ME. PLEASE</em>.\"\n\n<img class=\"alignnone\" alt=\"\" src=\"/backup/tumblr_m6rcaxa17d1r6o2d6-2013-08-27-13-12-42.gif\" width=\"220\" height=\"124\" />\n\n<strong>Recommendations:</strong> <a href=\"https://www.chartboost.com/\" target=\"_blank\">Chartboost</a>, <a href=\"http://www.google.com/ads/admob/\" target=\"_blank\">Admob</a>\n<h3>Show me the money: Offer walls</h3>\n<img class=\"alignnone\" alt=\"\" src=\"/backup/offers-333x500-2013-08-27-13-12-42.png\" width=\"180\" height=\"270\" />\n\nThese are a page of CPI/CPC ads that are incentivized. If a user installs/clicks on the app, they can receive in-game currency.\n<p style=\"padding-left: 30px\"><strong>Pros:</strong> Incentive to install your app = increased installs, increased discovery over several platforms.\n<strong>Cons:</strong> Have to compete with other apps that may seem more appealing/give more currency, costs more to increase incentive for users to download, Apple set a ban on offer walls in 2011 and while there are still many apps using them right now, volume has decreased.</p>\n<strong>What to look for:</strong>\n\nUsers interested in viewing incentivized apps will have to download the ad publisher's homepage onto their mobile device. (Since 2011, Apple has banned the use of offer walls within apps.) Look for distribution service provider that has a large pay-per-install network so that you can spread your ad across dozens of publishers and gain access to many users who are totally willing to download your ad for a few bucks to spend on Bread Kittens. I admit, I'm totally one of them and I'm sure billions of people would do the same. It's a good way to get people to install your app onto their device and from there <strong>maybe</strong> use it more if they find it interesting. Note: Apple has banned offer walls so use them at your own risk! To quote Paul Graham, <strong>do things that don't scale</strong>. Try it out and see what works for you!\n\n<img class=\"alignnone\" alt=\"\" src=\"/backup/tumblr_inline_miytrjlCW81qz4rgp-2013-08-27-13-12-42.gif\" width=\"240\" height=\"127\" />\n\n<em>Tip:</em> Test different landing pages for your app. If your user downloads your app for the first time, it's <strong>not </strong>because they think your app sounds interesting. So make sure you're homepage looks as attractive and interesting as possible so users will consider trying it out, rather than deleting it straight after.\n<strong>Recommendations:</strong> <a href=\"https://www.tapjoy.com/\" target=\"_blank\">Tapjoy</a>, <a href=\"sponsorpay.com\" target=\"_blank\">Sponsorpay</a>\n<h3>Video Advertising killed the Radio Star</h3>\n<img class=\"alignnone\" alt=\"\" src=\"/backup/maddenapp-b-2013-08-27-13-12-42.jpg\" width=\"365\" height=\"201\" />\n\nA newbie to the advertising game, video ads either a. plays during loading screens/wait times or b. gives you the choice to watch the video for in-game currency.\n<p style=\"padding-left: 30px\"><strong>Pros:</strong> Videos can showcase your app in an more dynamic and exciting way, video is new but growing -- you're ads will look WAY more attractive than most of the banner ads out there.\n<strong>Cons:</strong> Users can skip your ad if it's boring, ads are more suited towards apps in the mobile gaming space.</p>\n<strong>What to look out for:</strong>\n\nShort HQ videos are great for catching a potential user's attention, provided that your app is something that they might be interested in and that your video is attractive enough. Look out for publishers that can pre-cache your ad (meaning that there are no buffer times) and who can provide the user with a streamlined app experience (where the user isn't interrupted in the middle of milking a cow or punching a tree and the ad shows during a loading screen).\n\n<img class=\"alignnone\" alt=\"\" src=\"/backup/tumblr_inline_mmknekvghA1qz4rgp-2013-08-27-13-12-42.gif\" width=\"240\" height=\"192\" />\n\n<strong>Recommendations:</strong> <a href=\"http://vungle.com\" target=\"_blank\">Vungle</a>, <a href=\"http://adcolony.com/\" target=\"_blank\">AdColony</a>\n<h4>That's not the only way to monetize!</h4>\nIt's a pay-it-back opportunity where YOU could be a publisher and earn money from publishing ads on your app. Most (if not, all) mobile distribution service providers and advertising networks allow you to sign up as a publisher too!\n<h4 style=\"text-align: center\">PAY MONEY -&gt; GET USERS -&gt; GET MORE MONEY -&gt; EVERYBODY WINS.</h4>\n&nbsp;\n\nWhat's your preferred way to monetize and distribute your app? Let us know in the comments!\n<h6><em>Disclosure:</em> If you have a crappy app, no matter how many installs you buy or what position you are on the app store, nothing can save you from the dreaded install-for-currency-then-delete. Don't waste your money advertising a bad app, spend your money making your app AWESOME. Then, come back here and read this guide again.</h6>",
    "type": "post",
    "path": "/2013/08/27/mobile-app-distribution-for-dummies/",
    "backgroundImage": "/backup/CCrehab-2013-08-27-13-12-42.jpg"
}