{
    "title": "Word To Your Mother - Mobile Moms Are Early Tech Adopters",
    "slug": "mobile-moms-early-adopters",
    "date": "2011-05-09T04:54:19.000Z",
    "url": "http://blog.500startups.com/?p=1116715288",
    "uri": "http://500.co/2011/05/08/mobile-moms-early-adopters/",
    "postId": "1116715288",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/05/avishai-family-295x300.jpg",
        "http://500.co/wp-content/uploads/2011/05/graph-300x154.png",
        "http://500.co/wp-content/uploads/2011/05/evo-iphone-monitor-264x300.png",
        "http://500.co/wp-content/uploads/2011/05/EVOZ_Monitor_v2-180x300.png"
    ],
    "creator": "",
    "categories": [
        "avishai-shoham",
        "evo-monitors",
        "evoz",
        "guest-posts",
        "mobile",
        "mothers",
        "parents",
        "startups"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/05/avishai-family.jpg\"><img class=\"alignnone size-medium wp-image-1116715290\" title=\"avishai family\" src=\"/backup/avishai-family-295x300-2011-05-08-11-23-54.jpg\" alt=\"\" width=\"295\" height=\"300\" /></a>\n\n<em><strong>Happy Mother's Day!</strong> Today's post was written by <a href=\"http://twitter.com/#!/ashoham\" target=\"_blank\">Avishai Shoham</a>. Avishai is a dad and also founder &amp; CEO of <a href=\"http://www.myevoz.com/\" target=\"_blank\">Evoz Monitors</a>, a 500 Startups company. </em>\n\nTwo of the biggest consumer tech trends today are mobile connectivity and personalized data collection. Moms, in particular, are embracing both in record numbers to monitor the health and wellness of their families. Forget about targeting millennials and young men - if you want to see how rapidly new tech can “cross the chasm,” deliver Mom some cutting edge health hacks.\n\n<a href=\"http://500.co/wp-content/uploads/2011/05/graph.png\"><img class=\"alignnone size-medium wp-image-1116715289\" title=\"graph\" src=\"/backup/graph-300x154-2011-05-08-11-23-54.png\" alt=\"\" width=\"300\" height=\"154\" /></a>\n\nAs smartphones continue to gain market share – especially with working moms – a new generation of companies will deliver technological solutions that target the health needs of these “always connected” individuals. From the FitBit, to the newly constructed <a href=\"http://www.bestbuy.com/site/Misc/regularCat%3Apcmcat205600050016/pcmcat205600050016.c?id=pcmcat205600050016\">health tech centers in Best Buy stores</a>, to NikePlus, the confluence of mobile computing, real-time data collection and personal wellness has resulted in all sorts of mobile health solutions in the consumer tech space.\n\n<a href=\"http://500.co/wp-content/uploads/2011/05/evo-iphone-monitor.png\"><img class=\"alignnone size-medium wp-image-1116715291\" title=\"evo iphone monitor\" src=\"/backup/evo-iphone-monitor-264x300-2011-05-08-11-23-54.png\" alt=\"\" width=\"264\" height=\"300\" /></a>\n\nOne of these solutions is Evoz – a baby monitor that tracks and analyzes real time baby data and connects parents to personalized services such as sleep consultants, nannies and more. The concept of a baby monitor with unlimited range coupled with real time, personal baby data has clearly struck a chord with people. <a href=\"http://techcrunch.com/2011/04/01/evoz-baby-monitoring-2-0-comes-of-age/\">After Evoz was reviewed on TechCrunch</a>, we had over 1800 people sign up for our private Beta program. Part of that is timing. I’m not sure this idea was ready for prime-time 24 months ago. But now parents - and moms in particular - are embracing new tech to help them raise happy, healthy children. They trust mobile solutions that collect and personalize data securely - and they are ready to pay for these services.\n\n<a href=\"http://500.co/wp-content/uploads/2011/05/EVOZ_Monitor_v2.png\"><img class=\"alignnone size-medium wp-image-1116715292\" title=\"EVOZ_Monitor_v2\" src=\"/backup/EVOZ_Monitor_v2-180x300-2011-05-08-11-23-54.png\" alt=\"\" width=\"180\" height=\"300\" /></a>\n\nPart of the appeal of these devices is that they give us insight into our habits and ourselves that we did not have before. More than counting calories, new devices give us more complete pictures of who we are, how we live, and how we can improve our lives. Turning raw data into personal recommendations is part of <a href=\"http://techcrunch.com/2011/04/10/the-new-information-age/\">“the new information age,”</a> Vivek Wadhwa recently wrote about. This remarkable paradigm shift is already happening. In the past, new parents turned to parenting books and websites searching for answers about their baby’s health. In the near future, the solutions to their particular parenting problems will find them automatically.\n\nToday’s moms are literate, tech savvy and ready for advanced solutions. As a father myself, I have a personal stake in creating a meaningful mobile parenting experience. Many other people involved in the Evoz project also have children and we are all intent on building a state-of-the-art monitoring service to help optimize digital parenting. I firmly believe that mobile technology will give parents new ways to stay connected to their newborns. Parents want to feel connected to their babies and children and the market for these solutions represents an enormous opportunity. To again quote Professor Wadhwa, “the growth is exponential, and the innovation opportunities are bigger than Silicon Valley can imagine they are.”\n\n<em>*All graph data gathered from <a href=\"about:blank\">“The 21st Century Mobile Mom® Report,”</a> issued by BabyCenter.</em>",
    "type": "post",
    "path": "/2011/05/08/mobile-moms-early-adopters/"
}