{
    "title": "Necessity is the Mother of Invention",
    "slug": "necessity-is-the-mother-of-invention",
    "date": "2011-07-20T21:54:40.000Z",
    "url": "http://blog.500startups.com/?p=1116715745",
    "uri": "http://500.co/2011/07/20/necessity-is-the-mother-of-invention/",
    "postId": "1116715745",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/07/Leah2.jpg",
        "http://500.co/wp-content/uploads/2011/07/Leah+Kobe_0239-223x300.png"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<a href=\"/backup/Leah2-2011-07-20-11-16-54.jpg\"><img class=\"alignleft size-full wp-image-1116715746\" title=\"Leah2\" src=\"/backup/Leah2-2011-07-20-11-16-54.jpg\" alt=\"\" width=\"150\" height=\"175\" /></a>\n<em> </em>\n\n&nbsp;\n\n&nbsp;\n\n&nbsp;\n\n<em>A true visionary, Leah Busque (<a href=\"http://twitter.com/#!/search/labusque\" target=\"_blank\">@labusque</a>) is the founder and CEO of <a href=\"http://taskrabbit.com/\" target=\"_blank\">TaskRabbit.com</a>, the pioneer in \"service networking.\" Now an industry-wide concept, service networking describes the productive power of a web-based, social-networked community. Since it's founding in 2009, Leah has grown the company to more than 20 employees and has expanded the service to Boston, San Francisco, Los Angeles, Orange County and soon New York, Seattle, Chicago and beyond. Prior to founding TaskRabbit, Leah was a Software Engineer at IBM, working in the Messaging and Collaboration Software Development group. Leah graduated magna cum laude from Sweet Briar College, earning a Bachelor's of Science in Mathematics and Computer Science.</em>\n\nIt was a cold night in Boston in February 2008.  My husband, <a href=\"http://www.taskrabbit.com/team\">Kevin and I</a> were getting ready to go out to dinner and had just called a cab when we realized we were out of dog food for our yellow lab.  At 100 lb, <a href=\"http://www.taskrabbit.com/team\">Kobe</a> doesn’t miss many meals so we were in dire need of some food. We thought of our options - have the cab stop on the way home to pick up dog food, run to the store real quick before dinner. But, none was very appealing.\n\n<a href=\"http://500.co/wp-content/uploads/2011/07/Leah+Kobe_0239.png\"><img class=\"alignnone size-medium wp-image-1116715754\" title=\"Leah+Kobe_0239\" src=\"http://500.co/wp-content/uploads/2011/07/Leah+Kobe_0239-223x300.png\" alt=\"\" width=\"223\" height=\"300\" /></a>\n\nBoth my husband and I are in technology, so we tend to have some geeky conversations over dinner.  That night it turned into, “wouldn’t it be nice if there was a place online where we could go, say we needed dog food, and name the price we were willing to pay. We were certain there was someone in our neighborhood willing to help us out.”  At that time (2008), <a href=\"http://www.facebook.com\">Facebook</a> was becoming really popular, <a href=\"http://www.twitter.com\">Twitter</a> was up and coming, and the location-based platforms, like <a href=\"https://foursquare.com/\">Foursquare</a> or <a href=\"http://gowalla.com/\">Gowalla</a> did not yet exist (at least they weren’t on my radar).  In that moment of inspiration (or desperation), <a href=\"http://www.taskrabbit.com\">TaskRabbit</a> was born. Little did I realize that my life would take a dramatic turn.\n\nBefore that fateful night, I spent 7 years working as a software engineer at <a href=\"http://www.ibm.com\">IBM</a>, building enterprise software.   I loved my job and I really enjoyed the people I worked with at IBM. But, that flash of inspiration had taken a hold of me; I just couldn’t shake the feeling that I had more to offer and more skills to develop and share beyond programming.\n\nI spent the next four months talking to anyone who would listen about the TaskRabbit concept.  One of the people I met was <a href=\"http://www.zipcar.com/about/team\">Scott Griffith</a>, the CEO of <a href=\"http://www.zipcar.com\">Zipcar</a>.  I didn’t know Scott before, but a friend of a friend introduced us.  I spent 30 minutes describing my vision for TaskRabbit and at the end of the conversation he said, “I think you are onto something here. I think you should see how far you can take it.”  In fact, this response “see how far you can take it” was a common theme with the people that I met.  Thankfully, no one said, “you are insane, this is an awful idea!” So four months later, in June of 2008, I decided to quit my job at IBM and build the first version of the TaskRabbit website.  I cashed out my IBM pension to float us for the next six month, hoping that would be enough time to see where I could take my idea.\n\nI holed myself up for 10 weeks in the summer of 2008 and coded the first version of TaskRabbit.  It was a rough “<a href=\"http://en.wikipedia.org/wiki/Minimum_viable_product\">MVP</a>,” but it was enough to determine if there was any interest from the market.  I figured if I could launch TaskRabbit in one Boston neighborhood, I could measure the interest in the overall market.  In the fall of 2008, I launched TaskRabbit in Charlestown, the small Boston neighborhood where we lived.  It took off and grew very organically.  Soon people from all over Boston were posting jobs. Clearly, I wasn’t alone – many folks seemed to have experienced the same predicament I did that cold night in Boston.\n\nAround that time I pinged Scott Griffith and said, “remember when you told me to see how far I could take TaskRabbit, well I left IBM and have the website launched in one Boston neighborhood.”   He immediately came on board as my first Advisor and mentor, which was an incredible milestone for me.  From there, Scott introduced me to two early investors in Zipcar, who decided to lead a seed round of investment in TaskRabbit.  This was nine months after I left IBM, three months longer than my original six-month plan.  Those last three months were difficult, but I knew I was close.  Scott also encouraged me to apply to the fbFund Incubator program that was running in the summer of 2009.\n\nThe <a href=\"http://fbfund.com/\">fbFund program</a> was such a tremendous opportunity to meet other entrepreneurs, investors, and advisors.  One of those advisors was <a href=\"http://www.fourhourworkweek.com/blog/\">Tim Ferriss</a>, who visited us at fbFund about mid-way through the program.  I had read Tim’s book, <a href=\"http://www.fourhourworkweek.com/\"><em>The Four Hour Work Week</em></a>, and loved his perspective on living efficiently, understanding what your time is worth, and outsourcing your life.  It was perfect synergy with TaskRabbit.  After meeting with Tim for 15 minutes, he loved the idea of TaskRabbit!  He came on as an advisor one week later and introduced me to some of the top seed fund investors in Silicon Valley.\n\nOne of his first introductions was to <a href=\"http://www.floodgate.com/annmiurako.html\">Ann Miura-Ko</a> of <a href=\"http://www.floodgate.com/\">FLOODGATE Fund</a>.  We met over breakfast one morning in Palo Alto and she immediately saw TaskRabbit’s potential.  At the time, I was the still the only person on the team, but that didn’t stop Ann from leading our seed round to help build out the team and really prove out the model.  <a href=\"http://baselinev.com/\">Baseline Capital</a> and <a href=\"http://www.firstround.com/\">First Round Capital</a> also participated and we ended up raising $1.8 million dollars.\n\nFrom there, I hired my first full-time employee, <a href=\"http://www.taskrabbit.com/team\">Brian Leonard</a>, who joined as our VP of Engineering.  We then decided to move the team from Boston to San Francisco, where we established TaskRabbit’s second market.\n\nOnce we felt confident in the model we’d established in Boston and San Francisco, we knew we were ready to take TaskRabbit to the next level open additional markets.  To do that, we needed the next round of capital.  So, we took to the road (<a href=\"http://en.wikipedia.org/wiki/Sand_Hill_Road\">Sandhill Road</a>, that is) to raise our Series A financing.\n\nWe met many investors along the way and were lucky enough to receive warm introductions from our original powerhouse investors.  When we met the <a href=\"http://www.shastaventures.com/team\">partners</a> at <a href=\"http://www.shastaventures.com/\">Shasta Ventures</a>, we knew they would be the best fit.  With their focus and passion for consumer Internet brands, they understood the tremendous opportunity we were building and wanted to help.\n\nFast forward to today- we have also expanded the service geographically and are now live in LA and Orange County. We have 10-xed our growth over the last 12 months and we hope to be in all major US markets by the end of the year.\n\nIt’s been a tremendous ride these last couple of years and I am so grateful for the tremendous mentors, advisors, and investors who have helped us along the way.  Making the leap from an engineer to an entrepreneur hasn’t been easy, but I remember my defining moment when I literally thought…”Wouldn’t it be great if I could find someone in my own community who would be willing to help me out in a bind.” It’s amazing how creative and thoughtful you can be when you are trying to solve your own problem.  But that’s when powerful and great ideas are born - out of necessity.",
    "type": "post",
    "path": "/2011/07/20/necessity-is-the-mother-of-invention/"
}