{
    "title": "Never Been a Better Time for Women Entrepreneurs",
    "slug": "never-been-a-better-time-for-women-entrepreneurs",
    "date": "2011-06-23T01:43:55.000Z",
    "url": "http://blog.500startups.com/?p=1116715527",
    "uri": "http://500.co/2011/06/22/never-been-a-better-time-for-women-entrepreneurs/",
    "postId": "1116715527",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/03/phoenix_jeangrey-216x300.jpg",
        "http://500.co/wp-content/uploads/2011/03/wendytanwhite1.jpg",
        "http://500.co/wp-content/uploads/2011/06/moonfruit_team_office.jpg"
    ],
    "creator": "",
    "categories": [
        "guest-posts",
        "startups"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/03/phoenix_jeangrey.jpg\"><img title=\"phoenix_jeangrey\" src=\"/backup/phoenix_jeangrey-216x300-2011-06-22-11-20-43.jpg\" alt=\"\" width=\"216\" height=\"300\" /></a> <a href=\"/backup/wendytanwhite1-2011-06-22-11-20-43.jpg\"><img title=\"wendytanwhite\" src=\"/backup/wendytanwhite1-2011-06-22-11-20-43.jpg\" alt=\"\" width=\"200\" height=\"200\" /></a>\n\n<em>Meet Phoenix (Jean Grey) aka 500 SuperMentor <a href=\"http://500startups.com/profile.php?id=105\" target=\"_blank\">Wendy Tan-White</a>. Wendy is Founder of <a href=\"http://www.moonfruit.com/\" target=\"_blank\">Moonfruit</a>, a simple and powerful website builder for SMBs who expect better design tools to produce better designed sites. Moonfruit was founded in 1999, survived the Dotcom crash in 2000 and made a rapid resurgence in 2009. Wendy was Marketing Director of Gandi Group, helped start-up Zopa.com – first European P2P lending site and Egg.com – first UK internet bank. She sold her soul to Arthur Andersen after getting a BEng Computer Science from Imperial College, London. Wendy’s also a designer for fun and has a MA in Smart Textiles from Central St Martins. She is married to Joe who is COO/CFO of Moonfruit and they live with their 6 yr old son and 3 yr old daughter in London. Finally, Wendy was chosen as the CWT Everywoman 2011 Entrepreneur of the Year. </em>\n\n<em>This post is reblogged from the <a href=\"http://www.women2.org/never-been-a-better-time-for-women-entrepreneurs/\">original post on Women 2.0</a>.</em>\n\nIt’s been a great 12 months for our business, taking a $2.25M Series A round from Stephens(US) for international growth, backing from Silicon Valley-based 500 Startups, relaunching <a href=\"http://www.moonfruit.com/\">Moonfruit</a> to focus on SMB’s who expect better DIY design tools to build better designed websites, record revenues and the <a href=\"http://www.computerweekly.com/blogs/witsend/2011/03/winners-cwt-everywoman-in-technology-awards.html\">Everywoman Entrepreneur of the Year</a> award. There has never been a better time to be a women entrepreneur, get out there and set up your own business!\n\n<a href=\"http://www.illuminate.com/whitepaper/\">Women-led firms are the fastest growing sector of new venture creation in the US.</a> The trend is international, in Brazil there are <a href=\"http://womenentrepreneursgrowglobal.org/2010/04/09/female-entrepreneurs-outnumber-male-entrepreneurs-in-brazil/\">more female than male entrepreneurs</a> and China has created half of the <a href=\"http://www.forbes.com/2010/03/22/billionaire-women-entrepreneur-china-richest.html\">female billionaire entrepreneurs</a> globally a direct result of women’s economic empowerment. I believe there is also growth opportunity for women in the UK. As business owners, women in the UK still have a lot of ground to make up on our American cousins.\n\n<a href=\"/backup/moonfruit_team_office-2011-06-22-11-20-43.jpg\"><img class=\"alignnone size-full wp-image-1116715533\" title=\"moonfruit_team_office\" src=\"/backup/moonfruit_team_office-2011-06-22-11-20-43.jpg\" alt=\"\" width=\"670\" height=\"361\" /></a>\n\n<a href=\"http://www.fsb.org.uk/News.aspx?loc=general&amp;rec=6990\">Recent statistics</a> have shown that if the UK had the same level of female entrepreneurship as the US, there would be approximately 600,000 extra women-owned businesses, contributing an estimated additional £42 billion to the economy. To put it into perspective, with businesses started by men in the UK too, an extra 150,000 start-ups would be created per year if women were to meet their number of businesses started.\n\nIt raises interesting questions for debate – why are women more reticent taking the leap versus men? Is it rooted in education and awareness from a younger age? A collective psyche which has ambition elsewhere perhaps? I’d be interested to know your thoughts.\n\n<strong>Supporting Women of All Ages in Technology and Entrepreneurship</strong>\n\nI believe it’s important to support young women at grass roots level. <em><a href=\"http://www.fmwf.com/features/2010/10/breaking-the-mould-2011-launches/\">Breaking the Mould</a></em> is an event run by Lisa Buckingham, Editor of Financial Mail and FMFW which supports girls of school-age who are interested in getting into industries, such as tech, which are predominantly dominated by men. Speaking there I asked 300 girls, aged 16-18 ‘Who’s interested in working in the technology sector?’ Silence, no-one raised their hands. ‘Who uses Facebook?’ The majority raised their hands. This led to a debate on technology as an enabler. The girls were turned on by what tech can achieve as opposed the technology itself.\n\nWomen control 89% of household income, today four of the highest value consumer tech businesses globally today have more female customers than male, Facebook, Groupon, Zynga and Twitter. Moonfruit provides a simple but powerful, design-led DIY website builder for small businesses. 41% of our customers are women, up 20% from last year. The increase in women led businesses and the dominance of female consumers driving the growth of technology consumer markets is clearly a commercial opportunity.\n\n<strong>From Consumer to Capital Investment</strong>\n\nCoupled with the current buoyant investment climate, this has led to an increase interest in this sector from investors. Jeff Clavier, SoftTech VC gave a <a href=\"http://www.ezebis.com/venture/jeff-clavier-softtech-vc-betting-female-startups/\">thoughtful interview</a> on the matter to Pemo Theodore-Ezebis, Fred and Joanna Wilson strongly support Women 2.0 <a href=\"http://founderlabs.org/\">Founders Lab</a> and Dave McClure and Christine Tsai from <a href=\"http://500startups.com/about\">500 Startups</a> fund have around 15% female founders in their 120+ strong portfolio. We are also seeing the rise of women run funds such as Cynthia Padnos’s <a href=\"http://www.illuminate.com/about/\">Illuminate Ventures</a> and funding support programmes like <a href=\"http://www.astia.org/content/view/370/794/\">Astia</a>, led by Sharon Vosmek and Simone Brummelhuis.\n\nTechnology certainly seems to be a market-leader when it comes to women’s businesses, and I’ll be watching with interest to see how future generations flourish in the business world. Women are also showing astronger representation, and indeed initiative, online, with the phenomena of ‘mummy bloggers’ sweeping the western world. Whole networks and communities are taking off, creating a movement of real significance to women’s lives, that’s something we’re looking to encourage with our intuitive tools. It’s there in the Gen X culture too, with 75% more girls blogging and publishing than boys. My daughter is 3 but is more proficient on an iPad than I am!\n\nFrom what I’m seeing and experiencing first hand in the tech industry, and even in wider business industries, I feel like there’s a real rising opportunity and resonance for women to express their passions and knowledge, creating businesses which lead on a national and international scale.",
    "type": "post",
    "path": "/2011/06/22/never-been-a-better-time-for-women-entrepreneurs/"
}