{
    "title": "One Ridiculously Good-Looking Conference: Warm Gun 2012  ",
    "slug": "one-ridiculously-good-looking-conference-warm-gun-2012",
    "date": "2012-12-13T02:04:44.000Z",
    "url": "http://500.co/?p=1116724405",
    "uri": "http://500.co/2012/12/12/one-ridiculously-good-looking-conference-warm-gun-2012/",
    "postId": "1116724405",
    "description": "",
    "images": [
        "https://lh6.googleusercontent.com/js7id93zGS7GQcu2Yd5oB8UiA2qJ4-R8zA8OxXmtR1s6GN3UauiXgFzAI_AhgHjofAcv6X8MYO0nHdUJJyO71CdVSwf4Br6SZdODq2r3ogzE-9_KBFs",
        "https://lh4.googleusercontent.com/QWTk74kFYPzNnWoi3y8TIasHakHVo9Tl7EsyIHtgCBTAzaVVDUrBVYI3-sl5U7OUroYs4iBOhYl_2PTKuT7B9iZ3-kuBQj7TdhdHOSBL21s3AAn63F4",
        "https://lh5.googleusercontent.com/_CUl3egw-CEqZ8t5EkIRpkCTTHJj9cs4EUrlm6Po2pugU9Me-OFQmxhKKmO6v1pamf8UiiAwhIqXdMjBn9FM3ZBVHf0epG7UOcs_rynolmL_hQjPpKY",
        "https://lh4.googleusercontent.com/_QbIpMjXty3WlS4Bb6nuJ3CDqoZ34GeCXu5Ywe1EXuA0SsJKHf2cj5Wp7benjAFW3q26CoTyAnGIXQp3S-Qjjh4QBc3wZGOecsuXogpHErxgLZyu4U0",
        "https://lh4.googleusercontent.com/QbaEgA2oLBoI_hTXJnwwV-4OPIN7_T0McFt3sqXzUnPO7CGTcyEgcXR2OrJ4tBm9pPaWMVymZIhW8du524hMLrL74ZixRhL4IlZeklzGmtGN2qbOlPo"
    ],
    "creator": "",
    "categories": [
        "conference",
        "design",
        "design",
        "event",
        "events",
        "warm-gun"
    ],
    "content": "If you didn't make it to <a href=\"http://warmgun.com/\">Warm Gun</a> a few weeks back, you missed out. Our one-day conference was packed with some of the most notable names in design—like Warby Parker, Airbnb, Hotel Tonight and YouTube—and had one of the best looking crowds we've ever seen at a conference. Seriously. It's almost like designers are concerned with appearances or something.\n\nIt'd be pretty difficult to provide a rundown of all the content since there just was so much of it packed into one day. So to give you quick recap of some of the key takeaways, here are some of our favorite <a href=\"https://twitter.com/search?q=%23warmgun&amp;src=typd\">#WarmGun</a> tweets:\n\n<a href=\"https://twitter.com/warmgundesign/status/274564375753400320\" target=\"_blank\"><img alt=\"\" src=\"https://lh6.googleusercontent.com/js7id93zGS7GQcu2Yd5oB8UiA2qJ4-R8zA8OxXmtR1s6GN3UauiXgFzAI_AhgHjofAcv6X8MYO0nHdUJJyO71CdVSwf4Br6SZdODq2r3ogzE-9_KBFs\" width=\"501px;\" height=\"173px;\" /></a>\n\nIn typical Dave McClure fashion, Dave kicked off the day with a rousing, slightly (ok, very) inappropriate presentation. One major theme he touched upon is the fact that design is in high demand—and that designers should own their place in the startup ecosystem by kicking ass instead of sucking. He emphasized that users are still \"getting f-cked,\" by bad design, and that designers have to make sure they're doing more than just building something pretty.\n\nBottom line: Design is a hot field, but always remember to make design more than just beautiful.\n\n<a href=\"https://twitter.com/warmgundesign/status/274565346906750977\" target=\"_blank\"><img alt=\"\" src=\"https://lh4.googleusercontent.com/QWTk74kFYPzNnWoi3y8TIasHakHVo9Tl7EsyIHtgCBTAzaVVDUrBVYI3-sl5U7OUroYs4iBOhYl_2PTKuT7B9iZ3-kuBQj7TdhdHOSBL21s3AAn63F4\" width=\"501px;\" height=\"174px;\" /></a>\n\nThis was another great quip from Dave's opening remarks. Yes, mobile's big, but people often forget that users are still interacting with content and applications through the web, too. If you care about users, your application should be fast from everywhere. Making a speedy iPhone 5 app shouldn't be your startup's only (or most important) goal.\n\n<a href=\"https://twitter.com/Chardot/status/274577084452593664\" target=\"_blank\"><img alt=\"\" src=\"https://lh5.googleusercontent.com/_CUl3egw-CEqZ8t5EkIRpkCTTHJj9cs4EUrlm6Po2pugU9Me-OFQmxhKKmO6v1pamf8UiiAwhIqXdMjBn9FM3ZBVHf0epG7UOcs_rynolmL_hQjPpKY\" width=\"502px;\" height=\"179px;\" /></a>\n\nBJ Fogg, Stanford innovator and psychologist, gave an extremely insightful presentation about user behavior—and how it's a designer's job to help the user do what they already want to do. He pointed out an important, yet not-so–obvious fact: most designers don't even know the basics when it comes to human behavior.\n\nAn understanding of psychology is an intrinsic part of good design, so get started by <a href=\"http://www.behaviormodel.org/\">Reading up on BJ Fogg's behavior model</a>. Too many designers forget who they're designing for: humans.\n\n<a href=\"https://twitter.com/warmgundesign/status/274592927588679681\" target=\"_blank\"><img alt=\"\" src=\"https://lh4.googleusercontent.com/_QbIpMjXty3WlS4Bb6nuJ3CDqoZ34GeCXu5Ywe1EXuA0SsJKHf2cj5Wp7benjAFW3q26CoTyAnGIXQp3S-Qjjh4QBc3wZGOecsuXogpHErxgLZyu4U0\" width=\"508px;\" height=\"144px;\" /></a>\n\nMark Hemeon, Senior UX Designer at YouTube, gave one of the most energetic and interesting talks of the day. Titled, \"Get Over Yourself,\" his presentation covered everything from designers' egos to surfing in Mexico and even car explosions. Yes, really.\n\nThe quote above really resonated with the crowd and people who were following along via social media—it was one of the most retweeted and liked quotes from the entire conference. If you're a creative type, it's incredibly easy to endlessly criticize someone else's work. Get over yourself: stop providing input and start doing.\n\n<a href=\"https://twitter.com/warmgundesign/status/274612031917793281 \" target=\"_blank\"><img alt=\"\" src=\"https://lh4.googleusercontent.com/QbaEgA2oLBoI_hTXJnwwV-4OPIN7_T0McFt3sqXzUnPO7CGTcyEgcXR2OrJ4tBm9pPaWMVymZIhW8du524hMLrL74ZixRhL4IlZeklzGmtGN2qbOlPo\" width=\"495px;\" height=\"176px;\" /></a>\n\nTwitter co-founder, Evan Williams, made an astute observation about how the web has changed since the days of AOL Keywords and Geocities. Good design isn't an \"extra\" anymore. People now expect things to be beautiful and \"just work.\"\n\nWe're a generation that's grown accustomed to things like Apple products and Pinterest—in other words, we don't put up with bad user experiences. If your startup tries to put design out there that's sub-par, you'll fail.\n\nThese are just a few of the great insights our star-studded lineup shared with attendees. Some of the other topics our presenters covered included analytics, customer-focused design and designing for multiple screen sizes. And don't forget that the conference ended with Dave McClure interviewing Caterina Fake about being an investor, tech outside of Silicon Valley and what she thinks the major trends going into 2013 will be.\n\nTo watch videos of all the presentations, head over to our <a href=\"http://livestream.com/500startups\" target=\"_blank\">Livestream page</a>. You can even follow along with the presentation slides available over at <a href=\"http://www.slideshare.net/500startups\" target=\"_blank\">SlideShare</a>.\n\nA big thank you to all the sponsors who made the event (and awesome afterparty) possible! We look forward to seeing everyone again at Warm Gun 2013. <strong id=\"internal-source-marker_0.9364547750446945\">\n</strong>",
    "type": "post",
    "path": "/2012/12/12/one-ridiculously-good-looking-conference-warm-gun-2012/",
    "backgroundImage": "/backup/warmgun-2012-12-12-12-20-04.jpg"
}