{
    "title": "One Year as Startup Entrepreneurs: 10 Big Lessons",
    "slug": "one-year-as-startup-entrepreneurs-10-big-lessons",
    "date": "2013-01-24T01:26:22.000Z",
    "url": "http://500.co/?p=1116724949",
    "uri": "http://500.co/2013/01/23/one-year-as-startup-entrepreneurs-10-big-lessons/",
    "postId": "1116724949",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "guest-posts",
        "startups",
        "tips"
    ],
    "content": "<strong><em><a href=\"https://twitter.com/efavilli\" target=\"_blank\">Elena Favilli</a> (left) and <a href=\"https://twitter.com/francescavallo\" target=\"_blank\">Francesca Cavallo</a> (right) are the co-founders of <a href=\"http://timbuktu.me/timbuktu/\" target=\"_blank\">Timbuktu Labs</a>, an award-winning company that focuses on mobile applications for children. They're part of the 500 Startups family and are based in San Francisco. By working at the intersection of design, education and technology, they help parents discover the world with their kids.</em></strong>\n\nA year ago, we got an email announcing we were among the winners of <a href=\"http://mindthebridge.org/\" target=\"_blank\">Mind The Bridge</a>, the most important startup competition in Italy. The award consisted of one month in a startup program in San Francisco and a chance to take part in the final round of Italian Innovation Day at UC Berkeley.\n\nWe remember that morning well. We had been talking a lot about going to California, and all of a sudden we were about to make our journey there.\nSince then, we’ve been through a lot. We moved to San Francisco, we were part of <a href=\"http://www.500.co\" target=\"_blank\">500 Startups’</a> <a href=\"http://500.co/accelerator/\" target=\"_blank\">accelerator program</a>, raised our seed round, won Best Design Award at LAUNCH Education and Kids, built a team and launched a brand new version of Timbuktu. <a href=\"https://itunes.apple.com/app/timbuktu/id428469245?mt=8\" target=\"_blank\">If you don't have it on your iPad, you should get it now!</a>\n\nWe made many mistakes and, thankfully, learned from them. Here's a shortlist of the 10 biggest lessons we learned.\n\n<strong>1 - Just Do It.</strong>\n\nBuilding a startup is hard, especially when you're a perfectionist. There's always a slide that could look better, some data to add, or a feature that's still missing. But if you wait for everything to be as clear as water, you’ll never have a product.\n\n<strong>Instead of thinking about what you want to do, just start. Meeting customers and investors will help you better understand your product and market.</strong> If you wait too long, you won't get precious feedback that will help you improve, and you'll fail before starting.\n\n<strong>2 - You Have a Dream. Tell People about It.</strong>\n\nDon't ever be afraid of speaking your heart out about your startup. By repeating your story, you'll get better at telling it, which will help you attract investors. <strong>Fundraising isn’t just about business plans – it's also about telling a story that people want to believe in.</strong> How did you and your co-founder meet? How did you come up with the idea? Why is your product going to change the world?\n\nUsually, angel investors don’t base their decision purely on results and data. Since data is often partial or incomplete at an early stage, they’ll look at your team and story. <strong>Ultimately, people invest in your story, your passion, and the fire they see in your eyes.</strong>\n\n<strong>3 - Build Relationships.</strong>\n\nDo this with customers, but also with other startups. Promptly reply to people who email you. Be open to their advice and requests, even when they're demanding. <strong>If you make your customers feel like they’re part of what you're building, they'll become your advocates.</strong>\n\nIt's the same with investors, present or potential. Respond quickly and be open to feedback, and keep them up to date with your results. Once again, practice storytelling. Everyone loves to feel like they’re part of a great adventure.\n\n<strong>4 - Break the Rules.</strong>\n\nDon’t stay within the lines. Rules are made to be broken. Try to make those rules better, and don't give up when you hear “no.” <strong>If you're disrupting a market, you'll get many “no’s.”</strong> Get used to it. Be prepared to fight for what you think is right.\n\n<strong>5 - Don't Ever Think You’ve Made It.</strong>\n\nIt's cool to be happy for an article in a newspaper, for an award, or for closing an investment. Nevertheless, to build something that can change the world, you need to dream big. <strong>It’s great to close a seed round, but at that point you’ve only just started.</strong>\n\nWe spend 14/15 hours per day trying to understand how to change the face of digital publishing for kids. And we won't be happy until we do it. There’s a lot of work to be done if you want to make your dream a reality, so don’t ever rest on your laurels.\n\n<strong>6 - Question Yourself.</strong>\n\nIt’s easy to fall into the average company mindset. As soon as you get a bit of success, you’ll stop feeling the need to reply to emails from people you consider below your level. Or even worse, you start acting like you’re an expert. All of this stops your growth before it's even started!\n\n<strong>Always be open to exchanges. Keep questioning yourself, no matter how successful you are.</strong>\n\n<strong>7 - Learn to Say No.</strong>\n\nThis one of the hardest things to do since a startup is hardly in a position of strength, and in most cases it faces 6 to 8 months where it has to prove itself. But the skill of saying no is fundamental. <strong>You need to learn to say no to the offers that could bring you money immediately, but will distract you from your core business.</strong>\n\nSay no to investment offers that are too much in favor of the investors. Say no to those who believe they can always set the rules. It may seem incredible, but <strong>being able to say no not only helps you stay focused on the most important goals, but will also earn you the respect of the people you work with.</strong>\n\n<strong>8 - Set Short-Term Goals.</strong>\n\nInvestors like long-term projections, but f<strong>or a startup, the most important results are those that can be measured short-term.</strong> And you’re not a startup unless you grow week by week (Paul Graham <a href=\"http://paulgraham.com/growth.html\" target=\"_blank\">wrote a beautiful post about this</a>).\n\nThings changed for us when we started setting goals that we could measure every week. Accomplishing short-term goals will buy you the time you need to demonstrate you can achieve things in the long term.\n\n<strong>9 - Build a Team.</strong>\n\nThink like a team. Build great relationships with the people you work with. Never get tired of explaining your choices, and don't be afraid to look vulnerable or to lead.\n\n<strong>Surround yourself with talented, trustworthy people, and most importantly, don't feel threatened by other people's talent.</strong> If you instinctively put a capable colleague in a corner, ask yourself why. If the reason is fear, find a way to resolve it.\n\n<strong>Talent is rare and must be cherished. It's one of the most important ingredients to win the startup game.</strong>\n\n<strong>10 - Have Fun.</strong>\n\nThe stakes are high, but <strong>don't let you responsibilities crush you</strong>; being an entrepreneur is a lot of hard work, but don’t forget to have fun, too. Otherwise you'll get stuck in a job you don't like – and you won't even have your boss to blame for it.",
    "type": "post",
    "path": "/2013/01/23/one-year-as-startup-entrepreneurs-10-big-lessons/",
    "backgroundImage": "/backup/franelena2-2013-01-23-13-19-26.jpg"
}