{
    "title": "Pizza And Ramen Are Hurting Your Startup",
    "slug": "pizza-and-ramen-are-hurting-your-startup",
    "date": "2011-01-06T07:54:42.000Z",
    "url": "http://blog.500startups.com/?p=1116714704",
    "uri": "http://500.co/2011/01/06/pizza-and-ramen-are-hurting-your-startup/",
    "postId": "1116714704",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/01/lion-o-150x150.jpg",
        "http://500.co/wp-content/uploads/2011/01/brendenmulligan-150x150.png",
        "http://500.co/wp-content/uploads/2011/01/chicken-veggies-300x224.jpg"
    ],
    "creator": "",
    "categories": [
        "brenden-mulligan",
        "guest-posts",
        "health",
        "lion-o",
        "mentors",
        "nutrition",
        "recipes",
        "tips"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/01/lion-o.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714708\" title=\"lion-o\" src=\"/backup/lion-o-150x150-2011-01-06-11-01-54.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2011/01/brendenmulligan.png\"><img class=\"alignnone size-thumbnail wp-image-1116714709\" title=\"brendenmulligan\" src=\"/backup/brendenmulligan-150x150-2011-01-06-11-01-54.png\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet Lion-O aka SuperMentor Brenden Mulligan (<a href=\"http://twitter.com/bmull\" target=\"_blank\">@bmull</a>). Brenden is the founder of <a href=\"http://www.artistdata.com/us/\" target=\"_blank\">ArtistData</a>, a music industry startup that enables artists to easily keep their content up-to-date across multiple marketing channels and consumer touch points. ArtistData was acquired in May 2010 by Sonicbids, a marketplace that connects hundreds of thousands of musicians with opportunities to play mega-festivals like SXSW, CMJ and thousands more, where Brenden is currently VP of Strategic Development.</em>\n\nThe typical stereotype of an startup environment is a bunch of kids sitting around living off of pizza and ramen noodles. It makes sense because that food is quick and cheap and entrepreneurs don't have enough time and money.\n\nHere's a New Year's resolution for you: Put down that slice of pizza. Don't heat up that Cup O' Noodles. <strong>Stop putting all that crap in your body. </strong>Your startup will be better for it.\n\nWhy?\n\nThe biggest reason is by only fueling your body with shit, you're also fueling your brain with shit. If you improve your diet, you will improve you work, and in the end, your startup. You'll sleep better, be better rested, and use your time more effectively when you're awake.\n\nAnother big reason is that the majority of startup events you're going to (and you should be going to a lot) also serve all that crap. Eat it then, but try not to eat it when you're at the office working.\n\nI know you're probably thinking that eating healthy is too expensive, and again, startups don't have any money. But in reality, you can easily make eating healthy affordable. Here's one (of many) simple ways:\n\nGo to a farmers market or local produce stand (NOT Whole Foods) and buy a bunch of rich, colorful vegetables - bell peppers, zucchini, squash, onions, carrots, baby bok choy, and whatever else you like. Get as many different colors as you can. You can probably get vegetables for 5 meals for about $10-15. Then go to a store and get 3 cans of low sodium beans (about $1 per can) and 5 boneless/skinless chicken breasts ($1-3 per breast).\n\nTotal: $18-33 for 5 meals. <strong>$4-7 per meal</strong>. Not expensive and probably about the same price as a fast food meal.\n\nPrep is easy. Here's the simplified directions:\n<ol>\n\t<li>Steam or saute a couple handfuls of chopped vegetables with some oil until soft.</li>\n\t<li>Saute or grill a chicken breast with some oil, salt, and pepper.</li>\n\t<li>Heat the beans in a sauce pan (even better with some parsley or cilantro leaves and chopped scallions).</li>\n\t<li>Put it on a plate and eat it. Then get back to work.</li>\n</ol>\n<a href=\"http://500.co/wp-content/uploads/2011/01/chicken-veggies.jpg\"><img class=\"alignnone size-medium wp-image-1116714716\" title=\"chicken-veggies\" src=\"/backup/chicken-veggies-300x224-2011-01-06-11-01-54.jpg\" alt=\"\" width=\"300\" height=\"224\" /></a>\n\nThere! You've just cooked an incredible healthy meal for about $5 that will keep you feeling full all day. You can make this in bulk at the beginning of the week and heat some of it up each day. To give it some varied flavor, find spices or sauces you like and add when heating. Next week, choose different veggies. Or use lean beef instead of chicken. Or a different kind of bean. Or a different marinade.\n\nAnd stop drinking soda all day. Instead, drink twice as much water as you do now. The constant pee breaks will be a good chance to stretch your legs and take a break from your computer.\n\nAs a note, I love unhealthy food. It's delicious and I'm not saying it's evil. I'm just saying it's not a productive addition to a 14-hour, high stress work day. I constantly try to make sure the majority of meals I'm eating don't make me want to take a nap afterwards. Especially lunches.\n\nGot an easy recipe to share? Share it via leaving a comment on this blog post.",
    "type": "post",
    "path": "/2011/01/06/pizza-and-ramen-are-hurting-your-startup/"
}