{
    "title": "Announcing Rainbow Round – A Monthly Series of Inspiring Talks from LGBT People in Tech",
    "slug": "rainbow-round",
    "date": "2014-02-28T15:05:03.000Z",
    "url": "http://500.co/?p=1116731639",
    "uri": "http://500.co/2014/02/28/rainbow-round/",
    "postId": "1116731639",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "announcements",
        "events",
        "family",
        "galvanize",
        "kortney-ryan-ziegler",
        "lgbt",
        "rainbow-round",
        "startout",
        "transh4ck"
    ],
    "content": "<p dir=\"ltr\">I’ve been at 500 for just over a year now. One of the things that first drew me to 500 is how many different kinds of people are in our #500Strong community of 1000+ founders, 600+ companies, and 200+ mentors. A huge part of what make makes this place so great is how all these different people come together to share knowledge, support each other, and learn from each other’s mistakes.</p>\n<p dir=\"ltr\">LGBT founders, employees, and mentors, are an incredibly important part of the 500 family.  Last fall, we held our first LGBT meetup in Mountain View to invite some of our founders to share their startup stories. It was a huge success, so we decided to go even bigger in 2014. We’re launching a monthly speaker series called Rainbow Round where LGBT founders, employees, investors, and others will give inspiring talks about what they do in tech.</p>\n<p dir=\"ltr\">We’re proud to have <a href=\"https://twitter.com/fakerapper\">Kortney Ryan Ziegler</a>, founder of <a href=\"http://www.transhack.org/\">Transh4ck</a>, join us as our inaugural Rainbow Round speaker. Like Kortney, we think there’s a lot of work to be done in tech (and the LGBT community) around transgender acceptance, education, and support. Following his talk, there will be drinks, food, and networking. You can <a href=\"http://www.rainbowround.com\" target=\"_blank\">register here.</a></p>\n<p dir=\"ltr\">We’ve partnered with two great organizations to make Rainbow Round happen: <a href=\"http://startout.org/\">StartOut</a>, a nonprofit organization dedicated to creating great business leaders by fostering Lesbian, Gay, Bisexual, and Transgender entrepreneurs, and <a href=\"http://galvanize.it\">Galvanize</a>, a tech entrepreneurial eco-system that incorporates capital, curriculum, and community.</p>\n<p dir=\"ltr\">At future talks, we'll bring in startup founders, big names in Venture Capital, and leaders from other tech companies and organizations to tell us about what they’re working on. Register for our first talk on 3/19, and follow <a href=\"https://twitter.com/rainbowround\">@RainbowRound</a> on Twitter for updates about future events. If you’d like to nominate someone to speak at our next event, just send me email at mark@500.co</p>\n<p dir=\"ltr\">I think this will be a great way for us to highlight all the amazing work the LGBT people are doing in our industry, while also providing a space for entrepreneurs to meet, share ideas, and help each other. We hope to see you at our first event!</p>",
    "type": "post",
    "path": "/2014/02/28/rainbow-round/",
    "backgroundImage": "/backup/rainbow-960x540-2014-02-28-14-09-05.png"
}