{
    "title": "Scaling Venture Capital? We suck. We can do better.",
    "slug": "scaling-venture-capital",
    "date": "2012-04-06T15:59:08.000Z",
    "url": "http://500.co/?p=1116719663",
    "uri": "http://500.co/2012/04/06/scaling-venture-capital/",
    "postId": "1116719663",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/04/SomethingVentured-232x300.jpg"
    ],
    "creator": "",
    "categories": [
        "startups",
        "venture-capital"
    ],
    "content": "<a href=\"http://www.somethingventuredthemovie.com/\"><img class=\"alignleft size-medium wp-image-1116719688\" title=\"Something Ventured\" src=\"/backup/SomethingVentured-232x300-2012-04-06-12-10-59.jpg\" alt=\"\" width=\"232\" height=\"300\" /></a>\n\nI'm kind of embarrassed to call myself a <a href=\"http://en.wikipedia.org/wiki/Venture_capital\" target=\"_blank\">Venture Capitalist</a>.\n\nIn fact, most of us who call ourselves VCs should be too.\n\nWhy? Because MOST of us are hypocrites, and have NO idea what we're doing.\n\n<strong>Because we SUCK at EXACTLY the thing we're supposed to help entrepreneurs do -- build BIG, SCALABLE companies.</strong>\n\nBecause MOST of us aren't engineers. Because MOST of us aren't designers. Because MOST of us aren't internet marketers. Because MOST of us haven't built a customer support team or run 24x7x365 network operations centers.\n\nAnd yet... MOST venture capitalists seem to think we know EXACTLY what we're doing when we tell our founders who ARE engineers, designers, &amp; marketers what to do.\n\nWe tell them what they should be doing in order to build BIG, SCALABLE companies that can (hopefully) make us lots of money.  And yet, MOST venture capitalists SUCK at building BIG, SCALABLE venture capital firms... well, at least MOST of us, anyway.\n\n<em>Let me explain.</em>\n\nWhen i was leaving PayPal in 2004, i started doing some angel investing. i really had no idea what the hell i was doing (that may still be true), but due to the good fortune of working at PayPal for a few years, i had a little bit of money in my pockets. and since i knew even less about real estate than i did about startups, rather than blow it all on a big mortgage ahead of the housing crisis, i ended up investing ~$300K over the next four years in a baker's dozen of young companies. about 5 years later, i got my first meaningful exit <a href=\"http://techcrunch.com/2009/09/13/intuit-to-acquire-former-techcrunch50-winner-mint-for-170-million/\">when Mint.com was acquired by Intuit</a>, and i made ~10x on a $25K investment. i made a few other investments that seem to be doing well (SlideShare, Mashery, KissMetrics, etc), and i was an advisor for a few companies that also got acquired (Bix, Jambool) where i made some money on advisor stock options.  overall, i was probably more lucky than good, but regardless it seems i didn't lose my shirt playing amateur investor while i figured out what it is that investors do.\n\nmaybe i'm better off lucky than good -- i'm still not sure i've learned much in the past 3-4 years of \"professional\" investing at 500 Startups &amp; Founders Fund, or in my previous 4-5 years of UNprofessional investing (arguably, all of my investing could be described that way, and in fact has been by some folks in the past). but good or bad, we've made investments in over 250 companies in the last 24 months, and maybe 10-20% of them will survive to adulthood.\n\nbut one thing i've learned in the past 20+ years i've spent in Silicon Valley as an engineer, entrepreneur, marketer, and investor -- <strong>building BIG, SCALABLE companies is hard</strong>. and, it doesn't happen very often.\n\ni've failed miserably several times trying to do it myself as a founder; been fortunate enough to be along for the ride as Max &amp; Peter &amp; others at PayPal successfully beat the odds to build a pretty darn big company that went public and later got acquired by even bigger eBay. and i consider myself lucky to have witnessed several other big success stories founded by some friends and other folks i've gotten to know over the years -- <strong>LinkedIn, YouTube, Yelp, Facebook, Twitter, Zynga, LivingSocial, Yammer, DropBox</strong>, etc.  i certainly haven't walked in their shoes, but i've been humbled to watch them grow from small startups into HUGE companies, and continue to be amazed at what can be accomplished by innovative, driven founders and their employees.\n\nso here's the thing...\n\n<strong>Q: how many VCs have done the same with their own VC firms?</strong>\n\nhow many VCs are there that have successfully grown from a few partners into BIG, HUGE companies with HUNDREDS if not THOUSANDS of people operating all over the world?  where is the Google of VC firms? the Facebook of VC firms? the Apple of VC firms? why hasn't this happened yet? why aren't there VCs that invest in HUNDREDS if not THOUSANDS of companies every year?\n\naside from DFJ &amp; Ron Conway in the 90's, and Y Combinator &amp; Tech Stars more recently, i'm not sure anyone has even tried. there a few global firms that operate in multiple geographies like Accel &amp; Sequoia. and i've been impressed with what First Round Capital has done ramping up seed-stage investing. and it certainly seems like Andreessen-Horowitz is trying to rethink how VC operates at scale.  the Samwer brothers in Germany may not be well-liked, but they have been able to duplicate big successes rapidly. and Jeremy Berrebi in Europe is similar to our own 500 model of lots of little bets. still, at the moment the closest to what \"big, scalable\" VC looks like is probably either Y Combinator or Angel List... kudos to PG &amp; Naval, they are taking risk, innovating, &amp; putting it all out there.\n\nand yet: the modern venture capital model has been around for perhaps 30-50 years, but we still haven't quite seen the Henry Ford of venture capital.\n\n<strong>we can do <a href=\"http://www.somethingventuredthemovie.com/\">better</a>.</strong>\n\n&nbsp;\n\n&nbsp;\n\n&nbsp;",
    "type": "post",
    "path": "/2012/04/06/scaling-venture-capital/"
}