{
    "title": "Seedcamp vs. 500",
    "slug": "seedcamp-vs-500",
    "date": "2012-08-14T22:46:36.000Z",
    "url": "http://500.co/?p=1116721583",
    "uri": "http://500.co/2012/08/14/seedcamp-vs-500/",
    "postId": "1116721583",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/08/vs.jpg"
    ],
    "creator": "",
    "categories": [
        "500-startups",
        "accelerator",
        "accelerator",
        "guest-posts",
        "markets",
        "seedcamp",
        "startups"
    ],
    "content": "This post is by <a title=\"https://twitter.com/Andycru_mp\" href=\"https://twitter.com/Andycru_mp\">Andrew Crump</a>, co-founder of <a title=\"http://bluefields.com/\" href=\"http://bluefields.com/\">Bluefields</a>. Bluefields' app allow you to get your sports teams together without the hassle. They were part of our 4th accelerator batch. Follow them on twitter <a title=\"https://twitter.com/bluefieldscom\" href=\"https://twitter.com/bluefieldscom\">here</a>.\n<strong>\nWhy would any startup decide to be in two accelerator programs at the same time?</strong>\n\n<strong>We get asked the question a lot. Are we deranged, misguided; do we simply not care about equity dilution; or are we so lacking in confidence that we feel we need the warm fuzzy comfort blanket of an accelerator ecosystem to be able to achieve greatness?</strong>\n\nNo, to all of the above; but actually we think we have made quite a clever decision. You see, Seedcamp and 500 are two very different beasts in two very different geographies. Not all accelerators are created equal.\n<p style=\"text-align: center;\"><a href=\"http://500.co/2012/08/14/seedcamp-vs-500/vs/\" rel=\"attachment wp-att-1116722067\"><img class=\"aligncenter  wp-image-1116722067\" title=\"vs\" src=\"/backup/vs-2012-08-14-12-17-46.jpg\" alt=\"\" width=\"392\" height=\"302\" /></a></p>\n\n<h2><strong>Seedcamp vs 500: Fight!\n</strong></h2>\n<strong>Well… Actually they get on rather swimmingly. It’s a little known fact that Seedcamp and 500 are indeed <a href=\"http://go.toutapp.com/10wt63ppt\" target=\"_blank\">partners</a>; we heard a rumor it all started after a boozy night in <a href=\"http://go.toutapp.com/cq2qdrgc0\" target=\"_blank\">St Stephens Green</a> when they ended up sneaking off together early (but we are not ones to spread rumours).</strong>\n\nSo what does this all mean? Well for Seedcamp companies it means that 500 can be a great soft landing in the US (and all the increased valuation/market trappings that US brings) and for 500 Startups it means access to the hottest European Startups.\n\nThere are a lot of similarities. Same money, massive signal, access to awesome mentor networks, access to investors and big validation, but there are also big differences between them. There are some obvious ones that you know already (residential vs non-residential, US vs EU, $50m fund vs €5m fund) but that’s not why we did both.\n<h2><strong>Both markets?\n</strong></h2>\n<strong>For us (a Euro-US startup) the decision to take them both was an easy one. There are some big differences between the startup landscape in the US and the UK and we wanted to make sure we could leverage the best of both worlds.</strong>\n\nWe spent last winter building and launching a product for the UK football market. It allowed us to prove some key metrics, but we have much bigger aims than the UK football market. Seedcamp’s investment in Bluefields was a massive signal to the world that we weren’t just content with making the [playoffs/knockout stages] (delete as appropriate for your region) but that we had [Superbowl/Cup Final] (again, delete as appropriate) ambitions.\n<blockquote>Along the way we found our way into the only tall building in Mountain View and got to talk to the one and only Mr. McClure.</blockquote>\nThose ambitions meant we needed to get to the US sooner rather than later. We needed to make sure we found the secret sauce for the US market too. Up steps the <a href=\"http://go.toutapp.com/aedcje99r\" target=\"_blank\">Seedcamp America Trip</a> (another little known gem of the Seedcamp deal). One intense month of VC offices, flights, hotel rooms, pitch events, tech startup, laptop stickers and foursquare checkin competitions. Along the way we found our way into the only tall building in Mountain View and got to talk to the one and only Mr. Mcclure.\n\nBefore we knew it we had an offer to come spend 4 months in the Valley, working with some of the brightest minds in the US and and making sure we get Bluefields working in the US too.\n<h2><strong>Product-Market Fit.\n</strong></h2>\n<strong>We all know a <a href=\"http://go.toutapp.com/7bjqg4eny\" target=\"_blank\">Startup is not a business</a> (if you didn’t know, you do now – consider yourself enlightened). A startup is instead an entity that is trying to make a business, it is looking for the keys to scale.</strong>\n\nIn fact most startups (the ones that get into accelerators anyway) can be defined as ‘Scalable Startups’. That is, that their goal is to find a business model that scales to large revenue.\n\nAnd so we stumbled upon the point of accelerators. Accelerators allow startups to work in an environment that is conducive to finding that scalable model, and stage one is finding product-market fit.\n\n<em>‘But you inferred you had already cracked it’</em> – you mutter.\n<em>‘Yes but only in the UK and we want to own the US too’</em> – we retort.\n\n<strong>Q: Why have we decided to be in two accelerators on different sides of the pond at the same time?\n</strong>A: Well (apart from twice the fun) the answer is to find product market fit in the US in the best environment possible.\n\n<strong>Q: Specifically why take 500 after taking Seedcamp?\n</strong>A: Well, when you consider everything; the network, the signal, mentors, investors and the view from the office, there is one thing that clearly stands out…. The weather. Seriously have you been to London? It rains like all the time.\n\nReporting from sunny California, <a href=\"http://go.toutapp.com/3133jxhsz\" target=\"_blank\">Andrew Crump</a>\n<div></div>",
    "type": "post",
    "path": "/2012/08/14/seedcamp-vs-500/"
}