{
    "title": "Sell Your Company, Not Your Soul – Thoughts on Getting Acquired",
    "slug": "sell-your-company-not-your-soul-thoughts-on-getting-acquired",
    "date": "2013-09-05T20:39:58.000Z",
    "url": "http://500.co/?p=1116729589",
    "uri": "http://500.co/2013/09/05/sell-your-company-not-your-soul-thoughts-on-getting-acquired/",
    "postId": "1116729589",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "acquired",
        "acquisitions",
        "guest-posts",
        "sqoot",
        "startups",
        "startups"
    ],
    "content": "<em>The following post was contributed by <a href=\"http://twitter.com/esmomo\" target=\"_blank\">Mo Yehia</a>, co-founder of <a href=\"http://sqoot.com\" target=\"_blank\">Sqoot</a>. This originally appeared at <a href=\"http://MoYehia.com\" target=\"_blank\">MoYehia.com</a>.</em>\n\nI'd dreamed of this day countless times, yet when it came, I didn’t share the news on Facebook, make an unforgettable <a href=\"https://www.youtube.com/watch?feature=player_embedded&amp;v=LjwEfaxM4Bc\">video</a>, high-five teammates or investors, or publish the requisite ‘we got bought’ announcement on TechCrunch.\n\nI got on base with my first exit, but it felt more like an error than a true base hit. While I’m stoked to have delivered value to investors, customers, and Clutch, I expected far more. Here’s what I learned:\n\n<b>Beggars can’t be choosers.</b> We saw a seven figure deal evaporate into thin air because we had no leverage. Buyers toyed with us like a great white toys with a seal prior to devouring it. Ultimately, while most investors made nominal money, others lost big time. Personally, I didn’t make Maserati money, but maybe enough for a tricked-out, year-old Accord.\n\n<b>Watch the market like a hawk.</b> We didn’t eat the <a href=\"http://cdixon.org/2012/09/03/the-time-to-eat-the-hors-doeuvres-is-when-theyre-being-passed/\">hors d’oeuvres</a> when they were being passed. The coupon landscape changed quickly and dramatically. There were massive exits and fundraises, but we were always late to the party.\n\n<b>Make money. Pay yourself.</b> We kept our burn low and ended up burning ourselves out. We served a lot of customers at an unsustainable price point. My co-founder and I amassed tens of thousands of dollars of debt, not to mention legal fees that rivaled the average American’s salary. Financially, I was better off in investment banking, despite an implied hourly wage equivalent to that of a McDonald’s manager. I’m not lovin’ it.\n\n<b>Relationships trump revenue.</b> I alienated investors, family, and friends. I emailed them when in need and neglected them otherwise. My relationship with my co-founder will never be the same as it was. There was no yelling or fist fighting, but I miss the old days.\n\n<b>Be hyper focused.</b> The coupon space was frothy as we entered the market. We wasted time and energy on a few pipe dreams that didn’t pan out as expected. Instead of re-focusing on customers, I chased partnerships and profit like Gollum chased the ring. These distractions were hardest on our customers. They got the shaft and were lost in the shuffle.\n\n<b>Listen unconditionally.</b> I mostly ignored the teams’ grumblings, and when I noticed it was too late. We didn’t communicate about the things that really mattered. From the beginning, it was unclear why we were in this. We never stopped to ask, “what do we really want to work on?” Eventually, when we did, enthusiasm waned and attention scattered. When things got tough our bonds didn’t endure.\n\nUltimately, these were lessons of inexperience. When the deal closed, only one person, my lawyer, called to congratulate me. Billable hours for sure. I treated myself to a gourmet donut and full day Law and Order marathon. I called a dozen friends to apologize for being a dick. To my chagrin, most didn’t return my call. And now, I’m doing it all over again with <a href=\"http://www.getsidewalk.com/\">Sidewalk</a>.\n\nIs this what it’s like to sell your company? To better mistakes next time.",
    "type": "post",
    "path": "/2013/09/05/sell-your-company-not-your-soul-thoughts-on-getting-acquired/",
    "backgroundImage": "/backup/cookie1-2013-09-05-13-15-39.png"
}