{
    "title": "Serendipity: A View From SXSW",
    "slug": "serendipity-a-view-from-sxsw",
    "date": "2011-03-21T23:31:02.000Z",
    "url": "http://blog.500startups.com/?p=1116715117",
    "uri": "http://500.co/2011/03/21/serendipity-a-view-from-sxsw/",
    "postId": "1116715117",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/03/phoenix_jeangrey-216x300.jpg",
        "http://500.co/wp-content/uploads/2011/03/wendytanwhite1.jpg",
        "http://500.co/wp-content/uploads/2011/03/LSU-Party-Moonfruit-Stickers-300x200.jpg",
        "http://500.co/wp-content/uploads/2011/03/Lean-Startup-Flyer-200x300.jpg",
        "http://500.co/wp-content/uploads/2011/03/Moonfruit-Homepage-Apple-300x187.png",
        "http://500.co/wp-content/uploads/2011/03/LSU-Party-WTW-and-Crowd-300x200.jpg",
        "http://500.co/wp-content/uploads/2011/03/LSU-Party-Dave-Design-Control-Freak-300x210.jpg",
        "http://500.co/wp-content/uploads/2011/03/LSU-Party-Mark-and-Steve-Blank-300x210.jpg",
        "http://500.co/wp-content/uploads/2011/03/LSU-Party-Eirik-Wendy-Enrique-200x300.jpg"
    ],
    "creator": "",
    "categories": [
        "austin",
        "events",
        "guest-posts",
        "lean-startup",
        "mentors",
        "moonfruit",
        "sxsw",
        "sxsw-2011",
        "wendy-tan-white"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/03/phoenix_jeangrey.jpg\"><img class=\"alignnone size-medium wp-image-1116715133\" title=\"phoenix_jeangrey\" src=\"/backup/phoenix_jeangrey-216x300-2011-03-21-11-17-31.jpg\" alt=\"\" width=\"216\" height=\"300\" /></a> <a href=\"/backup/wendytanwhite1-2011-03-21-11-17-31.jpg\"><img class=\"alignnone size-full wp-image-1116715134\" title=\"wendytanwhite\" src=\"/backup/wendytanwhite1-2011-03-21-11-17-31.jpg\" alt=\"\" width=\"200\" height=\"200\" /></a>\n\n<em>Meet Phoenix (Jean Grey) aka 500 SuperMentor <a href=\"http://500startups.com/profile.php?id=105\" target=\"_blank\">Wendy Tan-White</a>. Wendy is Founder of <a href=\"http://www.moonfruit.com\" target=\"_blank\">Moonfruit</a>, a simple and powerful website builder for SMBs who expect better design tools to produce better designed sites. Moonfruit was founded in 1999, survived the Dotcom crash in 2000 and made a rapid resurgence in 2009. Wendy was Marketing Director of Gandi Group, helped start-up Zopa.com - first European P2P lending site and Egg.com - first UK internet bank. She sold her soul to Arthur Andersen after getting a BEng Computer Science from Imperial College, London. Wendy's also a designer for fun and has a MA in Smart Textiles from Central St Martins and is the mum of Josh and Bella!</em>\n\n<em> </em>\n\n<em> </em>\n\n<em>\n\n[caption id=\"attachment_1116715131\" align=\"alignnone\" width=\"300\" caption=\"Swag in the form of Moonfruit stickers\"]<a href=\"http://500.co/wp-content/uploads/2011/03/LSU-Party-Moonfruit-Stickers.jpg\"><img class=\"size-medium wp-image-1116715131\" title=\"LSU Party Moonfruit Stickers\" src=\"/backup/LSU-Party-Moonfruit-Stickers-300x200-2011-03-21-11-17-31.jpg\" alt=\"\" width=\"300\" height=\"200\" /></a>[/caption]\n\n</em>\n\n<em> </em>\n\n<em> </em>\n\nIf I had to describe SXSW, or ‘spring break for geeks’ in only one word, it would be ‘serendipitous’. Put your ‘best laid plans’ aside, go with the flow and let it take you where it may.  There’s also a sense of connectedness, both in terms of who you meet in real life – in the bars, restaurants and auditoriums – or virtually through social networks; but also, importantly, in terms of a collective desire to make things happen as witnessed during the unfolding disaster in Japan.\n\nArriving on Friday Eirik, my co-founder and I hit the ground running. Checking in on <a href=\"http://foursquare.com/\">FourSquare</a> upon arrival, notifications of people I haven’t seen for a year flood in and I’m reminded that it was here last year that the tech startup made its name. You’re instilled with a buzz and a feeling that anything can happen here on the warm, breezy streets of Austin, Texas.\n\nMeeting up with Dave McClure, founder of Silicon Valley-based <a href=\"http://500startups.com/\">500 Startups</a>, and a recent investor in <a href=\"http://www.moonfruit.com/\">Moonfruit</a>, we head to a classically Texan BBQ house <a href=\"http://www.ironworksbbq.com/\">Iron Works</a>. We queue canteen-style before dining with different startups; one being the dry and affable Aaron Batalion, co-founder of <a href=\"http://www.livingsocial.com/\">Living Social</a>, one of the biggest group-buying companies in the world, and Jason Putorti, UI design rockstar previously from <a href=\"http://www.mint.com/\">Mint</a> and now <a href=\"https://www.votizen.com/\">Votizens</a>.\n\nIt was whilst sat chatting to someone at a penthouse party in the hookah lounge that ‘kismet’ played its part once more. If you had asked me on arrival to choose the one dream partner I hoped to meet at SXSW - then it would have been this person. To stumble upon them was short of miraculous.\n\n[caption id=\"attachment_1116715128\" align=\"alignnone\" width=\"200\" caption=\"Preview of Eric Ries&#39; new Lean Startup book\"]<a href=\"http://500.co/wp-content/uploads/2011/03/Lean-Startup-Flyer.jpg\"><img class=\"size-medium wp-image-1116715128\" title=\"Lean Startup Flyer\" src=\"/backup/Lean-Startup-Flyer-200x300-2011-03-21-11-17-31.jpg\" alt=\"\" width=\"200\" height=\"300\" /></a>[/caption]\n\nSaturday is our big event day, the day I give my talk at <a href=\"http://theleanstartup.com/sxsw/\">Lean Startup track</a>. We’re also co-hosting the after party with <a href=\"http://www.500startups.com/\">500 Startups</a> and Eric Ries. At SXSW most people panel hop, rushing about getting lost between presentations.  The track is unique. Organised by Christen O'Brien and Sheila Goodman at <a href=\"http://www.500startups.com/\">500 Startups</a>, it’s based on <a href=\"http://www.startuplessonslearned.com/\">Eric Ries' philosophy</a> of eliminating waste from startups. The amphitheatre is packed with 300 entrepreneurs, VCs, developers and designers who have made the effort to get off the beaten track; many stay for the whole day. As such, there’s a real feeling of a Lean Startup ‘movement’. We are all part of a bigger vision, with people sharing ideas and making ‘it’ happen.\n\nOne of my heroes, <a href=\"http://steveblank.com/\">Steve Blank</a>, Professor of Entrepreneurship at Stanford, is in attendance, he’s someone I admire as a serial entrepreneur, family man and now educator. He sticks around for my end-of-day speech, where I tell him (and everyone there) Moonfruit’s story.  I discuss the idea of building legendary products – that things are assigned to such a status in history because of the story around them. Rewinding 10 years to <a href=\"http://www.moonfruit.com/\">Moonfruit’s</a> early days, it is important to highlight the failures as much as the hard work which has led us to our comparative success today. Apart from 500 Startups <a href=\"http://techcrunch.com/2011/03/09/500-startups-bites-into-moonfruits-simple-site-builder-for-design-fans/\">recent investment</a> we took a $2.25m series A funding in Sept 2010, and re-launched <a href=\"http://www.moonfruit.com/\">Moonfruit</a> on Wednesday focusing on SMB’s who want to build better designed sites themselves with better designed tools. It’s very much a cathartic process to share our story.\n\n[caption id=\"attachment_1116715126\" align=\"alignnone\" width=\"300\" caption=\"The new Moonfruit!\"]<a href=\"http://500.co/wp-content/uploads/2011/03/Moonfruit-Homepage-Apple.png\"><img class=\"size-medium wp-image-1116715126\" title=\"Moonfruit Homepage Apple\" src=\"/backup/Moonfruit-Homepage-Apple-300x187-2011-03-21-11-17-31.png\" alt=\"\" width=\"300\" height=\"187\" /></a>[/caption]\n\nWe co-host the after-party downtown with <a href=\"http://www.500startups.com/\">500 Startups</a> and Eric Ries.  It’s the culmination to an intense day, with 250 people showing up, and a further 300 on the waiting list who sneak in later. Maverick photographer social media diarist <a href=\"http://www.kriskrug.com/\">Kris Krug</a> covers the event.\n\n[caption id=\"attachment_1116715130\" align=\"alignnone\" width=\"300\" caption=\"Full house for the Lean Startup afterparty!\"]<a href=\"http://500.co/wp-content/uploads/2011/03/LSU-Party-WTW-and-Crowd.jpg\"><img class=\"size-medium wp-image-1116715130\" title=\"LSU Party WTW and Crowd\" src=\"/backup/LSU-Party-WTW-and-Crowd-300x200-2011-03-21-11-17-31.jpg\" alt=\"\" width=\"300\" height=\"200\" /></a>[/caption]\n\nOur new branding on ‘design control freak’ T-shirts and hoodies are a hit! I overhear girls talking in the toilets “Oh, wow that’s a Moonfruit hoodie? I only got a Hashable t-shirt!” <a href=\"http://hashable.com/beta\">Hashable</a>, will be one of the big group introduction apps to come out of SXSW.\n\n[caption id=\"attachment_1116715125\" align=\"alignnone\" width=\"300\" caption=\"Dave McClure dons the Moonfruit hoodie\"]<a href=\"http://500.co/wp-content/uploads/2011/03/LSU-Party-Dave-Design-Control-Freak.jpg\"><img class=\"size-medium wp-image-1116715125\" title=\"LSU Party Dave Design Control Freak\" src=\"/backup/LSU-Party-Dave-Design-Control-Freak-300x210-2011-03-21-11-17-31.jpg\" alt=\"\" width=\"300\" height=\"210\" /></a>[/caption]\n\nSome of the excellent speakers from the <a href=\"http://theleanstartup.com/sxsw/\">Lean Startup day</a> turn-up, like Hiten Shah from <a href=\"http://www.kissmetrics.com/\">KISSmetrics</a> and Dan Martell from <a href=\"http://www.flowtown.com/\">Flowtown</a>. Watching Dave McClure embrace Mark Suster, a well-known Californian VC and author of <a href=\"http://www.bothsidesofthetable.com/\">bothsidesofthetable.com</a> blog, who turns up with entourage in tow, is across between the Godfather and the end of Rocky. I’ll take a quick diversion here to say I’ve always been a fan of Mark’s blog. He shares his reflections as a serial entrepreneur and VC very openly, and I often find a useful tip in his posts.\n\nThe three highlights of my trip are taking a crazy trip on the ‘delivering happiness bus’ and pedicab with Mark Suster; borrowing <a href=\"http://www.facebook.com/Randi\">Randi Zuckerberg’s</a> charger while discussing the merits of Swedish fish with her, <a href=\"http://www.facebook.com/charlesporch\">Charles Porch</a> also Facebook, Rob Coneybeer, <a href=\"http://www.shastaventures.com/\">Shasta Ventures</a> and Kimberly Lembo from<a href=\"http://www.nasa.gov/\"> Nasa</a> and the reverential moment of having a drink with Bob Metcalfe who invented Ethernet, founded <a href=\"http://www.3com.com/services/\">3com</a> and <a href=\"http://www.infoworld.com/\">Infoworld</a>, was a VC at <a href=\"http://www.polarisindustries.com/default.aspx\">Polaris</a> and now Professor of Innovation at the University of Austin.\n\n[caption id=\"attachment_1116715127\" align=\"alignnone\" width=\"300\" caption=\"Mark Suster, Dan Martell, and Steve Blank at the Lean Startup afterparty\"]<a href=\"http://500.co/wp-content/uploads/2011/03/LSU-Party-Mark-and-Steve-Blank.jpg\"><img class=\"size-medium wp-image-1116715127\" title=\"LSU Party Mark and Steve Blank\" src=\"/backup/LSU-Party-Mark-and-Steve-Blank-300x210-2011-03-21-11-17-31.jpg\" alt=\"\" width=\"300\" height=\"210\" /></a>[/caption]\n\nAlso a particular shout out to Sam Michel, CEO of <a href=\"http://chinwag.com/\">Chinwag</a>. He relentlessly works on behalf of British startups. The Global Grill with the UKTI is superbly well provisioned and full of the great and good of the London tech scene.\n\nDespite being swallowed into the mania of SXSW, it is impossible not to be sobered by the escalating disaster unfolding in Japan. There are fundraising initiatives throughout the conference. Robert Laing, founder of <a href=\"http://mygengo.com/\">MyGengo</a>, is a Brit running his business in Japan. He’s part of the 500 Startups global family and is dealing with potentially evacuating his team and family from Japan. From here in Austin, I’m touched by <a href=\"http://globalvoicesonline.org/2011/03/13/japan-social-translation-in-times-of-crisis/\">Global Voices</a>, an international group of bloggers who are supporting ‘social translation’ in times of crisis.\n\nThis whole experience has been humbling – meeting so many different people at all stages of ‘entrepreneuring’ gives you an appreciation and perspective as to what it takes to make something happen. It’s worth us all taking the effort to get out of our comfort zones and learn from people with a different world view.\n\n[caption id=\"attachment_1116715129\" align=\"alignnone\" width=\"200\" caption=\"Wendy and Eirik kick back after a long day\"]<a href=\"http://500.co/wp-content/uploads/2011/03/LSU-Party-Eirik-Wendy-Enrique.jpg\"><img class=\"size-medium wp-image-1116715129\" title=\"LSU Party Eirik Wendy Enrique\" src=\"/backup/LSU-Party-Eirik-Wendy-Enrique-200x300-2011-03-21-11-17-31.jpg\" alt=\"\" width=\"200\" height=\"300\" /></a>[/caption]",
    "type": "post",
    "path": "/2011/03/21/serendipity-a-view-from-sxsw/"
}