{
    "title": "Sink or Swim: What it’s Like Being at 500 Startups",
    "slug": "sink-or-swim-what-its-like-being-at-500-startups",
    "date": "2013-04-24T03:19:53.000Z",
    "url": "http://500.co/?p=1116726863",
    "uri": "http://500.co/2013/04/23/sink-or-swim-what-its-like-being-at-500-startups/",
    "postId": "1116726863",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/04/nobody.gif"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "accelerator",
        "commentary",
        "musings"
    ],
    "content": "<p dir=\"ltr\">When I was a kid, my dad taught my brother and I how to swim using an unconventional – and some might say, borderline negligent – method: he threw us into deep end of our pool and yelled, “use your arms and stay above the water!” I won't lie; It was scary as f*ck, and I may be traumatized even to this day. But crazily enough, we learned how to keep ourselves above water in just a matter of minutes.</p>\n<p dir=\"ltr\"><em><strong>*Disclaimer* my dad is an amazing swimmer, so he could have jumped in and saved us. Don’t do this with your kids unless you want a visit from CPS.</strong></em></p>\n<p dir=\"ltr\">The point is, we didn’t learn how to swim by reading about it, watching YouTube videos, taking classes or meeting professional swimmers. We learned by being put into a situation where we had to do it. And where the only option besides success was complete failure, i.e., dad jumping into the pool and dragging us out (and likely chastising us about the incident for the rest of our lives).</p>\n<p dir=\"ltr\">Some people think that if you’re accepted into 500 Startups, you’re set for life. We’re the magic gateway to success, and once you step out of the elevator and into our office, your startup never has to worry about failure ever again. They’re wrong. And not just kind of wrong – 100% wrong. We give you all the resources you need to succeed. However, connecting the dots – and staying afloat in the swimming pool – is completely up to you.</p>\n<p dir=\"ltr\"><strong>What We Don’t Do</strong></p>\n<p dir=\"ltr\">No investor or accelerator can make a startup any better or worse than it already is. All we can do is accelerate whatever path the founding team decides to take. We give you great resources to make your startup as successful as possible, like a massive network and on-staff expertise, but we don’t get you customers. We don’t fundraise for you. And we definitely can’t fix a sh*tty product.</p>\n<p dir=\"ltr\">But you can. In our accelerator, you’ll get access to resources that’ll make it easier for you to make a product that doesn’t suck. You’ll also meet people who will put money into your startup and keep you alive. We give you everything you need; you’ll just have to work <em>really</em> hard to make your startup successful. If you’re looking for a place where someone sits you down and teaches you how to be an entrepreneur, well...</p>\n<p dir=\"ltr\" style=\"text-align: left;\"><b style=\"color: #333333;\"><b><a href=\"http://www.youtube.com/watch?v=8cT_Ulmcrys\"><img class=\"size-full wp-image-1116726867 aligncenter\" alt=\"nobody\" src=\"/backup/nobody-2013-04-23-13-22-19.gif\" width=\"500\" height=\"280\" /></a> </b></b>We give you the tools. It’s your job to use them correctly.<b><b> </b></b></p>\n<p dir=\"ltr\"><strong>Your Startup Has to Survive without Us</strong></p>\n<p dir=\"ltr\">One of the most common questions people ask us is, “What happens once the accelerator is over?”  We don’t have an extension program where we gradually release our startups back into the wild. After Demo Day, you’re thrown out into the real world where you have to succeed – or die trying. And while you do have the 500 community on your side (which is a massive advantage), it’s up to you to figure out how your company’s going to stay above water. Having a hands-off approach during our accelerator program teaches companies how to be self-sufficient.</p>\n<p dir=\"ltr\">At 500, we throw you into the deep end to teach you how to swim. But unlike my crazy dad, we at least put other people in the water who can help you stay afloat. Sink or swim.</p>",
    "type": "post",
    "path": "/2013/04/23/sink-or-swim-what-its-like-being-at-500-startups/",
    "backgroundImage": "/backup/swimming-960x540-2013-04-23-13-22-19.jpg"
}