{
    "title": "Six Steps to Growth: What I Learned as 500 Startups’ Growth Hacker in Residence",
    "slug": "six-steps-to-growth-what-i-learned-as-500-startups-growth-hacker-in-residence",
    "date": "2013-01-18T04:51:46.000Z",
    "url": "http://500.co/?p=1116724723",
    "uri": "http://500.co/2013/01/17/six-steps-to-growth-what-i-learned-as-500-startups-growth-hacker-in-residence/",
    "postId": "1116724723",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/01/mike-greenfield-200x300.jpg"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "data",
        "distribution",
        "mentors"
    ],
    "content": "<a href=\"http://numeratechoir.com\"><img class=\"size-full wp-image-1116724847 alignleft\" style=\"padding-right: 3px;\" alt=\"Mike Greenfield\" src=\"/backup/mike-greenfield-200x300-2013-01-17-13-22-51.jpg\" width=\"150\" height=\"198\" align=\"left\" /></a>\n\n<em><a href=\"https://twitter.com/mike_greenfield\" target=\"_blank\">Mike Greenfield</a> is an entrepreneur with a strong interest in data and analytics. He founded Team Rankings and Circle of Moms, <em>honed his growth hacking chops at <a href=\"http://paypal.com/\">PayPal</a> </em>and advises early stage companies. He blogs at <a href=\"http://numeratechoir.com/\" target=\"_blank\">numeratechoir.com</a>.</em>\n<p style=\"text-align: left;\">I just finished up a six month stint as Growth Hacker In Residence at 500 Startups. I want to share a few of my learnings.</p>\nBut before I do that, a couple of things to get out of the way.\n\nFirst of all, 500 Startups is a strong operation and an amazing story. If you’d just arrived in Silicon Valley yesterday, you’d probably have no idea that it’s only a couple of years old. In public, Dave McClure is a little zany/off the wall/all over the place, but that’s far from the entire story: he understands the venture world, he has good ideas on how to shake things up, and he’s built up a good team that complements his skills.\n\n500 Startups has two major unfair advantages: a huge network of talented mentors helping portfolio companies (with many others clamoring to mentor) and impressive ties abroad — incredibly valuable for deal flow, fundraising, and partnerships. 500 acts like a growing startup rather than a greedy venture firm: with a small fund, Dave opts to hire more employees who will help startups, rather than keep extra money for him and the other partners. Venture capital is going to get shaken up over the next decade or two, and 500 Startups’ strong network and ungreedy, open-minded approach will put them in good position to thrive.\n\nSecond, any thoughtful person who understands how to grow an Internet business cringes at least a little bit at the term “growth hacker.” The hype-to-substance ratio has become high: I suspect that a high percentage of the 338 people who show up in a LinkedIn search for “growth hacker” don’t have any idea what they’re doing. So it was with a tiny bit of reluctance that I accepted the “Growth Hacker In Residence” title. For better or worse, 500 is the ultimate\nanti-corporate firm, so I don’t have any business cards to implicate me. But it all worked out well.\n\n<strong>WHY GROWTH IS IMPORTANT</strong>\n\nI didn’t push back on the title because there is in fact a lot of substance behind the term growth hacking, and hype isn’t always a bad thing. The underlying skill it describes — increasing a product’s usage and distribution — is incredibly valuable in consumer technology companies. And contrary to the complaints of some, growth is not just product marketing by another name: skills in product design,\nengineering, and data analysis are just as relevant.\n\nTo see why growth is so important, one need only look at the big successes of my former colleagues at PayPal (aka the “PayPal Mafia”): YouTube, Yelp, Yammer, and LinkedIn. All succeeded in large part because they were designed for growth. The ability to embed videos on MySpace separated YouTube from the pack; Yelp mastered SEO for traffic and retained a small core of “elite” reviewers to build content; Yammer made it exceptionally easy to invite colleagues; LinkedIn made connecting with professional contacts seem like an obvious and important need.\n\nI don’t think this is a coincidence. PayPal had to scrap and claw to grow and survive; its alumni figured out how to grow their next companies the same way. By contrast, early Google was a company with more impressive technology that didn’t have to scramble to grow. Its employees likely learned less about growth while at Google, and those alumni have since had far less success with distribution.\n\nIn that respect, most entrepreneurs are more like the Google non-mafia than the PayPal Mafia: they don’t bring to their startup a strong understanding of how to grow and maintain a large base of users. That lack of understanding is true of most 500 Startups companies — as it is for the companies of every investor. Fortunately, that skill is — to an extent, at least — teachable.\n\n<strong><span style=\"color: #444444;\">HELPING COMPANIES</span></strong>\n\nSo how could I help the teams of 500 Startups?\n\nFor one, I could help by setting the right context: growth is at least as much discipline and execution as creativity. It turns out that there aren’t usually easy solutions to growth challenges. This is where the hype around the term “growth hacker” can be dangerous. Hacking implies something weird and unpredictable. It evokes a sense that the perpetrators are more crazy artists than precise scientists, that their methods are unusual and tough to replicate. And it implies that there’s some sort of obscure code that can be cracked to yield the magic growth solution.\n\nIf that were true, there might be a simple but hard-to-find switch to flip. This is almost never true. “Change the button color to green, and you’ll immediately go from 100 users to a million!” is probably not advice to bet your business on.\n\n<strong>T<span style=\"color: #444444;\">HE STEPS</span></strong>\n\nA consumer startup with good product can become proficient at growth via a fairly straightforward series of steps. As a founder, I informally understood that series; working with the companies of 500 Startups allowed me to formalize it as a six step process:\n\n<strong>1. Track:</strong> Figure out what needs to be tracked. Track it.\n\n<strong>2. Understand:</strong> Delve into the data to understand how people are using the product.\n\n<strong>3. Prioritize:</strong> Evaluate and prioritize the areas most likely to yield growth. Sometimes they’ll be tweaks, sometimes they’ll be rearchitected features, sometimes they’ll be completely new features.\n\n<strong>4. Design/Write:</strong><span style=\"color: #444444;\">In the top area or two, design a few features that are likely to yield growth. I emphasize writing because the words </span><span style=\"color: #444444;\">describing a product often matter at least as much as any other characteristics.</span>\n\n<strong> 5. Build:</strong> Code it up, push it out.\n\n<span style=\"color: #444444;\"><strong>6. Measure:</strong> Gauge success of new features. GOTO 1, 2, or 3, adjusting strategy based on the results.</span>\n\n<strong>THE PROCESS</strong>\n\nMuch like a signup flow that sees significant dropoff upon asking for the first piece of information, companies often get sidetracked before finishing the first step. Tracking and storing data — so you can actually go back later and see what went on — requires discipline and is low on glamour and creativity. You know that tracking won’t help you tomorrow: isn’t it more important to build out\nthat cool feature that might actually help right away, or fix a bug that a user is complaining about?\n\nUsually, no. Those who try to grow by relying only on designing and building often wind up spinning their wheels: they work on the wrong area of their product, again and again; they never completely understand what worked and what didn’t.\n\nIn my stint at 500, there were a few times when a company I worked with didn’t get past step one. Needless to say, that was frustrating for me, and it forced me to come up with a rule: if you want me to spend my time helping you grow, you need to set up the basics of tracking before we start working together. That rule worked well.\n\nThe technical details of what needs to be tracked vary; a more mature company will usually need to store most user actions in their own database. Pretty much anything the company cares about improving — the number of users coming in via certain channels, views of certain pages, clicks via email, invitation responses — needs to be stored.\n\n<span style=\"color: #444444;\">Once the data are in place, understanding the big picture comes to the fore. How are people finding out about the product? </span>\n\nHow frequently are old users coming back in to the product? What, if any, are the social dynamics: are people coming back because someone commented on something or because someone followed them? When that’s in place, it becomes relatively easy to come up with some estimates of the metrics impact of potential product improvements. To be sure, those estimates are more likely to be accurate when done by someone who’s done them before, but anyone can and should make them.\n\nThose estimates facilitate an ordered list of possible product changes. These changes might be minor — changing “Next” to “Continue” or “Submit” — or major, like building out a completely new signup process. And again, designing or writing by someone who’s skilled and knows what’s likely to be effective, is valuable. Building out those designs is the obvious next step; I generally didn’t get directly involved with that at 500.\n\nMeasuring the effects of those changes — for companies with data scale, via A/B testing — is the vital last step. It’s amazing to me how many companies will spend weeks working on a new feature or design, and then never really know if it was effective. If you’re tiny and just trying to get some kind of win, that’s okay. If you have an audience of hundreds of thousands of people or more, it’s negligent.\n\n<strong>SUCCEEDING AS AN ADVISER</strong>\n\nI effectively served as an adviser to the 500 Startups companies I worked with (though not financially), and I’ve come to realize that it’s not easy to add value as an adviser. Many advisers get a bunch of equity in a company, but don’t add a lot of value. If I agree to advise a company, I know there’s some chance that my advice won’t end up being relevant, but I want to maximize the odds that the time I spend with founders and employees has a measurable impact. As a founder, I intuited those six steps, and then spent hundreds or thousands of hours building everything out with a team of people I saw every day. As an adviser, I’m spending hours or tens of hours, so my thought process has had to be tighter and more formal.\n\nThe six steps outlined above can work pretty well regardless of the scale of involvement. There are a few companies with whom I spent a few hours a week over several months. With those companies, we spent a bunch of time upfront to make sure everything was being tracked. Then every week or two, we’d run through steps 2-6: finding a problem area, brainstorming and designing possible\nimprovements, building, and measuring the results.\n\nWith most 500 companies, my interaction was lighter: a 30-minute conversation every month or two. That may seem like too little time to go through six steps, but an abbreviated version can still work well. The conversation would usually look like this:\n\n<strong><span style=\"color: #444444;\">1 and 2. Tell me about your business. How do people find out about your product, how do they get back in to the product, etc. </span><span style=\"color: #444444;\">This works better if the founders get answers in advance.</span></strong>\n\n<strong><span style=\"font-size: 14px;\">3. Let’s figure out (in part by looking at the existing product) which areas to prioritize.</span></strong>\n\n<strong>4.<span style=\"color: #444444;\"> Let’s look at the product and try to narrow down (almost) exactly how the changes will look.</span></strong>\n\nThen the startup does the details of step 4, and all of step 5 on their own — actually building it out — and does the measurement step (6) with a little bit of guidance.\n\nThat process isn’t always going to be effective, in large part because most product changes don’t work as hoped. But by understanding the problem and betting on the changes with the highest expected returns, I’ve seen many wins. Here are a few:\n\nOne company I worked with, <a href=\"http://www.tradebriefs.com\" target=\"_blank\">TradeBriefs</a>, gets most of their return traffic from email newsletters. That became obvious when we walked through the basic metrics of the business to understand how everything fits together. The content of those newsletters had always been hand-curated, which means it consistently looked professional but wasn’t optimized. In previous lives, I’d seen how similar types of email content can have vastly different clickthrough rates. To better discover which content will yield maximum click rates, the team created a system that allows them to test different versions of similar emails each day. Their volume was large enough to allow them to randomize content for a small batch of users early in the day, wait, pick a winner, then send the winning (best) content to the majority of their users later in the day. They implemented that and saw\na 30% improvement in their email click rates.\n\nAnother company I worked with is a community where users are creating all of the content and interacting with one another. They were seeing lower usage among people who had been on the site for more than a few months, and they wanted to address that. We spent a lot of time upfront on metrics, tracking activity levels and <a href=\"http://numeratechoir.com/the-epidemiology-of-an-internet-business/\" target=\"_blank\">looking at how users transition across differing levels of</a>\n<a href=\"http://numeratechoir.com/the-epidemiology-of-an-internet-business/\" target=\"_blank\"> activity</a>.\n\nThat digging led us to realize that people who became moderately active by day five were far more likely to stay active than those who had not. So we focused our efforts there, testing lots of little tweaks in the new user experience to get people to activate in their first few days. <span style=\"color: #444444;\">Cumulatively, those tests led to a 30% increase in initial activation; we expect that to pay similar dividends long-term.</span>\n\nA third company is largely a commerce company that makes money when people buy physical goods. Most of their traffic — and purchases — were coming from advertising on Facebook and Google. The founder discovered that she could get more traffic from those same channels much more cheaply if she sent users to a more fun — but less commerce-focused — area of the site. However, only 4% of that cheaper traffic converted into leads likely to monetize, making it not worthwhile.\n\nDigging into the flow, we found a number of places to optimize the user interface — largely by making it intuitive to click through to the next step — and increased that 4% conversion rate to 16%. That difference was a huge one, immediately making the new stream of traffic immensely profitable.\n\nThose three examples are in the minority: for most of the companies I spent time with, the immediate value I created for them was little or nil.\n\nYet I come away feeling successful. In six months, I’ve been part of a few real wins and found a template for how I — and hopefully others at 500 Startups going forward — can help startups.\n\nThanks to Dave, Christine, the staff at 500, and the many, many founders and employees I’ve worked with over the past six months. I look forward to continuing to work with you all as a 500 Startups mentor and friend.\n\nAnd now it’s time for me to go and build something…",
    "type": "post",
    "path": "/2013/01/17/six-steps-to-growth-what-i-learned-as-500-startups-growth-hacker-in-residence/",
    "backgroundImage": "/backup/franelena-e13601417355691-2013-01-17-13-22-51.jpg"
}