{
    "title": "Southeast Asia (SEA) is Social on Steroids",
    "slug": "southeast-asia-sea-is-social-on-steroids",
    "date": "2013-03-01T06:03:22.000Z",
    "url": "http://500.co/?p=1116726089",
    "uri": "http://500.co/2013/03/01/southeast-asia-sea-is-social-on-steroids/",
    "postId": "1116726089",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/02/social.gif",
        "http://500.co/wp-content/uploads/2013/02/khailee.jpg"
    ],
    "creator": "",
    "categories": [
        "accelerator",
        "asia",
        "indonesia",
        "malaysia",
        "philippines",
        "singapore",
        "southeast-asia"
    ],
    "content": "<strong>This month, the 500 blog is taking you to every market in the world that’s ripe for innovation. We’ve already covered <a href=\"http://500.co/2013/02/15/jai-ho-500-helps-indian-startups-march-to-victory/\">India</a>, <a href=\"http://500.co/2013/02/22/%E7%BB%99%E5%8A%9B-500-goes-big-and-takes-on-chinas-trillion-dollar-market/\">China</a>, and <a href=\"http://500.co/2013/02/12/vai-brasil-brazils-tech-scene-sambas-onto-the-worlds-stage/\">Brazil</a> – now we’re heading to one of the most social and mobile places on earth: Southeast Asia. Are you an SEA entrepreneur who wants to dominate this market? We want you for our Spring Accelerator batch. <a href=\"http://bit.ly/Applyfor500\">Apply today before the March 1st deadline.</a></strong>\n\nFriendster. Multiply. Yahoo360. These early social networks once had their most active user base in Southeast Asia (SEA) –  the region comprised of Malaysia, Indonesia, the Phillipines, Thailand, Brunei, Laos, Cambodia, Vietnam, Myanmar/Burma and Singapore. And now with Twitter, Facebook, and new chat apps, similar patterns have begun to emerge.\n\nWhat is it about Southeast Asia that makes social networks extra social? Take a look at how the penetration of modern social networks in SEA far exceeds the USA and UK.\n\n<a href=\"/backup/social-2013-03-01-13-00-03.gif\"><img class=\"size-full wp-image-1116726091 alignnone\" style=\"border: 1px solid black;\" alt=\"social\" src=\"/backup/social-2013-03-01-13-00-03.gif\" width=\"465\" height=\"375\" /></a>\n\nHaving grown up in Southeast Asia and studied and worked in Australia and the US, I've always noticed that “back home,” it's more culturally accepted to add and accept someone you don't know in real life as a friend on Facebook. It's as though, while using Facebook to connect with friends they know, SEA users are more likely to use Facebook to make new friends too. If Facebook was a party, a Southeast Asian user wouldn't mind mingling with someone new, while a US user would only want to talk to friends they already know.\n\nThis cultural nuance – compounded with the sheer number of people under the age of 35 and rapid rollout of broadband and mobile internet – means that people in Southeast Asia represent a new generation of high-speed, uber-social citizens.\n\nSo what does it mean for tech?\n\nAt 500, we think the SEA startup scene is on the cusp of going BIG – especially as more startups are able to prove early traction quickly by leveraging these social users and the mobile-focused market. We’ve already invested in companies like <a href=\"http://www.twitmusic.com/\" target=\"_blank\">TwitMusic</a> (Philippines), <a href=\"https://www.action.io/\" target=\"_blank\">Action.IO</a> (Singapore), <a href=\"http://goldengate.vc/\" target=\"_blank\">Golden Gate Ventures</a> (Singapore) and <a href=\"http://www.viki.com/\" target=\"_blank\">Viki</a> (Singapore), and are currently looking for more badass SEA entrepreneurs who are ready to build something amazing. If that’s you, <a href=\"http://bit.ly/Applyfor500\">apply today to be part of our Spring Accelerator.</a>\n\nAs I spend the year back home, going deeper into the different markets in Southeast Asia, I hope to share more discoveries with you in a wiki about Southeast Asia's tech scene.\n\n<strong>Feel free to help me with this SEA wiki: <a href=\"https://sea.hackpad.com/\">https://sea.hackpad.com/</a></strong>\n<strong>Follow me <a href=\"http://twitter.com/khailee\">http://twitter.com/khailee</a></strong>\n<strong>And subscribe <a href=\"http://facebook.com/khailee\">http://facebook.com/khailee</a></strong>\n\nStay tuned for more insights about this region, and for news about our kickass Batch 6 startups.\n\n<em><strong><a href=\"/backup/khailee-2013-03-01-13-00-03.jpg\"><img class=\"alignleft  wp-image-1116726093\" alt=\"khailee\" src=\"/backup/khailee-2013-03-01-13-00-03.jpg\" width=\"130\" height=\"130\" /></a>Post contributed by Khailee Ng.</strong> He's the co-founder of GroupsMore (acquired by Groupon) and SAYS.com, a profitable social news company based in Malaysia, and recently began angel investing. Accolades include \"HSBC Young Entrepreneur of the Year\", \"Best in Asia,\" and \"Over-energetic karaoke mic hog.\" He joins 500 as the first entrepreneur-in-residence and Southeast Asian brother.</em>",
    "type": "post",
    "path": "/2013/03/01/southeast-asia-sea-is-social-on-steroids/",
    "backgroundImage": "/backup/asean-960x540-2013-03-01-13-00-03.png"
}