{
    "title": "Space Matters: Why is Startup Accelerator Space Important? ",
    "slug": "space-matters-why-is-startup-accelerator-space-important",
    "date": "2010-12-09T16:06:50.000Z",
    "url": "http://blog.500startups.com/?p=1116714168",
    "uri": "http://500.co/2010/12/09/space-matters-why-is-startup-accelerator-space-important/",
    "postId": "1116714168",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/12/giraffe-nest.jpg",
        "http://500.co/wp-content/uploads/2010/12/variables-and-outcomes4.007.007.jpg",
        "http://500.co/wp-content/uploads/2010/12/500-Startups_-Space-Productivity-Hypotheses.042.jpg",
        "http://500.co/wp-content/uploads/2010/12/500-Startups-Work-Scenarios.019.jpg",
        "http://500.co/wp-content/uploads/2010/12/500-Startups-Work-Scenario-Dimension.021.jpg",
        "http://500.co/wp-content/uploads/2010/12/500-Startups-Work-Scenario-Dimension.025.jpg",
        "http://500.co/wp-content/uploads/2010/12/500-Startups-Work-Scenario-Dimension.027.jpg",
        "http://500.co/wp-content/uploads/2010/12/500-Startups-Work-Scenario-Dimension.029.jpg",
        "http://500.co/wp-content/uploads/2010/12/500-Startups-Work-Scenario-Dimension.033.jpg"
    ],
    "creator": "",
    "categories": [
        "photos",
        "space",
        "startups",
        "tips",
        "video"
    ],
    "content": "Note from <a href=\"http://enriqueallen.com/\" target=\"_blank\">Enrique Allen</a>: <em>The  following article is written from an environmental perspective that 500  Startups is a \"meta-startup\" ecosystem and startups are the primary  customers we serve. My personal evidence over the last three years is  based on experiences learning and teaching classes at the <a href=\"http://dschool.stanford.edu\" target=\"_blank\">Stanford  dschool</a> and helping design other \"accelerators\" like Facebook's <a href=\"http://fbfund.com\" target=\"_blank\">fbFund  REV</a> and <a href=\"http://venrock.com\" target=\"_blank\">Venrock</a>'s Quarry. I'm writing this as we build our first  iteration of 10k sq ft in downtown Mountain View and actively test how  entrepreneurs respond to spaces with the help of many  collaborators.[<a href=\"#shoutouts\">shoutouts</a>] Please share feedback,  especially case studies, hacks and data from entrepreneurs like Dave  Schappell's <a href=\"../2010/10/11/how-to-sustainably-make-the-startup-office-more-livable/\" target=\"_blank\">post</a>!</em>\n\n<a href=\"/backup/giraffe-nest-2010-12-09-10-10-06.jpg\"><img class=\"alignnone size-full wp-image-1116714591\" title=\"Startup Giraffe Nest\" src=\"/backup/giraffe-nest-2010-12-09-10-10-06.jpg\" alt=\"\" width=\"304\" height=\"320\" /></a>\n\nOne of the most basic human needs for startups is space- both  physical and increasingly digital spaces too. As companies evolve, it's  natural to look for \"office space\" and carve out a location to flourish  in clusters like Silicon Valley. <strong>But why is space important to  accelerating the probability of early stage startup success</strong>?\n\nLong story short if you don't read much: space matters because it can  set the optimal context for resource-based variables to 1) <strong>accelerate  the collision between great ideas and people</strong> 2) <strong>influence company  productivity, community &amp; learning</strong> 3) <strong>form a platform with network  effects</strong>.\n\nSpace design is just one instantiation of my focus on spreading design thinking-doing at 500 Startups.[<a href=\"#design\">design</a>]  Watch this ~1 min video to get a sense of our space design process and  don't get your hopes up too much - we building our space on a lean,  early stage startup-centered budget to look unfinished and reinforce our  culture of prototyping while preserving flexibility for iteration - not  for Architectural Digest.\n\n<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"560\" height=\"340\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"http://www.youtube.com/v/3tsbISFI6-s?fs=1&amp;hl=en_US&amp;rel=0\" /><param name=\"allowfullscreen\" value=\"true\" /><embed type=\"application/x-shockwave-flash\" width=\"560\" height=\"340\" src=\"http://www.youtube.com/v/3tsbISFI6-s?fs=1&amp;hl=en_US&amp;rel=0\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>\n\nNow for those whose who want to read further...\nTo start off, I'm beginning to make a case about why space matters in  setting the optimal context for early stage startup acceleration.  Success outcomes for an early stage startup participating in an  accelerator can mean <strong>raising more funding</strong>, <strong>hiring key talent</strong>, and <strong>finding product-market-fit</strong>.[<a href=\"#successoutcomes\">accelerator success outcomes</a>] Each outcome has associated market driven performance metrics that we are tracking to compare with other accelerator-likes.\n\nThere are many factors influencing these success outcomes for early  stage startups and it's hard to tell which ones really make a  difference in the long run.[<a href=\"#success\">success</a>] Accelerator, incubator, coworking, and other hybrid models are bubbling  up all over the world to support entrepreneurs by manipulating a  combination of <strong>resource-based variables such as funding, the  accelerator-like team, mentorship, services, education, tools, sponsors, events and space</strong>.[<a href=\"#resourcebasedvariables\">resource-based variables</a>] Think of these as external value multipliers. I'll be continuously  sharing experiences and experimental evidence about each of these  resources to 'prove' they're positively correlated with success outcomes via company proxy variables like <strong>productivity, community and learning</strong>.[<a href=\"#proxyvariables\">company proxy variables</a>] Think of these as internal outcomes for each company during the  acceleration time period. Hopefully we can develop models for experimenting with these variables together and ultimately help build  better companies more efficiently to solve important, meaningful  problems, so again, please share your results!\n\n<a href=\"/backup/variables-and-outcomes4-007-007-2010-12-09-10-10-06.jpg\"><img class=\"alignnone size-full wp-image-1116714592\" title=\"500 Startups Accelerator Variables and Outcomes\" src=\"/backup/variables-and-outcomes4-007-007-2010-12-09-10-10-06.jpg\" alt=\"\" width=\"1024\" height=\"768\" /></a>\n\nProductivity, as an example proxy variable or antecedent to success outcomes, simply represents your ability and motivation to \"get shit  done\" in the space that actually makes an impact. In other words, productivity is \"<strong>the efficiency of achieving validated learning, measured by actionable metrics and speed through Build-Measure-Learn  loops</strong>.\"[<a href=\"http://www.startuplessonslearned.com/\" target=\"_blank\">Eric Ries</a>] Depending on acceleration time frame, often around 3  months, think about how many closed deals, life  long connections, and MVP experiments etc. you can make in an incubator space (while avoiding  too much distraction) versus if you're just on your own hacking in a  coffee shop? Spaces therefore should be designed with the intention of improving variables like productivity to \"fuel the creative process by  encouraging -- or discouraging -- specific behaviors.\" [<a href=\"http://www.fastcompany.com/magazine/146/the-idea-lab.html\" target=\"_blank\">Scott Witthoft</a>]  This line of reasoning may seem obvious because it is. But what's lacking is clear intention and consciousness behind startup space design and the myth that if you build a great coworking building the rest will magically come together. Most spaces are architected without the point of view of startup entrepreneurs and their specific needs at the early stage. As an example, Eric Ries pushed me to draft hypotheses (albeit with lurking variables and weak conditionality) about how space affects productivity. I'll be looking to falsify these in future posts and I encourage you to as well.\n\n<a href=\"/backup/500-Startups_-Space-Productivity-Hypotheses-042-2010-12-09-10-10-06.jpg\"><img class=\"size-full wp-image-1116714594 alignnone\" title=\"500 Startups Space Productivity Hypotheses\" src=\"/backup/500-Startups_-Space-Productivity-Hypotheses-042-2010-12-09-10-10-06.jpg\" alt=\"\" width=\"1024\" height=\"768\" /></a>\n\nBelow are a few points to consider about how space connects resource-based and company proxy variables together to increase the probability of accelerator success outcomes.\n<h2><strong>1. Innovation originates in spaces that accelerate the collision between great ideas and people.</strong></h2>\nAlthough you may think of the solitary genius, or lone hacker toiling in  his garage, go back in history and look at coffee shops like the Grand  Cafe that helped spur the Enlightenment or Parisian salons at the  forefront of modernism. Innovation occurs  simultaneously not just from profit motives: it comes from creating  environments where ideas can connect. Startup accelerators provide a  space where ideas can mingle, swap, and create new forms- the basis for  creative breakthroughs.[<a href=\"http://www.ted.com/talks/steven_johnson_where_good_ideas_come_from.html\" target=\"_blank\">Steven Johnson</a>] With enough colocated brilliant entrepreneurs  from different backgrounds hungry for change, you're bound to stumble  serendipitously across amazing new info to build upon, increasing the  probability of aha moments and \"idea sex.\" Fundamentally, you want your  team forming new networks of neurons firing in synch and need to put  them in environments where these new networks are more likely to form.  In this sense, space is kind of like glial cells. Without going too much  farther in the weeds, if you really wanted to measure this seemingly  intangible benefit, just start counting all the great productive ideas and relationships  that form in an accelerator space versus when you're on your own.\n\n<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"560\" height=\"340\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"http://www.youtube.com/v/NugRZGDbPFU?fs=1&amp;hl=en_US&amp;rel=0\" /><param name=\"allowfullscreen\" value=\"true\" /><embed type=\"application/x-shockwave-flash\" width=\"560\" height=\"340\" src=\"http://www.youtube.com/v/NugRZGDbPFU?fs=1&amp;hl=en_US&amp;rel=0\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>\n\nFurthermore, when you're at the early-stages still validating a lot of  assumptions and prototyping your path to product-market-fit along the  perimeter of technological options, you want  to solve problems in unique and special ways FAST. A true hacker finds  the process of problem solving exciting and interesting, but needs time  to look at the problem in multiple ways. <strong>So why not put be in  proximity to other hackers, mentors, and service providers who can  potentially accelerate the development of many more great ideas for  solutions?</strong> Not to mention these trustworthy folks who work near you for  weeks are more likely going to be able to find and attract the right  hire you need unlike some recruiter who annoys people and really doesn't  understand your vision.[<a href=\"#diversity\">diversity</a>]\n\nSimilarly, entrepreneurs need a place to show off their work to raise  capital and investors need to visit the best spaces for discovery. As an  entrepreneur, if you're trying to raise additional rounds of funding, you need intros, tips about investors with the highest probability of  transferring you money, and a community that has your back to say the  least. Obviously there's nuances to fundraising depending on the stage,  but for seed, bridge rounds in between, and Series A, there's no better  place to collide with potential investors than in the right accelerator  spaces. The amount of top angels and VCs I've seen in our space in just a  couple weeks is easily 10x greater than what you'd get in your own  place. For example, if an investor comes in and I think you should meet  them, we'll drop by your desk and say hello which is much more efficient  than endless email. Don't worry we won't let investors creep around uninvited and it's not a zero sum game, there's  enough money to go around if you're truly doing something innovative,  it's more a problem of startup-investor fit. The community of other 500  Startups entrepreneurs and mentors are great people to help solve that  because combined they know nearly everyone in the Valley and will help  you get the best deal... <strong>Accelerator spaces (even without events like  dinners and demo days) create opportunities for entrepreneurs and  investors to meet that would otherwise not happen</strong>. Like I said before,  we got to start measuring the impact. I wager that the amount of  investor leads and deals you close that originated from participating in  an accelerator is greater than what you would get on your own on  average.\n\nSo, don't think of great ideas and people as self-contained things in  your own company closet because they’re more like ecologies and  networks.[<a href=\"http://www.wired.com/magazine/2010/09/mf_kellyjohnson/all/1\" target=\"_blank\">Kevin Kelly</a>] Especially in the early stage when you're trying to figure  out your path, put yourself in spaces where resources collide with your  company in positive ways and lead to more successful outcomes.\n<h2><strong>2. Intentional accelerator space design can influence productivity, community &amp; learning.</strong></h2>\nSpace matters because \"creativity follows context.\"[<a href=\"http://www.fastcompany.com/magazine/146/the-idea-lab.html\" target=\"_blank\">George Kimbel</a>] If you want to influence the behavior of startups in a certain way, you  obviously need to design for that. For example, do you notice that  feedback and energy in a meeting can be affected by something seemingly  trivial like the type of chair, sofa, stool etc? I bet  you'll engage differently with an entrepreneur while reclining in seat  across a fancy board room table versus sitting actively on a bench in  front of a white board.\n\n<strong>But what does it mean to set the right context to get all those great  ideas and people to collide? </strong>That still sounds a bit too fuzzy. Below are  few concepts to consider as you think of context as an interaction  problem.\n\n<em>Location</em>: Simply put, where are the behaviors you care about occurring? From a  macro-level, it can start with the city you're in. Although many of my  friends and startups are setting up in San Francisco (I'm from the Bay Area) and it's a great  city especially if you're young, hip and looking to meet new people, it  may not be the best location for your first few months as an early stage startup in  Silicon Valley. During an acceleration period, the most important thing is productivity. I'm not saying to stay up all night, not sleep or  socialize but to have intense focus on validating that your company  should exist and be around other people who are striving for similar  goals. The kind of pressure I want from our space is to hack  productively, creatively and radically collaborate while developing deep  relationships and having healthy fun- not constant temptation to go out  and spend the little money I have around people that don't understand  startup life. Don't take my word for it, just  ask other early stage entrepreneurs who live in San Francisco who work  nearly seven days a week and barely take advantage of the social aspects  of SF while they live in an expensive tiny place that get's no sun. We  picked our first home in downtown Mountain View because it's proximity  to a community: VCs, major platforms like  Google/Facebook/Apple/Microsoft, Stanford University, blocks of cheap  food-coffee-tea options, access to public transportation, and affordable  living options. Long story short, <strong>we want to be closest to the  epicenter of funding, top talent, partners for distribution, and cheaper  necessities to help you get traction</strong>. The location of our 500 Startups  community \"is interlaced with the larger community in which it is  located.\" [<a href=\"http://en.wikipedia.org/wiki/A_Pattern_Language\" target=\"_blank\">Christopher Alexander</a>] From a micro-level, within our space, there's a ton of things to  consider about the location of certain elements but I'll save that for  another post specifically about space layout.\n\n<em>Activity</em>: Context fundamentally arises from activity.[<a href=\"http://portal.acm.org/citation.cfm?id=970985\" target=\"_blank\">Paul Dourish</a>] There are different types of activities associated with common work scenarios we call \"i-time\", \"little-we\", and \"big-we\"? As a result, our space design should facilitate  these scenarios or at least not get in the way. i-time, aka individual, heads down, \"get shit done\" mode is one of the  most challenging things to design for given so much individual  variability and the difference between makers and managers in early  stage startups.[<a href=\"http://www.paulgraham.com/makersschedule.html\" target=\"_blank\">Paul Graham</a>] i-time to work on serious problems and really think  clearly is increasingly under threat with all the buzzes, beeps, and  task switching that may be making us \"dumber\" so to speak.[<a href=\"http://gigaom.com/2010/09/27/multi-tasking-is-bad-this-video-could-change-your-work-life/\" target=\"_blank\">Clifford Nass</a>]  Theoretically cubicles and private offices solve for i-time until people  start to kill themselves, fight over hierarchy and compromise  face-to-face time. Well designed accelerators on the other hand can  enable your team members to bounce out to a variety of private spaces  like focus \"monk\" rooms where they can jam for a given period of time  and shelters they can customize so people don't feel confined to only  one place. Try it out yourself and give people control to manipulate  personal space, just like software, and if enough people do something they're  asking for a change.\n\n<a href=\"/backup/500-Startups-Work-Scenarios-019-2010-12-09-10-10-06.jpg\"><img class=\"alignnone size-full wp-image-1116714596\" title=\"500 Startups Work Scenarios\" src=\"/backup/500-Startups-Work-Scenarios-019-2010-12-09-10-10-06.jpg\" alt=\"\" width=\"1024\" height=\"768\" /></a>\n\nAs you observe people behave, think of re-occurring work dimensions or  patterns that we often bounce around to and from including: <strong>intense  focus to procrastination, private to public, formal to informal, quiet  to loud, in-the-machine to out-of-the-machine</strong>. There's a lot more to  discuss here but I'm trying to avoid writing you a novel because people  barely read more than 140 characters. Again to drive home the connection  between a resource-based variable like space and a company proxy  variable like productivity, I'll talk briefly about the designing spaces  to foster a range of intense focus to procrastination.\n\n<a href=\"/backup/500-Startups-Work-Scenario-Dimension-021-2010-12-09-10-10-06.jpg\"><img class=\"alignnone size-full wp-image-1116714597\" title=\"500S Work Scenario Dimension Intense Focus to Procrastination\" src=\"/backup/500-Startups-Work-Scenario-Dimension-021-2010-12-09-10-10-06.jpg\" alt=\"\" width=\"1024\" height=\"768\" /></a>\n\n<a href=\"/backup/500-Startups-Work-Scenario-Dimension-025-2010-12-09-10-10-06.jpg\"><img class=\"alignnone size-full wp-image-1116714599\" title=\"500S Work Scenario Dimension Formal to Informal\" src=\"/backup/500-Startups-Work-Scenario-Dimension-025-2010-12-09-10-10-06.jpg\" alt=\"\" width=\"1024\" height=\"768\" /></a>\n\n<a href=\"/backup/500-Startups-Work-Scenario-Dimension-027-2010-12-09-10-10-06.jpg\"><img class=\"alignnone size-full wp-image-1116714598\" title=\"500S Work Scenario Dimension Quiet to Loud\" src=\"/backup/500-Startups-Work-Scenario-Dimension-027-2010-12-09-10-10-06.jpg\" alt=\"\" width=\"1024\" height=\"768\" /></a>\n\n<a href=\"/backup/500-Startups-Work-Scenario-Dimension-029-2010-12-09-10-10-06.jpg\"><img class=\"alignnone size-full wp-image-1116714600\" title=\"500S Work Scenario Dimension In-the-Machine to Out-of-the-Machine\" src=\"/backup/500-Startups-Work-Scenario-Dimension-029-2010-12-09-10-10-06.jpg\" alt=\"\" width=\"1024\" height=\"768\" /></a>\n\n\"<strong>You probably only have to interrupt someone a couple times a day before  they're unable to work on hard problems at all</strong>.\"[<a href=\"http://www.paulgraham.com/procrastination.html\" target=\"_blank\">Paul Graham</a>] I  take this to heart as a designer because I often need around a four hour  chunk of time to really become immersed and produce high quality work  but I'm constantly getting pulled in multiple directions by requests,  emails, notifications, meetings and more. It's essential that  accelerator teams are mindful of the risk of too many distractions from  visitors, events etc. (or recognize that entrepreneurs are just making  excuses) and work with the community to set norms about behavior in  certain spaces. In our case, the East side work area for i-time is  nearest the elevator where the most traffic comes from. So not only do  we need to use doors, carpeting, and signage to drive people towards the  cafe area where little-we and big-we activities go on, we must  reinforce the norm by having an orientation when new companies join the  accelerator, providing noise cancelers and encouraging people to call  each other out if someone is becoming too disruptive. This is just one  of many issues to consider, so please share how you design space for  different work scenarios and dimensions.\n\n<em>Visual Awareness</em>: tuning into what's happening around you, processing  info through peripheral channels to keep up on-going knowledge of  others’ locations, activities etc is natural. Think of scanning when  someone walks through the door or noticing a new tweet in the  background. Benefits of high awareness include improved coordination,  rapid info sharing, increased observational &amp; tacit learning but  there's costs like the loss of privacy, distractions, interruptions  &amp; noise. [<a href=\"http://www.gsa.gov/portal/content/103982\" target=\"_blank\">GSA</a>] <strong>Accelerator space can magnify potential awareness of  important learnings that you would otherwise miss when you work alone</strong> (eg breakthrough progress from other teams, startup trends, educational  events, mentor office hours) by giving you visual clues into how  successful teams work, ambient displays of inspirational information,  and designated zones for visitor interaction.\nAs an experimental anecdote, during construction we moved temporarily to  the 9th floor which was designed with all private rooms that had just  enough room to house a startup. I noticed immediately that people went  for the \"best\" rooms based on views, sunlight, access to exits etc. and  started \"nesting\" and closing their doors. As expected there's a startup  tendency to get their \"own\" space and privacy with four walls so  they can begin developing their own culture. While this was a good thing  because people were able to \"get shit done\", the space layout of the  9th floor significantly hurt community activities because their was  little visual awareness of everyone else. To my surprise when we moved  back to the 12th floor, companies started introducing themselves,  meaning that after nearly a month of working in the same space, they  still didn't know each other! So as a take home lesson, find a balance  between giving companies privacy and props as well as exposing them to  each other so they can collide. \"<strong>Workplaces must not be too scattered,  nor too agglomerated, but clustered in groups of about 15...Group in  strongly identifiable communities. The communities need to be small  enough so that one can know most of the people working in them, at least  by sight- and big enough to support amenities</strong>.\" [<a href=\"http://en.wikipedia.org/wiki/A_Pattern_Language\" target=\"_blank\">Christopher Alexander</a>]\n\nAnother space tip to consider is making artifacts visible in shared  spaces to promote learning. <a href=\"http://www.stonetronix.com/\" target=\"_blank\">Stone Librande</a>, Creative Director of  startup-like teams at EA, gives a great a lecture on how he begins  designing games by making paper prototypes and board games to work out  the mechanics. He places them in common areas where people are provoked  to interact with them everyday, stimulating new associations- the  neurological basis for creativity. [<a href=\"http://www.ncbi.nlm.nih.gov/pubmed/14972752\" target=\"_blank\">KM Heilman et al</a>] Similarly, in  the Stanford dschool we practice a method of space saturation, where  you unpack thoughts and experiences into tangible and visual pieces of  information that you surround yourself with to inform and inspire  designs. You do this in a shared space where everyone can see the same  mental model, again to increase the probability of \"aha\" links and  reduce all coordination costs of digital communication and confusion we  encounter laying screens on top of screens. \"<strong>As you walk along, you can  see what others are up to, and perhaps contribute an idea to somebody  else's project</strong>.\" [<a href=\"http://www.fastcompany.com/magazine/146/the-idea-lab.html\" target=\"_blank\">Scott Doorley</a>]. Furthermore,  there's research that shows these sorts of behaviors in \"war rooms\" can  actually double people's productivity. [<a href=\"http://www.sciencedaily.com/releases/2000/12/001206144705.htm\" target=\"_blank\">S Teasley et al</a>] No  wonder both Twitter and Facebook had short-term war room spaces for  teams working on latest new releases. Long story short visual cues in  accelerator spaces should move you towards interactions that promote the success outcomes you want  to achieve.\n\n<em>Availability</em>: what, how and when you want to interact with others.  Availability is tricky because it's a continuous process of negotiating  what you want to be aware of and how visible you want to be to others at  a given time. Common behaviors you see in startup work spaces are  people closing their door, putting on headphones, pulling down blinds  for i-time. But what I'm advocating for is having even more intention  about how space signals availability and associated behaviors from the  structural to furniture level.\n\nFor example, we believe that little-we and big-we spaces are often where  community connections get formed. We intentionally blew out walls and  created a large non-persistent, multi-use area directly connected to our  cafe for visitors, folks like our resident mentors, and events. The  furniture in this space is even more flexible, reconfigurable and meant  to signal that you're more available to talk than at your workstation.  \"The system allows a modal shift between intimate and open.\" [<a href=\"http://www.fastcompany.com/magazine/146/the-idea-lab.html\" target=\"_blank\">Scott Doorley</a>] Think about where people naturally gather and walk, like animals around a  water hole, and leverage these patterns to foster more serendipitous  interactions. Find ways to get people talking during transitions in  public spaces, the optimal context for casual interactions versus  unexpected interruptions near work stations. Entrepreneurs often act so  busy they don't have time for anything when in reality they sometimes  should be making time to get outside of their insular bubble- so design  spaces where that more naturally can occur. Our North side is \"the  common piece of land within the work community, which ties the  individual workshops and [companies] together.\" [<a href=\"http://en.wikipedia.org/wiki/A_Pattern_Language\" target=\"_blank\">Christopher Alexander</a>]\n<strong> </strong>\n<h2><strong>3. Spaces form a platform with network effects</strong></h2>\nAfter a few acceleration batches, our space will be a platform for startups to grow like a two-sided market connecting talented entrepreneurs with an ecosystems of investors, partners and more... For the time being, it starts with eating our own dog food and getting through as many build-measure-learn cycles in our space. We're combining lean startup and  human centered design methodologies to show that space brings together  resource-based variables that influence company specific proxy variables  and ultimately accelerator success outcomes.\n\n<a href=\"/backup/500-Startups-Work-Scenario-Dimension-033-2010-12-09-10-10-06.jpg\"><img class=\"alignnone size-full wp-image-1116714601\" title=\"500 Startups Work Scenario Dimension.033\" src=\"/backup/500-Startups-Work-Scenario-Dimension-033-2010-12-09-10-10-06.jpg\" alt=\"\" width=\"1024\" height=\"768\" /></a>\n\nIn closing be mindful and aware of your space, find empathy with the humans you care about, make some hypotheses about what really matters, build prototypes, test them, and measure the results to extract learnings, then rinse-repeat like you would with software. Although the brutalist structure at 444  Castro St may represent an artifact of  the \"spiritual, intellectual,  and moral deformity\" of previous Internet bubble implosions [<a href=\"http://www.mv-voice.com/story.php?story_id=4750\" target=\"_blank\">Dog City</a>],  our intention is to reclaim the space with the networked resources and  positive energy needed for entrepreneurs to tackle meaningful problems  in more efficient and creative ways.\n\n<strong>Footnotes:</strong>\n[<a name=\"shoutouts\"><strong>Shoutouts</strong></a>]:\n<a href=\"http://dschool.stanford.edu/people/team_scott_doorley.php\">Scott Doorley</a>, <a href=\"http://dschool.stanford.edu/people/team_scott_witthoft.php\">Scott Witthoft</a>, &amp; <a href=\"http://twitter.com/michalkopec\">Michal Kopec</a> (<a href=\"http://dschool.stanford.edu\">Stanford d.school</a> Environments Collaborative)\nJim Merryman (Facebook)\nPrimo Orphilla, Denise Cherry, &amp; Kroeun Dav (<a href=\"http://www.o-plus-a.com/\">Studio O + A</a>)\nSteven Gerten, Tamara Larson, &amp; David Meckley (<a href=\"http://huntsmanag.com/\">Huntsman</a>)\nAmit Wadhwa (AWA)\nEd Howard (Steelcase)\nMike Drez (OneWorkplace)\nTina Lee &amp; Dave Denny (InsideSource)\nRob Englert &amp; Grant Meacham (<a href=\"http://d-build.org/\">D-Build</a>)\nJosh Alfaro, Volpentest, Travis Lee &amp; Danny Chavez any many more (Novo Construction)\nDeborah Boyer, Maria Damato-Jay, Patrick Flynn, Marianella Guandique &amp; more (Swigco)\nRod Scherba &amp; Sam Warburg (CC &amp; Carey)\nMarc Pacaldo, Matt Stoltz, Orion Lakota &amp; Luke Dillman (143 Garage Team)\n<a href=\"http://shuqiao.tumblr.com/\">Shuqiao Song</a> &amp; Carey Lee (Stanford dschool)\nTim Pacaldo, &amp; <a href=\"http://lisacarroll.org/\">Lisa Carroll</a>\n\n[<a name=\"design\"><strong>Design</strong></a>] can be  everything- a big realization for any designer. My biases stem from  Stanford University sources of human-computer-interaction, persuasive  technology, and product design. From my viewpoint, design is a holistic,  re-combinatorial, human-centered process that can reliably produce  innovative solutions to nearly any challenge. I envision design thinking  to be the glue that binds our startups together in our space. From a  more practical perspective, we integrate lean startup and UX design  methodologies that are actionable to entrepreneurs on a tight budget  with a need for speed.\n\n[<a name=\"successoutcomes\"><strong>Accelerator Success Outcomes</strong></a>]\n<em>More Funding</em>: You can fundraise more effectively by joining an  accelerator that draws the attention of investors to one place versus  spending months knocking on VCs doors.\n<em>Hiring Key Talent</em>: Attract a <a href=\"http://www.paulgraham.com/gba.html\" target=\"_blank\">hacker</a> culture with brilliant people and/or be around other awesome folks in a space who inspire and motivate you.\n<em>Finding product-market-fit</em>: \"When a product shows strong demand by  passionate users representing a sizable market.\" Basically at the end of  an acceleration period can you prove: 1) The customer is willing to pay  for the product. 2) The cost of acquiring the customer is less than  what they pay for the product. 3) There’s sufficient evidence indicating  the market is large enough to support the business. See the <a href=\"http://www.custdev.com/\" target=\"_blank\">Entrepreneur's Guide to Customer Development</a> and <a href=\"http://www.startuplessonslearned.com/\" target=\"_blank\">Startup Lessons Learned</a>. We're lucky to have the thought leader sources of the lean startup movement as mentors, advisors and investors.\n\n[<a name=\"success\"><strong>Success</strong></a>] is highly subjective but is directly tied to a startup's ability to create <a href=\"http://www.paulgraham.com/wealth.html\" target=\"_blank\">wealth</a>. It's important to note that while achieving Google gorilla status as a  sustainable publicly traded company is home run level success that many entrepreneurs and investors aspire to but there are inter-mediate success outcomes specific to early stage startups and their purpose for  participating in accelerator-like models.\n\n[<a name=\"proxyvariables\"><strong>Company Proxy Variables</strong></a>]\n<em>Productivity</em>: your ability and motivation to \"get shit done\" in the space that actually makes an impact. In other words, productivity is \"the efficiency of achieving validated learning, measured by actionable metrics and speed through Build-Measure-Learn loops.\"[<a href=\"http://www.startuplessonslearned.com/\" target=\"_blank\">Eric Ries</a>]\n<em>Community</em>: I'll save in-depth discussions of community for another post. Basically, does a company participating in an accelerator space find meaningful belonging and dare I say, real friends, collaborators, and other tribesmen who go out of there way to help without always an expectation of immediate return.\n<em>Learning</em>: This is part of productivity, however, there are other potential learnings around design, data, and distribution that may be super valuable but not directly incorporated into your product eg you learn how to avoid common entrepreneur pitfalls or things like useful SEO hacks without applying them during the acceleration period. I think learning is one of the key differentiators that accelerator/incubators of past failed to realize. Why spend ~$200k+ on business school if you're trying to become an entrepreneur? Go get seed funding from an accelerator and learn by doing.\n\n[<a name=\"resourcebasedvariables\"><strong>Resource-based Variables</strong></a>]\n<em>Funding</em>: Some companies participating in early stage accelerators are still closing their first seed round, some are looking  for a bridge and others are getting ready for series A or even B.\n<em>The accelerator-like team</em>: Ignore all this unnecessary PR about \"super'  angels and what not. The reality is Silicon Valley is a bit like Hollywood, where there are stars that attract the best talent and a supporting cast to make it happen. Dave McClure is an up and coming star consistently listed among the best and we have a well rounded team to support your needs.\n<em>Mentorship</em>: There are many models for structuring relationships between early stage entrepreneurs and those who've been around the block. In order to scale we've intentionally recruited over a 100  mentors with operational background that can help you execute and avoid dumb mistakes. Look out for improved mechanisms for facilitating startup-mentor relationships.\n<em>Services</em>: This can mean a wide variety of things like legal, finance, admin back office, IT support etc. that  accelerator/incubators traditionally provided to remove friction from starting a business and relieve founders of distractions like errands. While it's important that entrepreneurs know how to start a business from scratch and not make legal blunders, our focus is on services that augment design, data, and distribution. Personally I'm leading, and most excited about the development of scalable design resources for our early stage startups.\n<em>Education</em>: This can be everything from ad-hoc meetups to lectures and even formalized curriculum. At fbFund REV, we over-delivered on this and setup so much content that people couldn't even consume. Although we'll tone down the amount of education at 500S, I think the most important outcomes from educational resources is inspiring and reinforcing learnings around replicable design processes and a shared vernacular that companies can use to better communicate.\n<em> Tools</em>: Anything from the calendering software that Paul Graham wrote to infrastructure platforms like Twilio that other 500S  companies can use to be more productive. There's a TON of innovation here without creating too much of an echoing chamber.\n<em> Sponsors</em>: I'm looking for sponsors who can hook us up with super useful things like screens, furniture, healthy food, equipment, hosting and more. We have deals we'll soon be announcing that are geared to make lives of startups better.\n<em>Events</em>: They can be related to the variables above or more social in nature meant to bring the community  together. You can count on a big demo day where you'll have the opportunity to present to who's who of Silicon Valley. But we'll also host both large public events like <a href=\"http://warmgun.com\">WarmGun</a> and smaller invite only events like <a href=\"http://inboxlove.com\">InboxLove</a> that help promote your company and expose you to the right people.\n<em>Space</em>: Obviously you can work in your room, in a coffee shop or under a rock and if you want it enough, you can get it without accelerator/incubator drop-in, coworking or dedicated spaces. Either way, hopefully I'm helping you realize why space matters and succeeding in at least persuading you to intentionally re-arrange something in your work setup.\n\n[<a name=\"diversity\"><strong>Diversity</strong></a>] is part of the secret sauce of innovation, especially when extremes collide on the edges of expertise, philosophies, background, eg <a href=\"http://www.well.com/\" target=\"_blank\">The Well</a>. At 500S we are radically collaborative and attract brilliant entrepreneurs from all walks of life both locally and internationally. Just look at our portfolio and follow Dave's traveling tweeds- few early stage funds even come close to our diversity.",
    "type": "post",
    "path": "/2010/12/09/space-matters-why-is-startup-accelerator-space-important/"
}