{
    "title": "Startup Staffing Strategy for Entrepreneurs Crafting Companies  (S3 for EC2)",
    "slug": "startup-staffing-strategy-for-entrepreneurs-crafting-companies-s3-for-ec2",
    "date": "2010-12-14T22:26:13.000Z",
    "url": "http://blog.500startups.com/?p=1116714614",
    "uri": "http://500.co/2010/12/14/startup-staffing-strategy-for-entrepreneurs-crafting-companies-s3-for-ec2/",
    "postId": "1116714614",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/12/Xav-lopr-150x150.png",
        "http://500.co/wp-content/uploads/2010/12/hongquan-150x150.jpg"
    ],
    "creator": "",
    "categories": [
        "guest-posts",
        "hiring",
        "hong-quan",
        "mentors",
        "mentors",
        "professor-x",
        "recruiter",
        "recruiting",
        "staffing",
        "tips"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2010/12/Xav-lopr.png\"><img class=\"alignnone size-thumbnail wp-image-1116714615\" title=\"Xav-lopr\" src=\"/backup/Xav-lopr-150x150-2010-12-14-10-16-26.png\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2010/12/hongquan.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714616\" title=\"hongquan\" src=\"/backup/hongquan-150x150-2010-12-14-10-16-26.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet Professor X, aka 500 SuperMentor <a href=\"http://blog.outgrown.it/\" target=\"_blank\">Hong Quan</a> (<a href=\"http://twitter.com/hongdquan\" target=\"_blank\">@hongdquan</a>). An entrepreneur and recruiter building cars and startups, Hong has even hired a real honest-to-goodness rockstar (#3 on Billboard charts).  He uses his superpowers of recruiting and abilities to read and influence human minds to bring young Startupers in to the 500 Institute.  After hand-picking a game development team for John Romero, Hong worked in Corp Dev for Gazillion Entertainment, resulting in the Lego Universe game and an upcoming Marvel MMO. Similar to his namesake, Hong rolls around in a vehicle of his own creation and is going bald working on <a href=\"http://www.outgrown.it/\" target=\"_blank\">Outgrown.it</a>.</em>\n\nIt’s hard to get startup bloggers or VCs and Angels to agree on anything.  Aquaman’s already given us the <a href=\"http://500.co/2010/11/29/the-entrepreneurs-guide-to-conflicting-advice/\" target=\"_blank\">Guide to Conflicting Advice</a>, including how to hire. But everyone can agree on the importance of team.  As The Michael Jordan of venture investing says, “It takes a team to win.” Investors back remarkable founders on the assumption that they will assemble a team as kick-ass as themselves.\n\nThere are a ton of books, articles, advice and “rules” on Staffing for Companies, but startups are a different game.  If you’re starting from zero, this isn’t a great intro.  Go read Paul English’s <a href=\"http://paulenglish.com/hiring.html/\" target=\"_blank\">hiring religion</a> (Google cached).  Check out Steve Newcomb’s <a href=\"http://blognewcomb.squarespace.com/essays/2010/10/14/cult-creation.html\" target=\"_blank\">Cult Creation</a>.  Both are great, but realize that you have to figure out your own strategy and what advice may or may not (or should not!) apply.\n\n<strong><em>1. Be Honest Above All Else.</em></strong>\nMy first rule of “Startup Recruiters Club” is <a href=\"http://bobsutton.typepad.com/my_weblog/\" target=\"_blank\">The No Asshole Rule</a>, but it's not necessarily for everyone.  What kind of company are you building?  \"Don’t be evil\" is a great motto, but Oracle is a powerhouse built by a bastard (that's meant as a compliment!). Either way works, but the key is that both Larrys and Sergey are being true to themselves.\n\nA recruiter once told me, \"Our job is to lie to people.\"  She was being dead serious and she is dead wrong (and she is an asshole).  The startup she hired for fell apart, repeatedly. That’s not the kind of “blowing up startups” we SuperMentors do at 500 Startups.\n\n<strong>Dishonesty in recruiting will be the death of your startup.</strong>\n\nIf you're dishonest in recruiting for your startup then you're just hiring temps.  When people figure out the truth they will quit, or worse, they’ll lose their motivation.  Doing the right thing will pay off in the long run and your true team (cult?) will eventually find their way to you.  I’ve hired people years later, or even a few startups later. You’re building for the long-term right?  Good.\n\n<strong><em>2. Always Be Recruiting.</em></strong>\n\nI always ask founders if they have an in-house recruiter (it’s my job).  Most say “No.” but they should say, “Yes, every one of us is a recruiter.” And the CEO should be the Chief Recruiting Officer.  <a href=\"http://techcrunch.com/2010/10/01/vinod-khosla-ceos-should-spend-more-than-50-of-their-time-recruiting-tctv/\" target=\"_blank\">Vinod says as much</a>.  Founders are the best recruiters because they hold the vision and are more passionate than anyone else.  You may be saying, \"I'm not a recruiter, I wouldn't know what to do.\"  But if you got someone to write you a big check, you already know what to do.\n\n<strong>Pitch.</strong>\n\n<strong></strong>In some ways, pitching a potential hire is harder than pitching to raise a round. In recruiting, you have to convince someone to leave a comfortable job with big benefits, perks and stability; trade salary for a lotto ticket; work longer hours; be a one-person department; give up their personal life to help you see your dreams come true.  It's a really tough sell, so work on it.\n\nJust think about what your startup truly offers candidates that their current role doesn't (easier if they applied).  There are <a href=\"http://sethgodin.typepad.com/seths_blog/2010/11/reasons-to-work.html\" target=\"_blank\">8 reasons people work</a>.  Figure out which ones are important to them, be honest and pitch the opportunity.  Your employees are your biggest investors because they're putting their lives in the pot, not just some chips on the table.\n\n<strong><em>3. Think Outside The Circle.</em></strong>\n\nStartups grow in steps, and your first employees are the foundation for later phases of growth. It's easy to go from 2 to 5 because you just call up your smartest friends. The growth from 5 to 10 (or 20) depends on your network, and how you cultivate it.\n\n<strong>Go outside your natural network.</strong>\n\nYou want to be able to pick from the largest pool possible.  Hopefully you’re adding diversity along the way, not just in the traditional sense, but diversity of thought and backgrounds to build the strongest team you can.  Homogeneity in startups is the norm early on, and that’s fine, but the best Director of Whatever hire isn’t necessarily a friend of a friend.  Force yourself to network like a recruiter.  Even recruiters don’t like networking, but it’s our job.  And it’s your job too.\n\n<strong><em>4. Roles, Responsibilities, Requirements, Really??!?</em></strong>\n\nIf you’re a big company doing business as usual you get the budget for a requisition, write the job description from an HR template, post it on the hotmonsterjobs boards and sit back while resumes roll in.  Then you go through your three-part interview process and present the standard job offer package. Congrats! Your new Cog is ready for The Machine!\n\n<strong>Startups are different, so hire differently.</strong>\n\nThink through all the steps of your hiring process and figure out how to make it better.  Show some personality and talk about what makes your startup an employer of choice.  Do you <em>really </em>know exactly what this new hire will be doing in their first year?  First three months even? Is having 5+ years of experience in whatever really that crucial?  If yes, then by all means put it in. If you’re just using bullet points as filler or because everyone else is doing it then <strong>STOP</strong>.  Why are startups using generic job descriptions if we want to find exceptional people?\n\nBe honest (again) about the <em>real </em>technical issues you’re facing, the big markets you’re struggling to capture, the reason you need help from a new hire.  Startup Stars will be excited by the challenges and want to help fix the problems.  Don’t try to project a big company persona or say everything is great when you’re just a few hackers figuring things out as you go.  Be honest about what the candidate needs to succeed and keep job descriptions short.  A ton of “Requirements” will just turn away people who might have been awe.sm for your startup.\n\n<strong><em>5. It’s Not A Tumor, Unless It Is.\n</em></strong>\nEven the best hiring process isn’t foolproof.  Tony Hsieh says <a href=\"http://www.businessinsider.com/tony-hsieh-making-the-right-hires-2010-10\" target=\"_blank\">Zappos lost $100M</a> on hiring mistakes.  And sometimes a superstar at one company might fail at another startup.\n\n<strong>If you make a hiring mistake, admit it and fix it immediately.\n</strong>\nFix doesn’t always mean fire.  It could be redeployment into another role.  If you’re hiring smart, flexible and passionate people then they should be a net positive to your efforts somewhere.  Although they may not be working out for you, they could be a huge benefit to another company.  Holding on to an employee because you’re afraid of firing them is bad for everyone involved.  Mostly you.\n\nCut your losses honorably. Yes, even a co-founder should be booted if they’re detrimental to the company’s success. It’s worse to wait and let the tumor grow.\n\nI’m sure you can find conflicting advice from successful companies that did none of the above.  This is based on my experiences recruiting for and being recruited by startups over the last decade.\n\nRecruit well!",
    "type": "post",
    "path": "/2010/12/14/startup-staffing-strategy-for-entrepreneurs-crafting-companies-s3-for-ec2/"
}