{
    "title": "Startup Dad Gives Baby Up For Adoption",
    "slug": "startup-dad-gives-baby-up-for-adoption",
    "date": "2011-06-25T01:56:37.000Z",
    "url": "http://blog.500startups.com/?p=1116715541",
    "uri": "http://500.co/2011/06/24/startup-dad-gives-baby-up-for-adoption/",
    "postId": "1116715541",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/12/Xav-lopr-150x150.png",
        "http://500.co/wp-content/uploads/2010/12/hongquan-150x150.jpg"
    ],
    "creator": "",
    "categories": [
        "guest-posts",
        "mentors",
        "tips",
        "uncategorized"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2010/12/Xav-lopr.png\"><img title=\"Xav-lopr\" src=\"/backup/Xav-lopr-150x150-2011-06-24-11-20-56.png\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2010/12/hongquan.jpg\"><img title=\"hongquan\" src=\"/backup/hongquan-150x150-2011-06-24-11-20-56.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet Professor X, aka 500 SuperMentor <a href=\"http://blog.outgrown.it/\" target=\"_blank\">Hong Quan</a> (<a href=\"http://twitter.com/hongdquan\" target=\"_blank\">@hongdquan</a>). An entrepreneur and recruiter building cars and startups, Hong has even hired a real honest-to-goodness rockstar (#3 on Billboard charts).  He uses his superpowers of recruiting and abilities to read and influence human minds to bring young Startupers in to the 500 Institute.  After hand-picking a game development team for John Romero, Hong worked in Corp Dev for Gazillion Entertainment, resulting in the Lego Universe game and an upcoming Marvel MMO. Similar to his namesake, Hong rolls around in a vehicle of his own creation and is going bald working on <a href=\"http://www.outgrown.it/\" target=\"_blank\">Outgrown.it</a>.</em>\n\nBefore anyone gets their Pampers in a bunch, I didn't actually put my <strong>human </strong>children up for adoption. I'm talking about my other \"child\", my first startup <a href=\"http://www.prongmotors.com/\">Prong Motors</a>, which I just sold last week. Someone less sappy might call it an acquisition or a company sale (sorry, it wasn't an acqhire), but I have two kids and I compare startups to parenting for folks who haven't experienced both. The analogy works pretty well. If you have done both (especially concurrently) then you are one crazy motherfather and I salute you!\n\n<strong>1) No one is ever \"ready\" for kids.</strong>\n\nI get to talk to a lot of smart coders, developers, designers and engineers in my day job recruiting for <a href=\"http://www.quantumstartups.com/\">Quantum Startups</a>. Doing a startup is getting very popular and lots of people want to do it because it's \"cool\". Being a founder is totally different. People who think they are \"ready\" to be parents or founders have no frick’in clue. You can read all the books and blogs you want, you'll never know what kind of parent you'll be until you have kids. Being an early employee at a startup is the closest thing to being a founder, but it's still leagues away from being one. All the pain and suffering of the first few years, pre-revenue, pre-funding, pre-anyone believing your crazy idea will work - no one glamorizes that part of the journey. It's dirty, it's messy, you're constantly cleaning up shit and you get puked on every so often. You get about four hours of sleep a night and you worry if every decision you make is the right one for your baby.\n\nIf you think you're not ready, you're right. But neither is anyone else. Jump in, the water is fine.\n\n<strong>2) The hardest, but most rewarding job.</strong>\n\nA guy tweeted this on Father's Day:\n\n<em> </em>\n\n<em>\"Being a father is sometimes my hardest but always my most rewarding job. Happy Father's Day to all the dads out there.\" </em>- BO\n\nI couldn't agree more, even if he's totally copying me (wait ‘till I see you Barack!). I've read that startups are like roller coasters, swimming in the deep sea, running a marathon, etc. I generally agree but from an emotional perspective it is the best job in the world and the most rewarding, right up there with being a dad. Parents will talk your head off about how wonderful it is but no one tells you how much work it is. No one talks about the herculean efforts required to do a good job. No one else determines if your kid grows up to be a success or a bum. No one else is as deeply invested in your child as yourself. And everything is 100% your responsibility.\n\nBeing a parent, it's as if we only remember the good parts and can't recall the rough patches. But you'll be an expert in two years, having gone through the steepest part of the learning curve - getting started from nothing. Like founders, parents love to help those who are going through what they've already done. You'll get a ton of advice and what worked for their kids might not be best for yours. Or it could be the perfect solution. And you'll want to do it again. Most parents go for two and most founders I've met can't stop after one startup either.\n\n<strong>3) Don't go it alone.</strong>\n\nBeing a single parent is extremely hard. I have tremendous respect for those who are going that route. As a solo founder, I came very close to calling it quits - multiple times. I think that's the greatest value of a co-founder. They keep you going when you think you're done. And your startup will be on the brink of death at least once. My wife does the bulk of the \"parenting\" but we make a great team and support each other, especially when the two little ones team up against us! As founders, the whole world is against you. Find your family.\n\nAn extended family of grandparents, aunts, uncles and supportive friends does wonders for the health and well-being of a child. Nothing wrong with a nuclear family, it's just easier with help. Your network of support and advice could be investors, advisers and other entrepreneurs who (might) know what you are going through. I think that's the greatest value of doing Y-Combinator, taking an investment from Ron Conway or joining 500 Startups. Your family will get you through every trough of sorrow and they'll celebrate each victory. Family first is a core value of Outgrown.it, and not just because we're a site for parents.\n\nAlso, every good parent will take the incubator if their baby needs it.\n\nWhen to sell your company is heartbreakingly simple. Find amazing adoptive parents when you're maxed out and ask if they can do a better job than you could? We could have taken investor money to get to a production vehicle but that would have raised our expectations for revenue or an exit. Having bootstrapped and self-funded, we made the decision to hand over our baby and hope the new owner realizes our dream. I'm not trying to make light of a real-life adoption decision but having worked my ass off for 2.5 years, getting a big check wasn't as joyous an occasion as I thought it would be. Next time will be better.",
    "type": "post",
    "path": "/2011/06/24/startup-dad-gives-baby-up-for-adoption/"
}