{
    "title": "Startup Metrics: Don’t Let Your SAC Get WACC",
    "slug": "startup-metrics-dont-let-your-sac-get-wacc",
    "date": "2013-10-15T15:25:36.000Z",
    "url": "http://500.co/?p=1116729981",
    "uri": "http://500.co/2013/10/15/startup-metrics-dont-let-your-sac-get-wacc/",
    "postId": "1116729981",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/10/churn-rate-formula-1-1024x76.png",
        "http://500.co/wp-content/uploads/2013/10/churn-rate-formula-1024x129.png",
        "http://500.co/wp-content/uploads/2013/10/LTV-formula.png"
    ],
    "creator": "",
    "categories": [
        "churn-rate",
        "conversion-rate",
        "customer-acquisition-2",
        "distribution",
        "metrics"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following <a href=\"http://twitter.com/500distribution\" target=\"_blank\">@500Distribution on Twitter</a> and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter.</a></em>\n<p dir=\"ltr\">“If you can’t measure it, you can’t manage it.”</p>\n<p dir=\"ltr\">Generally <a href=\"http://thedx.druckerinstitute.com/2013/07/measurement-myopia/\">misattributed</a> to Peter Drucker, this concept forms the foundation of the data-driven culture that just about every company lays claim to these days. The thing is, not all data are equal, and being data-driven <a href=\"http://numeratechoir.com/your-metrics-are-bad-and-why-data-driven-isnt-enough/\">isn’t enough</a>.</p>\n<p dir=\"ltr\">It’s been almost four years since Eric Ries <a href=\"http://www.startuplessonslearned.com/2009/12/why-vanity-metrics-are-dangerous.html\">called BS</a> on vanity metrics, yet they still persist in many companies’ dashboards. So what’s the big deal? Running your company based on bad metrics will likely get you in more trouble than having no metrics at all.</p>\n<p dir=\"ltr\">Let’s say that you and your team are committed to focusing only on actionable metrics. That leaves you deciding between CAC, ARPU, MRR, LTV and other fun acronyms. So which metrics should comprise your KPIs? Using the concept of the one metric that matters (OMTM), <a href=\"http://leananalyticsbook.com/one-metric-that-matters/\">described nicely</a> by the authors of <a href=\"http://leananalyticsbook.com/\">Lean Analytics</a>, the answer depends on your business model and what stage your company is in. Put another way, as your business evolves over time, the metric(s) most closely tied to the success of that business does/do also.</p>\n<p dir=\"ltr\">Early-stage start-ups in search of a simpler metrics framework would do well to (re)read Marc Andreessen’s seminal <a href=\"http://blog.jedchristiansen.com/pmarcaarchive/the-pmarca-guide-to-startups-part-4-the-only\">blog post</a> on product/market (P/M) fit. Spoiler alert: it’s the only thing that matters. As such, trying to measure lifetime value (LTV) or focusing on customer acquisition cost (CAC) at this stage is probably not the best use of your time. Instead, you—and by that I mean everyone in your organization—should obsess over P/M fit: do you have a product or service that customers actually want to use?</p>\n<p dir=\"ltr\">How do you determine whether you’ve achieved P/M fit? In his post, Andreessen states, “...you can always feel product/market fit when it’s happening.” Making a more objective assessment can be non-trivial, though I’m partial to the survey approach Sean Ellis <a href=\"http://www.startup-marketing.com/the-startup-pyramid/\">devised</a> to assess whether customers find real value in a product or service. You can think of P/M fit in the context of engagement: are your customers using your product on a regular, ongoing basis? Measuring engagement is therefore another way to evaluate your P/M fit (using a metric that’s most relevant to you business).</p>\n<p dir=\"ltr\">Let’s go beyond P/M fit and look at some other metrics that may be key to your business (again, depending on your model and stage) and how they’re calculated:</p>\n\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Churn rate (r)</p>\n\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Some choose to focus on retention rate, which is calculated as 1 - r</p>\n</li>\n</ul>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Conversion rate (CR)</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Customer acquisition cost (CAC), or subscriber acquisition cost (SAC)</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Average revenue per user (ARPU)</p>\n\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">SaaS businesses tend to focus instead on monthly recurring revenue (MRR)</p>\n</li>\n</ul>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Lifetime value (LTV), sometimes referred to as lifetime customer value (LCV)</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Average customer lifetime (ACL)</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Churn Rate</strong></p>\n<p dir=\"ltr\">Churn is most relevant to subscription businesses and while calculating it seems trivial, the reality is a bit more complex. As it is a rate, churn is considered over a period of time, usually monthly or annually. As the analytical folks at Shopify <a href=\"http://www.shopify.com/technology/4018382-defining-churn-rate-no-really-this-actually-requires-an-entire-blog-post\">explain</a>, one of the simplest way to represent churn rate is:</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"http://500.co/wp-content/uploads/2013/10/churn-rate-formula-1.png\"><img class=\"aligncenter  wp-image-1116729985\" alt=\"churn rate formula 1\" src=\"/backup/churn-rate-formula-1-1024x76-2013-10-15-13-10-25.png\" width=\"717\" height=\"53\" /></a></p>\n<p dir=\"ltr\">However, this formula doesn’t yield comparable results for periods of different length (monthly vs. quarterly vs. annually). Though slightly more complex, the following formula produces current, timely, and comparable churn rates (in this case, for a period of 30 days).</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"http://500.co/wp-content/uploads/2013/10/churn-rate-formula.png\"><img class=\"aligncenter  wp-image-1116729987\" alt=\"churn rate formula\" src=\"/backup/churn-rate-formula-1024x129-2013-10-15-13-10-25.png\" width=\"737\" height=\"93\" /></a></p>\n<p dir=\"ltr\"><strong>Conversion Rate</strong></p>\n<p dir=\"ltr\">Any call to action involves a funnel of behavior that the user is expected to pass through in order to complete the CTA. Conversion rate lets you quantify the effectiveness of your funnel and is simply calculated by dividing the number of users who converted by the number of users you started with at the top of the funnel e.g., number of landing page visitors.</p>\n<p dir=\"ltr\"><strong>Customer Acquisition Cost</strong></p>\n<p dir=\"ltr\">To calculate CAC, divide your sales and marketing expenses by the number of acquired users. Sounds simple, but there are some nuances to consider. First, to get a true sense of the full CAC your the numerator should include variable as well as fixed costs, salaries and overhead expenses, for example. Second, if your business model features a free trial, remember that an acquired user is equivalent to a paying user i.e., you have to factor in dropoff from free trial users who don’t convert to paying. As your company get far enough along where you can also confidently calculate LTV (described below), you’ll want to consider the ratio of CAC to LTV, which <a href=\"http://lsvp.com/2010/07/19/how-to-estimate-lifetime-value/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%253A+lightspeedblog+%2528Lightspeed+Venture+Partners+Blog%2529/\">VCs</a> and others suggest should be in the 25% - 35% range.</p>\n<p dir=\"ltr\"><strong>Average Revenue Per User</strong></p>\n<p dir=\"ltr\">ARPU is a relatively straight-forward metric that is calculated by dividing total revenue in a period by the number of purchasing customers during that time. SaaS or subscription businesses tend to prefer looking at monthly recurring revenue (MRR), which requires separating revenue generated by recurring customers from that generated by new customers, and serves as a complement of sorts to churn.</p>\n<p dir=\"ltr\"><strong>Lifetime Value</strong></p>\n<p dir=\"ltr\">LTV is a semi-controversial metric that has <a href=\"http://www.forbes.com/sites/bruceupbin/2012/08/30/the-dangerous-seduction-of-the-lifetime-value-ltv-formula/\">prominent critics</a> and <a href=\"http://www.forbes.com/sites/jjcolao/2012/09/13/a-dangerous-seduction-revisited-in-defense-of-the-lifetime-value-ltv-formula/\">proponents</a>. Keep in mind that early-stage start-ups e.g., those having less than 12 months of customer data, will be challenged to calculate an accurate LTV. As Bill Gurley <a href=\"http://www.forbes.com/sites/bruceupbin/2012/08/30/the-dangerous-seduction-of-the-lifetime-value-ltv-formula/\">points out</a>, it’s a tool, not a strategy. LTV can serve as a gauge for how effectively you’re acquiring and monetizing customers, but it’s not the end-all metric to grow your business by. The LTV formula Gurley speaks to is written as:</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"/backup/LTV-formula-2013-10-15-13-10-25.png\"><img class=\"aligncenter  wp-image-1116729989\" alt=\"LTV formula\" src=\"/backup/LTV-formula-2013-10-15-13-10-25.png\" width=\"553\" height=\"128\" /></a></p>\n<p dir=\"ltr\">Where Costs represents the annual costs required to support a customer during the given period, SAC is equivalent to CAC, and WACC, weighted average cost of capital, factors the time value of money over the course of the users lifetime i.e., a dollar earned today is worth more than one earned a week from now.</p>\n<p dir=\"ltr\">Start-ups are probably best off using a simpler version of this formula where LTV = ARPU - CAC. Arguably less rigorous, this formula can simplify LTV-based decision making and also <a href=\"http://mobiledevmemo.com/should-lifetime-customer-value-lcv-be-discounted/\">reflects the reality</a> that start-ups generally don’t/can’t access capital markets to deploy capital.</p>\n<p dir=\"ltr\"><strong>Average Customer Lifetime</strong></p>\n<p dir=\"ltr\">In order to determine LTV, one must know a user’s (or a cohort’s) average lifetime. For example, a 5% monthly churn rate corresponds to a 20 months ACL.</p>\n<p dir=\"ltr\"><strong>A Final Note</strong></p>\nDefining your business’ key metrics is non-trivial, as is the challenge of calculating them correctly. No two populations of users are the same, and understanding true customer behavior requires segmentation and cohort analyses in order to avoid the <a href=\"http://blog.custora.com/2011/08/why-average-retention-rates-can-lead-to-50-error-in-clv/\">pitfalls</a> of using averages.\n<h1></h1>\n<h1><b>What's Next?</b></h1>\nIf you enjoyed this post, first check out these additional resources for how you can up your game from the 500 Distribution team:\n<ul>\n\t<li><a href=\"http://500.co/2014/03/13/5-distro-experiments-you-can-do-on-10-or-less/\">5 Distribution Experiments You Can Do For $10 Or Less</a></li>\n\t<li><a href=\"http://500.co/2014/03/24/how-we-doubled-our-conversion-rate-bombfell/\">How We Doubled Our Conversion Rate - Bombfell Co-Founder Bernie Yoo</a></li>\n\t<li><a href=\"http://500.co/2013/08/13/how-to-suck-less-at-e-mail-marketing/\">How to Suck Less at Email Marketing</a></li>\n\t<li><a href=\"http://500.co/2013/10/25/the-power-of-trigger-emails/\">The Power of Trigger Emails</a></li>\n</ul>\nThen, sign up to get a daily bite-sized distro hack (and one awesome GIF) delivered to your inbox:\n\n<b>&gt;&gt; </b><a href=\"http://eepurl.com/BfYXn\"><b>Subscribe to Distrosnack here</b></a><b> &lt;&lt;</b>",
    "type": "post",
    "path": "/2013/10/15/startup-metrics-dont-let-your-sac-get-wacc/",
    "backgroundImage": "/backup/graph-960x540-2013-10-15-13-10-25.png"
}