{
    "title": "Startup Marketing Strategy With SEO As Its Core",
    "slug": "startup-marketing-strategy-with-seo-as-its-core",
    "date": "2013-10-01T17:05:00.000Z",
    "url": "http://500.co/?p=1116729815",
    "uri": "http://500.co/2013/10/01/startup-marketing-strategy-with-seo-as-its-core/",
    "postId": "1116729815",
    "description": "",
    "images": [
        "http://tonyadam.com/blog/blog/wp-content/uploads/google-match-type.png",
        "http://tonyadam.com/blog/blog/wp-content/uploads/pre-seourl-example.jpg",
        "http://tonyadam.com/blog/blog/wp-content/uploads/post-seo-url-example.jpg"
    ],
    "creator": "",
    "categories": [
        "distribution",
        "guest-post",
        "seo",
        "tony-adam-distribution"
    ],
    "content": "<em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em>\n\n<em>Guest Post by 500 Mentor <a href=\"http://tonyadam.com/blog/\">Tony Adam</a>, Founder &amp; CEO of <a href=\"http://eventup.com/\">Eventup</a> along with an advisor to multiple LA startups. Formerly of PayPal, Yahoo!, and most recently, Myspace. This blog post was <a href=\"http://tonyadam.com/blog/1186-startup-marketing-strategy-seo-core/\">originally published here</a>.</em>\n\n&nbsp;\n\n<img title=\"google-match-type\" alt=\"\" src=\"/backup/google-match-type-2013-10-01-13-12-05.png\" width=\"630\" height=\"300\" />\n\nIf you’ve ever started a brand new site, you’ll know that getting organic traffic is extremely difficult. Sure you can buy traffic through Adwords or various other media buys and/or you can use PR to get you spikes. The question I like to ask people is, do you have longevity? Developing a <a title=\"Holistic Marketing Strategy\" href=\"http://tonyadam.com/blog/1103-building-holistic-marketing-programs/\">holistic marketing strategy</a> should be your first and foremost priority because it will help guide you every step of the way. It will help you drive the decisions you make about the paid traffic, publicity, and how you use social.\n\n<strong>SEO is the “down in the trenches” traffic stronghold you can use as a baseline for traffic efforts.</strong>\n\nFor some reason, startups (and frankly, all businesses) don’t invest enough in organic search traffic from the beginning because it’s not a priority. I get it and understand it because when I started <a href=\"http://eventup.com/\">Eventup</a>, it wasn’t a priority for me either. The most important thing at the time was <strong>shipping product, launching the company and iterating</strong>.\n\nIt doesn’t mean we forgot about it entirely, we still built in some core principles from the SEO strategy I put together. The way we did this was adapting tactics into the product as we built it. As you’re defining the core infrastructure of your site, can you define SEO alongside that? <strong>The answer is obviously, YES.</strong>\n\nFor example, let’s look at a case study where we didn’t have the time to think of all the URL variations for getting the site up and running pre-launch. We got it up so we could start signing up venues, start seeding it, and talking about it to friends.\n\nIn December 2011 we had 74 unique keywords driving traffic:\n<a href=\"/backup/pre-seourl-example-2013-10-01-13-12-05.jpg\"><img title=\"pre-seourl-example\" alt=\"\" src=\"/backup/pre-seourl-example-2013-10-01-13-12-05.jpg\" width=\"341\" height=\"40\" /></a>\n\nIn February 2012, we updated the URL structure and our long tail traffic went up an order of magnitude (10x) literally. The thing is, we know it was not just because of the launch buzz, because it wasn’t just traffic, as you can see, it was number of unique keywords driving traffic.\n<a href=\"/backup/post-seo-url-example-2013-10-01-13-12-05.jpg\"><img title=\"post-seo-url-example\" alt=\"\" src=\"/backup/post-seo-url-example-2013-10-01-13-12-05.jpg\" width=\"350\" height=\"39\" /></a>\n<h2>Putting SEO into Practice</h2>\nFor someone like me, it really isn’t that difficult to get the basic SEO best practices built into the site architecture. I’ve seen the variations for startups and small businesses to high volume sites like <a href=\"http://sports.yahoo.com/\">Yahoo! Sports</a> to <a href=\"http://myspace.com/\">Myspace</a>.\n\nThat said, not every startup or company has someone that has spent 10+ years doing various forms of Online Marketing. I figured I would put together some of the stuff that I put together for either businesses I create or clients that I’ve worked for.\n<h2>Keyword Research (and Assessment)</h2>\nThis should be the first step of everything you do. I know it sucks, it’s tedious, it’s time consuming, but, if you have no idea what your audience, users, or customers will be looking for, you’ll be left in the dark. Developing a solid set of keyword research is essential. Start by thinking of your topic as a whole and asking yourself, what do users search for. My favorite example of this is the automotive space, because, let’s be honest, how many times have searched for “automotive” or “automobile” — that’s right, you haven’t — because people search for “cars”.\n\nI wrote about <a href=\"http://tonyadam.com/blog/71-an-understanding-of-seo-keyword-research/\">SEO keyword research</a> 5 years ago and to this day it’s a good starting point for how I do keyword analysis and breakdown what my audience is looking for. Putting this definition together is the core of everything I do going forward in my SEO requirements, definitions, and guidelines for content on the site.\n\n<strong>Bonus: </strong>For clients, I like to put together an “Assessment” or analysis as well that gives them a breakdown of not only the keywords, but the competition they will face in search (and, only search) and what steps it will take to rank for those keywords. If you have the ability to do this, it can help you make decisions going forward.\n<h2>On-Page SEO</h2>\nOn-Page SEO consists of a variety of things like your page structure, the keywords you use in the content of your site, the page meta data, etc. While a lot of these tactics are debated very widely amongst folks in the “SEO Industry” I believe there is one core tenant that will always remain true: <strong>relevancy</strong>. The pages you create should be relevant to anyone and everyone, and, when a new visitor comes to your site, they should understand EXACTLY what they are looking at. Search engines work in the same way, when they look at a page and see common themes, that page then becomes relevant for that theme, or in this case, keyword or key phrase.\n\nI’ve written an article on Core On-Page SEO principles, but, at a high level, there are a few things that you’ll be building into your site anyway, that you can quick define (and if needed, iterate on) when launching your site.\n<ul>\n\t<li><i></i><strong>Page Title:</strong>Arguably the most important of the on-page SEO elements this is important in defining the relevancy of your page, it’s generally one of the first pieces of content you see in your HTML documents markup and what a crawler will use to define that page. Here is a baseline template I’ve used for Football player names (variations depend on the content/industry):\n<blockquote>%Player Name% Stats, News, Highlihts | %Team Name% | %Brand Name%</blockquote>\n</li>\n\t<li><i></i><strong>URL:</strong>Another element that you’re going to need to create a template for in some way, so, make sure this is very similar to your page title and H1 on the page to create consistent and relevant naming scheme. For URL templates, it really depends but, if we assume the above example:\n<blockquote>http://domain.com/nfl/player/%playername-id%</blockquote>\n</li>\n\t<li><i></i><strong>Headings:</strong>Debated by many but still generally a good practice to have a very well structured set of headings from a semantic standpoint. I will usually have my main keyword in the H1 of the page and sub keywords in the subsequent H#’s on the page. Again, sticking with the same example in the URL and Page Title:\n<blockquote><code>%Player Name%</code></blockquote>\n</li>\n</ul>\nAt the end of the day if your Page Title, URL, and Headings are very relevant to one another, you have a good baseline for content. Yes, these are basic SEO principles, but, if you have a page about the “Chicago Bulls” and it is not mentioned in any of those elements, no matter how many links you get or tactics you try, you’re not going to see the traction needed because that page is not relevant.<strong>Relevancy is key.</strong>\n<h2>Content Marketing</h2>\n<strong>Start writing content. Seriously. I’m not kidding.</strong>\n\nGet <a href=\"http://wordpress.org/\">WordPress</a> set up as your blog, preferably as a subfolder (e.g. tonyadam.com/blog) or as a subdomain (e.g. blog.eventup.com). Start by writing a blog post weekly. Increase it to a couple blog posts a week on Tuesdays and Thursdays. Before you know it, you’ll be up at writing multiple posts per week and hopefully daily.\n\nThe reason this is important is because you want to be domain relevant for the market you are working within. The more content you create, the more relevant you become for that topic. The more people read that content, the more relevant you become. The more people search for you and that topic, the more relevant you become. If you’ll notice, there is one consistent element here: <strong>Relevance</strong>. The key is becoming the most relevant around a given topic as a whole. When your domain becomes relevant around a given topic, it is that much easier to rank and drive traffic for keywords related to it.",
    "type": "post",
    "path": "/2013/10/01/startup-marketing-strategy-with-seo-as-its-core/",
    "backgroundImage": "/backup/search-960x540-2013-10-01-13-12-05.png"
}