{
    "title": "Still A Lot Of Love In Your Inbox",
    "slug": "still-a-lot-of-love-in-your-inbox",
    "date": "2010-11-20T05:05:24.000Z",
    "url": "http://blog.500startups.com/?p=1116714508",
    "uri": "http://500.co/2010/11/19/still-a-lot-of-love-in-your-inbox/",
    "postId": "1116714508",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/11/Dave-McClure-and-Josh-Seligstein-300x152.png",
        "http://500.co/wp-content/uploads/2010/11/inboxlovetables-300x224.jpg",
        "http://500.co/wp-content/uploads/2010/11/Gabor-Cselle-150x150.png",
        "http://500.co/wp-content/uploads/2010/11/inboxlovemenu-225x300.jpg"
    ],
    "creator": "",
    "categories": [
        "awayfind",
        "ben-gross",
        "bijan-marashi",
        "dave-crocker",
        "events",
        "events",
        "facebook",
        "gabor-cselle",
        "george-bilbrey",
        "google",
        "google-wave",
        "guest-posts",
        "imap",
        "inbox-love",
        "jared-goralnick",
        "joel-seligstein",
        "joshua-baer",
        "otherinbox",
        "rapportive",
        "remail",
        "return-path",
        "sendgrid",
        "stephanie-hannon",
        "xoopit"
    ],
    "content": "<em>Posted by <a href=\"http://twitter.com/technotheory\" target=\"_blank\">Jared Goralnick</a>, founder of <a href=\"http://awayfind.com\" target=\"_blank\">AwayFind</a>. In addition to being a 500 Startups Founder, he is also one of our SuperMentors.</em>\n\n<a href=\"http://500.co/wp-content/uploads/2010/11/Dave-McClure-and-Josh-Seligstein.png\"><img class=\"alignnone size-medium wp-image-1116714509\" title=\"Dave McClure and Josh Seligstein\" src=\"/backup/Dave-McClure-and-Josh-Seligstein-300x152-2010-11-19-10-23-05.png\" alt=\"\" width=\"300\" height=\"152\" /></a>\n\nLast night 80 people gathered to talk about email at the launch event for <a href=\"http://www.inboxlove.com/\" target=\"_blank\">Inbox Love</a>.  Turns out that this bleeding-edge 1970’s technology is still in use.  I was lucky enough to organize this alongside <a href=\"http://500startups.com\" target=\"_blank\">500 Startups</a> and <a href=\"http://www.otherinbox.com/\" target=\"_blank\">OtherInbox</a>’s <a href=\"http://twitter.com/joshuabaer\" target=\"_blank\">Joshua Baer</a>.  We’ll be back together in the spring for a full day, action-oriented event in the Spring.  Stay tuned.\n\n<a href=\"http://500.co/wp-content/uploads/2010/11/inboxlovetables.jpg\"><img class=\"alignnone size-medium wp-image-1116714517\" title=\"inboxlovetables\" src=\"/backup/inboxlovetables-300x224-2010-11-19-10-23-05.jpg\" alt=\"\" width=\"300\" height=\"224\" /></a>\n\nHere’s a quick a rundown, and some of my own thoughts on the email space today.\n<h3>The Rundown</h3>\nWe met up at Google’s Building 40, had some drinks and snacks, and then sat down for a series of 5-minute Ignite format talks.  Between the talks we had moderator-led discussions at our tables over dinner.  Here were the talks from the evening:\n<ul>\n\t<li><a href=\"http://twitter.com/twephanie\" target=\"_blank\">Stephanie Hannon</a>, the former Product Manager of Google Wave (now PM at YouTube) explained what went wrong and offered lessons-learned from Google Wave.  High email-killing expectations and an ecosystem that didn’t have all the people we communicate with were some of the challenges.</li>\n\t<li><a href=\"http://twitter.com/bengross\" target=\"_blank\">Ben Gross</a>, a Researcher at the Highlands Group and Editor at Messaging News, explained many of the myths about the connection between identity and email.  We learned that some people have many email addresses and that the technical audience in the room may have a bit to learn about designing tools for how people segment their email identities.</li>\n\t<li>George Bilbrey, President of <a href=\"http://www.returnpath.net/\" target=\"_blank\">Return Path</a>, discussed what he’s seen as trends in spam and the challenges we face with graymail, (also known as bacn)—the stuff you signed up to receive but may or may not want in your inbox.  He also offered suggestions for where email may be headed.</li>\n\t<li><a href=\"http://www.linkedin.com/in/bmarashi\" target=\"_blank\">Bijan Marashi</a>, co-Founder of Xoopit (which was acquired by Yahoo), told all of the startups in the room that they had their work cut out for themselves.  He outlined the challenges in an email startup, from the difficulties entering a platform to the conflicting interests between the large email providers and small startups regarding both advertising and holding user attention.</li>\n\t<li><a href=\"http://500.co/wp-content/uploads/2010/11/Gabor-Cselle.png\"><img class=\"alignright size-thumbnail wp-image-1116714510\" title=\"Gabor Cselle\" src=\"/backup/Gabor-Cselle-150x150-2010-11-19-10-23-05.png\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://twitter.com/gabor\" target=\"_blank\">Gabor Cselle</a>, whose company, ReMail, was purchased by Google, where he now works on the Gmail team, explained what was wrong with IMAP and what should be changed.  He explained his proposal for ReMap in a technical but very clear presentation.</li>\n\t<li><a href=\"http://www.bbiw.net/index.html\" target=\"_blank\">Dave Crocker</a>, who was one of the founders of the specifications for email, offered us perspective on how email has iterated (or hasn’t) to where it is today.</li>\n</ul>\nFollowing these chats Dave McClure of 500 Startups interviewed Facebook’s <a href=\"http://www.facebook.com/joel\" target=\"_blank\">Joel Seligstein</a> about the new Facebook communications platform.  Why no IMAP yet?  Why were some of the invitations pulled back?  How is the namespace being handled?  Everyone was interested in what Facebook is (or isn’t) doing with email.  Or whatever they call it…\n\n<a href=\"http://500.co/wp-content/uploads/2010/11/inboxlovemenu.jpg\"><img title=\"inboxlovemenu\" src=\"/backup/inboxlovemenu-225x300-2010-11-19-10-23-05.jpg\" alt=\"\" width=\"225\" height=\"300\" /></a>\n<h3>The Email Space</h3>\nPeople flew in from all over the US to discuss email and talk about its future.  Though email clients today may do a good job fighting off spam, there’s still room for improvement in the tools where most of us spend half our working days.\n\nBijan was skeptical of the business models for email startups, but in further discussions, he was more skeptical of the viability of consumer email-oriented businesses, or tools that are more niche-features than full-out products.  Within the 500 Startups family, both my company (<a href=\"http://www.awayfind.com/\" target=\"_blank\">AwayFind</a>) and <a href=\"http://www.rapportive.com/\" target=\"_blank\">Rapportive</a> are examples of startups much more focused on business-oriented solutions.  Businesses like <a href=\"http://www.otherinbox.com/\" target=\"_blank\">OtherInbox</a> (which is more consumer-oriented) have done what Bijan suggested as necessary—developing strong relationships with email platforms like Gmail and Yahoo! Mail.  And <a href=\"http://www.sendgrid.com/\" target=\"_blank\">SendGrid</a> is in a very different place altogether with email—providing developers and businesses a way to reliably deliver transactional messages (i.e., it doesn’t rely on email providers for distribution).\n\nEmail is used by virtually everyone.  The major email providers are improving their distribution mechanisms for developers.  And whether it be through CRM, productivity, deliverability, collaboration, unified communications, or the underpinnings of email itself, there’s room for innovation.\n<h3>Back in the Spring</h3>\nI’m super excited to work again with Josh and the 500 Startups team to put on a full day event focused around email.  We all have a love-hate relationship with our inbox, but there are ways to make our experience more of the former than the latter.  Stay tuned for more on the Inbox Love conference!\n\nNow back to my email…",
    "type": "post",
    "path": "/2010/11/19/still-a-lot-of-love-in-your-inbox/"
}