{
    "title": "The Elevator Pitch",
    "slug": "the-elevator-pitch",
    "date": "2011-02-01T08:54:08.000Z",
    "url": "http://blog.500startups.com/?p=1116714917",
    "uri": "http://500.co/2011/02/01/the-elevator-pitch/",
    "postId": "1116714917",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/02/the-highlander-71-150x150.jpg",
        "http://500.co/wp-content/uploads/2011/02/elliotloh-150x150.jpg"
    ],
    "creator": "",
    "categories": [
        "elevator-pitch",
        "elliot-loh",
        "guest-posts",
        "highlander",
        "mentors",
        "mentors",
        "pitches",
        "tips"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/02/the-highlander-71.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714920\" title=\"the-highlander-7\" src=\"/backup/the-highlander-71-150x150-2011-02-01-11-02-54.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2011/02/elliotloh.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714918\" title=\"Elliot Loh, 500 Startups Mentor\" src=\"/backup/elliotloh-150x150-2011-02-01-11-02-54.jpg\" alt=\"Elliot Loh, 500 Startups Mentor\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet The Highlander, aka 500 Mentor <a href=\"https://twitter.com/#!/elliotloh\" target=\"_blank\">Elliot Loh</a>. Elliot is an entrepreneur in search of the next big thing. Most recently, he played several roles at Geni, starting as a design/product co-founder and finishing as COO. While at Geni, Elliot prototyped Yammer, which went on to win TechCrunch50. Prior to Geni, he was the original designer at Tribe. A Stanford graduate, Elliot began with HCI at Trilogy and helped spin out their recruiting operations into CollegeHire. He enjoys building what he designs, hacking recipes, and writing reverse-chronologically in the third person. </em><em>Elliot's post below was <a href=\"http://startingup.is/the-elevator-pitch\" target=\"_blank\">originally published here</a>.</em>\n\nLast night I attended the kickoff dinner for the inaugural <a title=\"500 Startups\" href=\"http://500startups.com/\" target=\"_blank\">500 Startups</a> accelerator program. There are seven companies in this first class, housed at the fund's headquarters on Castro Street in Mountain View. The night's main event was \"pitch practice\", where CEOs from five of those startups took the stage in front of about fifty fellow teammates and mentors. They were limited to three slides and a minute or two, after which we gave feedback and answered questions.\n\nPitching an idea isn't a skill you can perfect on your own. For one thing, you must get comfortable having an audience. That's why a group effort like an incubator is so valuable: it provides the opportunity to screw up in front of friends, work out jitters, learn to hold a mic, and generally become an effective conduit for relaying your idea.\n\nThe other half of this task is constructing a compact description of the opportunity and market. The goal is to be specifically memorable. Since investments are rarely an individual decision, the usual best outcome for a pitch is that it can be repeated by others, accurately. Here's my take on how to get there, as <a title=\"Elliot Loh's answer to How do I write an effective elevator pitch? - Quora\" href=\"http://www.quora.com/How-do-I-write-an-effective-elevator-pitch/answer/Elliot-Loh\" target=\"_blank\">originally answered on Quora</a>:\n\n<hr /><strong><a title=\"Elliot Loh's answer to How do I write an effective elevator pitch? - Quora\" href=\"http://www.quora.com/How-do-I-write-an-effective-elevator-pitch/answer/Elliot-Loh\" target=\"_blank\">How do I write an effective elevator pitch?</a></strong>\n\nI think of an elevator pitch as more of a state of mind than an actual script. But if I had to propose a formula, it would look something like this:\n<blockquote>We solve <strong>[problem]</strong> by providing<strong>[advantage]</strong>, to help <strong>[target]</strong> accomplish<strong>[target’s goal]</strong>.</blockquote>\nDepending on the stage you've reached, you might follow it up with a second sentence about your business model:\n<blockquote>We make money by charging <strong>[customers]</strong> to get <strong>[benefit]</strong>.</blockquote>\nSo for Geni, I used to say, \"We solve the problem of genealogy by matching possible relatives, to help genealogists create one accurate world family tree. We make money by charging enthusiasts for enhanced search and other premium features.\" For Yammer, the pitch might be, \"We make companies more efficient by providing a live feed of comments and questions, so employees can find answers more quickly. We make money by charging companies that want administrative control on their employee networks.\" (Note that I no longer work for either company, so my examples shouldn't be taken to represent them.)\n\nMy approach tends toward simplicity. In an elevator or conference environment, you only have a moment to deliver your pitch. Best to craft a clear statement that can lead to a question by the receiver. And for that question, you should have plenty of material lined up to demonstrate value:\n<ul>\n\t<li>You're the first to do this, or</li>\n\t<li>Why you're different and therefore better than similar products</li>\n\t<li>Why your market is worth pursuing</li>\n\t<li>How much traction you have</li>\n\t<li>Why this is difficult for others but easy for your team</li>\n\t<li>etc.</li>\n</ul>\nAs others have said, this is something that should be expressed rather than memorized. If you are passionate about your product, this will probably be a matter of whittling your message down, rather than building it up.",
    "type": "post",
    "path": "/2011/02/01/the-elevator-pitch/"
}