{
    "title": "The Phone Number is Dead – Voice Over IP Demystified",
    "slug": "the-phone-number-is-dead-voice-over-ip-demystified",
    "date": "2013-03-08T02:43:22.000Z",
    "url": "http://500.co/?p=1116726229",
    "uri": "http://500.co/2013/03/07/the-phone-number-is-dead-voice-over-ip-demystified/",
    "postId": "1116726229",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/03/danny-speek-full-shot-headshot-226x300.jpg"
    ],
    "creator": "",
    "categories": [
        "guest-posts",
        "mentors",
        "platforms",
        "pots",
        "pstn",
        "startups",
        "telephony",
        "voip",
        "webrtc"
    ],
    "content": "Facebook <a href=\"http://blogs.wsj.com/digits/2013/01/16/the-facebook-phone-might-already-be-here/\">recently announced</a> that Facebook Messenger would let users call each other through VoIP.  Microsoft bought Skype. Google has both Google Voice and Google Talk.  And the recent emergence of <a href=\"http://webrtc.org/\">WebRTC</a> is finally warming the waters for the web nerds among us to dip our toes in the stagnant waters of telecom.\n\nLet’s face it – Voice over IP Is becoming ubiquitous, and the phone number’s days are, well, numbered.\n\nAt my startup <a href=\"http://www.speek.com/\">Speek</a>, we’re fixing the <a href=\"http://www.speek.com/\">conference call</a>. In order to do this, we must dwell in both the web and telephony worlds. This means we must have an intimate understanding of traditional telephony as well as emerging Voice over IP technologies and trends.\n\nI’d like to simplify the VoIP world that is a black box to most startup junkies, technical and nontechnical alike.\n\nBefore we start, let me properly set expectations: If you think the world of web technology is hard to wrap your head around, telecom tech will make your head spin. Allow me to introduce you to the world of Voice over IP (VoIP) and telephony:\n\n<strong>The Public Telephone Network (PSTN or POTS)</strong>\n\nThe public switched telephone network (PSTN), is actually more easily understandable under the other acronym by which it is commonly known: POTS, or “plain old telephone service.” This is what most people, especially if those people are your parents, think of as “the telephone”: it consists of all phone lines, cell networks, undersea phone cables, etc. which are connected by switching centers (the electronic exchanges that do what operators do in any movie filmed in black and white). Originally analog, the PSTN now has an almost entirely digital chewy center.\n\n<strong>Translation:</strong> When you dial a phone number of any kind, your call passes through the public telephone network. It doesn’t matter if you’re calling from your home phone, office phone or mobile phone. Note that while the public telephone network revolves around the concept of a phone number, apps like Skype that “call” using usernames rather than phone numbers most likely do not leverage the public telephone network.\n\nAs phone number-less VoIP adoption increases the demand on the PSTN decreases. This is good.\n\n<strong>Voice over IP (VoIP)</strong>\n\nVoIP (Voice over Internet Protocol) commonly refers to the anything and everything that allows for voice calls over the Internet, as opposed to through the PSTN. You may have also heard IP telephony, Internet telephony, voice over broadband (VoBB), broadband telephony, IP communications, and broadband phone. These basically all mean the same thing.\n\n<strong>Translation:</strong> If you’re talking to someone and did not use a phone number to reach him or her, you are most likely using VoIP. Common VoIP protocols and software that you may have heard of are SIP, RTMP, XMPP, Jingle, Skype, and Google Talk.\n\n<strong>Open Source Telephony Software </strong>\n\n<a href=\"http://www.asterisk.org/\">Asterisk </a>is software that allows connected telephones to make calls to one another, and to connect to other telephone services including the PSTN and VoIP. Its name comes from the asterisk symbol (*).\n\n<strong>Translation:</strong> Asterisk is open source software that lets you do cool stuff with telephony that was historically proprietary and/or hardware-based.  Mark Spencer, a smart telephony hacker guy, created asterisk in the late 90’s.  Some of the hacker guys who helped Mark thought he wasn’t doing it right; they left and created <a href=\"http://www.freeswitch.org/\">freeSWITCH</a>.\n\n<strong>WebRTC</strong>\n\n<a href=\"http://www.webrtc.org/\">WebRTC</a> is a free, open project that allows browser-to-browser applications to work easily without plugins.\n\n<strong>Translation:</strong> You know how bad it sucks to try and do real-time audio or video in a web browser using Flash? WebRTC makes it so that you no longer need to use Flash. You can now do things like VoIP and video chat natively inside the browser.\n\nGoogle essentially bought up many of the pieces needed for developers to do real-time voice and audio apps easily and directly within the browser and then open sourced them. Browsers have started to ship with full WebRTC API support built in. This will allow more and more communication products that leverage real-time video and/or audio to bake in a very clean and seamless user experience without requiring a download.\n\nWebRTC is f’ing awesome and you should get familiar with it.\n\n<strong>Traffic Pumping/Access Simulation</strong>\n\nWhen a long-distance call is made, the call usually passes through more than one telephone company, starting with a local carrier, which then transfers the call to a long distance company, which then re-transfers that call to the local carrier at the destination. The long distance companies have to pay a fee to the local carrier it places the call to, which is called an “access charge.” - <a href=\"http://www.fcc.gov/encyclopedia/traffic-pumping\">From the FCC</a>\n\nAccess stimulation, or “traffic pumping,” occurs when a local carrier does a shady deal with a company that runs a high volume of calls, such as chat lines, psychic and phone sex hotlines, or “free” conference calls. The local carrier gets a much higher volume of calls than it would without the arrangement, and in turn gives a kickback to that company. Does this sound like it should be illegal? Good news: it's becoming illegal.\n\n<strong>Translation:</strong>  Rural telecoms get paid money by the government for each phone call that is made into numbers in their area code. The original purpose was to help stimulate innovation in these rural areas. Free conference call companies and sex hotlines in the form of a “traffic pumping” scheme have misused this government policy. The scheme splits subsidized dollars with the rural telecom as the teleconference provider or phone sex line generates inbound calls. This money comes out of your pocket one way or another. Not cool.\n\nThankfully, the FCC recently adopted <a href=\"http://hraunfoss.fcc.gov/edocs_public/attachmatch/FCC-11-161A1.pdf\">rules designed to reduce the ability to engage in access stimulation</a>. Plus, you can’t have traffic pumping without phone numbers.   Chalk up yet another win for VoIP.\n\n<a href=\"http://500.co/wp-content/uploads/2013/03/danny-speek-full-shot-headshot.jpg\"><img class=\"alignleft size-medium wp-image-1116726233\" alt=\"danny speek full shot headshot\" src=\"/backup/danny-speek-full-shot-headshot-226x300-2013-03-07-13-20-43.jpg\" width=\"226\" height=\"300\" /></a>\n\n<b id=\"internal-source-marker_0.12722679460421205\"><em>Post contributed by Danny Boice.</em> </b><em>He is the CTO of <a href=\"http://www.speek.com/\">Speek</a> – a 500 Startups-funded startup that lets users do <a href=\"http://www.speek.com/\">conference calls</a> with a simple link (speek.com/YourName), rather than using phone numbers and PINs.  A serial startup/technology entrepreneur and executive, Danny started his career as a software engineer working for startups like Network Solutions and MusicMaker.com in the 90's. Danny founded his first company, Jaxara, in the early 2000s (exited via acquisition) and co-founded <a href=\"http://www.speek.com/\">Speek</a> with John Bracken in 2012. Danny attended Harvard.<b id=\"internal-source-marker_0.12722679460421205\">\n</b></em>",
    "type": "post",
    "path": "/2013/03/07/the-phone-number-is-dead-voice-over-ip-demystified/",
    "backgroundImage": "/backup/danny-speek-full-shot-headshot1-774x540-2013-03-07-13-20-43.jpg"
}