{
    "title": "The Original GEeks: How GE's CMO is Keeping the Geek Flame Alive",
    "slug": "the-original-geeks-how-ges-cmo-is-keeping-the-geek-flame-alive",
    "date": "2013-05-02T03:01:20.000Z",
    "url": "http://500.co/?p=1116727115",
    "uri": "http://500.co/2013/05/01/the-original-geeks-how-ges-cmo-is-keeping-the-geek-flame-alive/",
    "postId": "1116727115",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "beth-comstock",
        "ge",
        "general-electric",
        "innovation",
        "interviews",
        "marketing",
        "startups"
    ],
    "content": "<p dir=\"ltr\">As GE’s first CMO, Beth Comstock is the driving force behind their sales, marketing, and innovation-focused growth strategy. Beth was previously President of Integrated Media at NBC where she helped launch Hulu, one of the world’s biggest video-streaming services. Whether you're a bootstrapped startup trying to get noticed or, like GE, one of the largest companies in the world, Beth’s insights are invaluable for creative leaders.</p>\n<p dir=\"ltr\"><strong>As the CMO of GE, what is your social media marketing strategy?</strong></p>\n<p dir=\"ltr\">First, our social media strategy is one part of a larger digital ecosystem we’ve been building—you could call it a digital content factory. This approach recognizes the convergence of many types of media, with both brands and customers publishing their own content. The days when we had separate swimlanes are over. So it’s not just Facebook or Twitter—though both are big parts of our social presence—it’s different types of compelling content we tailor for those specific and other channels. We’re sharing on Google+, Instagram, Pinterest and YouTube, in addition to creating daily, original content on our own owned channels like GE Reports and Txchnologist (which then gets distributed socially and on third party blogs and news sites)</p>\n<p dir=\"ltr\">Second, business is social.  While social is essential to reaching consumers and for staying relevant as a brand, it’s also key to business and reaching our customers. New social media tools and platforms allow us to connect directly with our customers, from product ratings to reviews to customer communities where real time collaborating and innovating is happening. I’m also excited to see where opening up and social innovation takes us—we just announced an exciting partnership with Quirky, for example, a startup that hosts an online community of inventors who collaborate on designing and making consumer products and then bring them to market quickly. GE is sharing hundreds of our most promising patents and seeing what the Quirky inventors can do with them. That’s social at the next level.</p>\n<p dir=\"ltr\"><strong>Can you share a social media marketing campaign that you are particularly proud of?</strong></p>\n<p dir=\"ltr\">GE Flyovers is one of my favorites. It was a three-week, behind-the-scenes experience at GE factories, where we captured aerial footage from the factory floor and let people vote on what they wanted to see and learn more about. People voted across all of the channels in our digital ecosystem: GE.com, Facebook, Twitter, Tumblr and Buzzfeed. At the end of it, the four videos earned over 500,000 total views. The lesson here is that people enjoy and engage with the world more when they can be an active party of the storytelling process, and this is one of the best examples of collaborative storytelling with our audiences.</p>\n<p dir=\"ltr\">I think it’s also important to remember the value of content. For GE Reports, we did a video interview with Nick Holonyak, who invented the technology that made the LED light possible, back in the 1950s when he was working at GE. Nick’s funny, inspirational a great storyteller. With smart distribution and sharing, the video took on a life of its own, peaking at the number 23 overall story on Reddit and getting over 100,000 views on YouTube in less than 24 hours. Viewers left over 100 comments on YouTube as well during that first day, celebrating a titan of 20th century science. People want to be informed and entertained, and we’re able to do that as a brand directly now.</p>\n<p dir=\"ltr\"><strong>As the leader of GE’s venture arm, what are some of the key things you look for when considering partnering with or investing in startups?</strong></p>\n<p dir=\"ltr\">My job as a marketer at GE is to act as a translator of sorts. I need to connect the dots between the different parts of our company and connect GE to trends and new markets in the world. So I’m looking for promising new technology or applications that fit with our many areas of expertise.</p>\n<p dir=\"ltr\">GE has scale, vast resources and knowledge. Startups have great ideas and work and iterate fast, so whenever there is an opportunity to marry that speed and scale, we’re looking to seize it. Take Oblong Industries, an LA-based startup that makes multi-touch interfaces (think Minority Report). Oblong attracted our attention during an open innovation challenge related to the smart grid. The company had never worked in energy, but we felt they could help us visualize the smart grid. That’s when we were able to fund a proof of concept pilot and go from there to a more formal partnership.</p>\n<p dir=\"ltr\"><strong>What advice would you give bootstrapped entrepreneurs?</strong></p>\n<p dir=\"ltr\">It’s important for entrepreneurs and innovators to remember why and how people USE technology. Does it make their lives better or worse? What big problem does it solve? Sometimes I think we can get too bogged down in the tech itself, even tech for tech’s sake. Always think about the user and what the tech will do for them.</p>\n<p dir=\"ltr\">Finally, we’re all data scientists now. We think the next big wave of innovation is going to happen as the world’s millions of machines continue to come online. People call this the “Internet of Things;” We call it the “Industrial Internet.” What can we learn from the flood of data generated when jet engines, medical devices and gas turbines get connected? How can we visualize it and then harness it to make things run more efficiently, save money, reduce emissions, you name it? We need more entrepreneurs who are answering these questions.</p>",
    "type": "post",
    "path": "/2013/05/01/the-original-geeks-how-ges-cmo-is-keeping-the-geek-flame-alive/",
    "backgroundImage": "/backup/BETH-960x540-2013-05-01-13-22-01.jpg"
}