{
    "title": "The Power of Trigger Emails",
    "slug": "the-power-of-trigger-emails",
    "date": "2013-10-25T19:49:59.000Z",
    "url": "http://500.co/?p=1116730057",
    "uri": "http://500.co/2013/10/25/the-power-of-trigger-emails/",
    "postId": "1116730057",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "distribution",
        "distribution",
        "email",
        "marketing",
        "reactivation-emails",
        "trigger-email"
    ],
    "content": "<p dir=\"ltr\"><em>This post is part of the ongoing Distribution  series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em></p>\n<p dir=\"ltr\"><strong>I hate getting emails from companies.</strong></p>\n<p dir=\"ltr\">With all the different ways for people to contact me nowadays, email is still one of the easiest and most personal, second only to my phone.</p>\n<p dir=\"ltr\">But I hate receiving emails from companies. To this very day, I am unrelenting when it comes to unsubscribing from any automated emails I receive. I’ll even mark an email as spam if it doesn’t include an easily visible one-click unsubscribe link.</p>\n<p dir=\"ltr\"><strong>At the same time, I’m pushing companies I work with to send more emails. Why? Because they work so damn well.</strong></p>\n<p dir=\"ltr\">A little more than a year ago I was arguing with my ex cofounder about not wanting to send our users any more emails. I couldn’t imagine anybody wanting to receive email from us, let alone gaining significant value from these emails. I was dead wrong. My previous cofounder started showing me replies and messages from our customers telling us how much they love their daily digest emails, weekly reports, and more. The notion of people gaining value and even enjoying receiving email was further validated by numerous 500 Startups mentors.</p>\n<p dir=\"ltr\">I realized that people outside of the tech industry receive a fraction of the emails we receive. The reason for this is clear - they sign up for a fraction of the web services we sign up for.</p>\n<p dir=\"ltr\"><strong>Emails work. They increase engagement, remind users to come back, push users further down funnels, and increase conversion rates.</strong></p>\n<p dir=\"ltr\">One of the easiest (and free) ways to convert more users into customers is by using funnel abandonment emails (aka trigger emails). The goal was simple - increase funnel conversion rate.</p>\n\n<h1 dir=\"ltr\">The Implementation</h1>\n<p dir=\"ltr\">Let’s look at a very simple example funnel - someone browses a site, clicks on a product description page, clicks “buy now,” fills out their credit card info, fills out their billing info, and then completes the purchase.</p>\n<p dir=\"ltr\">The goal of our trigger email in this example is to incentivize people who abandon the checkout funnel to come back and finish their purchase. A great way to do this is to incentivize users who have already expressed interest in a specific product with a minor discount.</p>\n<p dir=\"ltr\">But there’s a question we need to answer before we start implementing our trigger email: at what point are we asking for our user’s email addresses? If we ask for emails early in the funnel, our conversion rate early in the funnel will decrease. If we wait until the end of the funnel to ask for emails, we’ll only be sending trigger emails to the people who make it that far down the funnel.</p>\n<p dir=\"ltr\"><strong>My preference is to get email addresses as early as possible in the funnel. My reasons behind this are as follows:</strong></p>\n\n<ol>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Asking for emails early might decrease our conversion rate initially but the ability to send trigger emails and remarket to people who provide their emails far outweighs the drop in conversion rate.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">If someone is intent on purchasing our product, an email address field won’t be an inhibitor.</p>\n</li>\n</ol>\n<p dir=\"ltr\">So in our example, let’s insert a required email field after someone clicks “buy now.”</p>\n<p dir=\"ltr\">The next thing we need to do is make sure we are storing all of the necessary events in our analytics/email platform. I won’t go into too much detail about how exactly analytics/email should be implemented but we need to have a distinct event for each step of the funnel and a property for the time each step was completed.</p>\n<p dir=\"ltr\">Next, we need to set up our logic in our analytics or email platform that will send emails to our funnel abandoners. We can start with a general email to everyone who clicks “buy now” and enters their email address but doesn’t complete a purchase with a discount if they complete their purchase in the next 24 hours. This type of time-sensitive discount works extremely well.</p>\n<p dir=\"ltr\"><strong>Our email content can be dead simple, just text even. Here’s an example:</strong></p>\n<p dir=\"ltr\">===============================</p>\n<p dir=\"ltr\"><em>Hey {first_name},</em></p>\n<p dir=\"ltr\"><em>We noticed you were interested in {product_name} but weren’t quite ready to purchase. We wanted to let you know that we have a special offer for you that if you buy {product_name} in the next 24 hours, we’ll give you 5% off!</em></p>\n<p dir=\"ltr\"><em>Just {click here} and use promo code “5percent”.</em></p>\n<p dir=\"ltr\"><em>Enjoy!</em></p>\n<p dir=\"ltr\">===============================</p>\n<p dir=\"ltr\">The {click here} button can link to the checkout page of that specific product. And that’s it! You will be amazed at how many people will convert with a little nudging and a slight discount.</p>\n<p dir=\"ltr\">One thing to be weary of is training your customers to wait for the discount because they know it’s coming. This doesn’t happen often but just something to keep an eye out for it.</p>\n<p dir=\"ltr\">This example works extremely well for e-commerce products but what about services? If we slightly alter our email campaign, this works just as well for service products!</p>\n<p dir=\"ltr\">For example, let’s say we have a SaaS product that has a 8 step sign up process. If we track where each user drops off per step, we can send them very customized emails asking them to finish the next step in the funnel with more information how to do it and an offer to walk them through it over the phone.</p>\n<p dir=\"ltr\"><strong>Another option is reactivation emails.</strong></p>\n<p dir=\"ltr\">If you have a subscription business, each month people might unsubscribe for many reasons. Your goal should be to understand why they unsubscribed and to attempt to get them to subscribe once again. You can use trigger emails to accomplish this.</p>\n<p dir=\"ltr\">For example, you can send users a trigger email a few days after they unsubscribe asking why they unsubscribed. From this information you can improve your product or try to get that customer to subscribe again under the right circumstances. If a customer unsubscribed because they thought your product was too expensive, just offering them a 5% discount for a few months (if it makes business-sense) might be enough for them to continue being a customer.</p>\n<p dir=\"ltr\"><strong>Conclusion</strong></p>\n<p dir=\"ltr\">Email works very well, specifically highly tailored, event-driven email. Keep in mind who your customer is when determining how many emails to send and you are sure to see an increase in activation or engagement.</p>\nTrigger emails are especially potent because they take information you know about your customers to build meaningful emails and offers to your clients, potential clients, and lost clients.\n<h1><b>What's Next?</b></h1>\nIf you enjoyed this post, first check out these additional resources for how you can up your game from the 500 Distribution team:\n<ul>\n\t<li><a title=\"How to Suck Less at E-mail Marketing\" href=\"http://500.co/2013/08/13/how-to-suck-less-at-e-mail-marketing/\" target=\"_blank\">How to Suck Less at Email Marketing</a></li>\n\t<li><a href=\"http://500.co/2014/03/13/5-distro-experiments-you-can-do-on-10-or-less/\">5 Distribution Experiments You Can Do For $10 Or Less</a></li>\n\t<li><a href=\"http://500.co/2014/03/24/how-we-doubled-our-conversion-rate-bombfell/\">How We Doubled Our Conversion Rate - Bombfell Co-Founder Bernie Yoo</a></li>\n</ul>\nThen, sign up to get a daily bite-sized distro hack (and one awesome GIF) delivered to your inbox:\n\n<b>&gt;&gt; </b><a href=\"http://eepurl.com/BfYXn\"><b>Subscribe to Distrosnack here</b></a><b> &lt;&lt;</b>\n\n&nbsp;",
    "type": "post",
    "path": "/2013/10/25/the-power-of-trigger-emails/",
    "backgroundImage": "/backup/hate-828x540-2013-10-25-13-14-49.png"
}