{
    "title": "The Pleasure Principle: Not All Products Need To Be Painkillers",
    "slug": "the-pleasure-principle-not-all-products-need-to-be-painkillers",
    "date": "2011-01-11T02:49:52.000Z",
    "url": "http://blog.500startups.com/?p=1116714726",
    "uri": "http://500.co/2011/01/10/the-pleasure-principle-not-all-products-need-to-be-painkillers/",
    "postId": "1116714726",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/01/yogiprerna.jpeg"
    ],
    "creator": "",
    "categories": [
        "atlanta",
        "entertainment",
        "guest-posts",
        "ios",
        "ipad",
        "iphone",
        "khush",
        "ladida",
        "music",
        "musings",
        "parag-chordia",
        "prerna-gupta",
        "startups"
    ],
    "content": "<a href=\"/backup/yogiprerna-2011-01-10-11-20-49.jpeg\"><img class=\"alignnone size-full wp-image-1116714727\" title=\"yogiprerna\" src=\"/backup/yogiprerna-2011-01-10-11-20-49.jpeg\" alt=\"\" width=\"112\" height=\"142\" /></a>\n\n<a href=\"/backup/yogiprerna-2011-01-10-11-20-49.jpeg\"></a><em>We're excited to welcome <a href=\"http://www.khu.sh/\" target=\"_blank\">Khush</a> to the 500 Startups family! Khush develops the music-creation iPhone app <a href=\"http://itunes.apple.com/app/ladida/id326533688?mt=8\" target=\"_blank\">LaDiDa</a> which has been downloaded 270,000 times. Khush means “happy” in Hindi. </em><em>Below is a repost from TechCrunch which was written by Prerna Gupta, CEO and co-founder. You can follow her on Twitter at @<a href=\"http://twitter.com/prernagupta\" target=\"_blank\">prernagupta</a>. (Check out the <a href=\"http://techcrunch.com/2011/01/09/pleasure-products-painkillers/\" target=\"_blank\">original TechCrunch post</a> and <a href=\"http://techcrunch.com/2011/01/10/khush-lands-funding-to-help-wannabe-singers-create-music-on-the-go/\" target=\"_blank\">announcement</a>)</em>\n\nEarlier this year, my company advanced to the final stages of two prestigious start-up competitions. Both times, I got up on stage and <a href=\"http://www.youtube.com/ladidakhush\" target=\"_blank\">belted out my prezo</a> in C Major (our product is <a href=\"http://bit.ly/get_ladida\" target=\"_blank\">LaDiDa</a>, an iPhone app that <a href=\"http://www.cnn.com/video/#/video/living/2010/10/14/nr.iphone.app.tune.singing.cnn\" target=\"_blank\">helps bad singers make music</a>), and then backed up the singing with solid growth metrics on our business. The audience loved it, and LaDiDa was a crowd favorite to win in both contests. But when it came time for the judges’ feedback, I was frustrated to hear a familiar refrain: “Your demo is great, really cool app,” they said, “but we can’t give you this award because your product doesn’t solve any obvious pain point.”\n\nMost investors will tell you to never walk into a meeting without a good answer to “what’s the problem you’re trying to solve?”. Dave McClure’s famous <a href=\"http://www.slideshare.net/dmc500hats/how-to-pitch-a-vc-aka-startup-viagra-how-to-give-a-vc-a-hardon\" target=\"_blank\">Startup Viagra: How to Pitch a VC</a> deck puts this question right up front, at slide #2. Focus on pain, say the experts. Your product must be a painkiller.\n\nWhile there is obvious wisdom to this rule, there is also a flaw in using this rubric exclusively. Consider, for example, that the most addictive technologies we’ve seen in the past few years would have never passed this test before millions of people were already using them (that’s perhaps why so many VCs <a href=\"http://techcrunch.com/2010/12/10/ask-a-vc-we-probably-would-have-been-the-last-guys-to-do-a-round-in-twitter-tctv/\" target=\"_blank\">missed the boat on Twitter</a>). It’s easy to say today that Twitter solves the problem of dispersed information, or Facebook the problem of dispersed friends. But who thought of these as “pain points” back in 2004? I don’t believe Twitter and Facebook are painkillers. Just ask yourself, Is “acetaminophen” really the drug you feel like you’re on when you’re using Twitter? Or does “methamphetamine” sound more appropriate? There’s in fact been research to show that <a href=\"http://www.huffingtonpost.com/russell-poldrack/multitasking-the-brain-se_b_334674.html\" target=\"_blank\">your brain reacts to products like Twitter</a> in much the same way as it would to stimulants like meth.\n\nSo what’s my point? If you focus only on painkillers, you’ll likely miss out on a completely different, and potentially much larger, set of opportunities: those that target pleasure. Pornography, sports and coffee are, for example, three insanely lucrative industries, and each of them sells the promise of pleasure.\n\nI believe that a focus on solving pain points alone leads to linear thinking that suppresses innovation. A perfect example of this is music. As traditional wisdom would have it, music is an ailing industry. Listeners won’t pay for content, labels are going bankrupt and artists don’t know how to connect with their digital fans. Lots of obvious pain points waiting to be addressed, and lots of start-ups offering obvious solutions. But obvious is never disruptive. The opportunity for disruption in music lies in the pleasure of music creation. The idea that only professional musicians, backed by labels, should create music was a relatively short-lived fad (music creation has, for most of human history, been a central part of daily life; some even believe that music was a precursor to speech), and it is so over. So let’s forget about the dying parts of the music industry, and focus instead on the world’s 6 billion living, breathing musicians who are ready and waiting to express themselves through music creation. I assure you there are several multi-billion dollar opportunities there waiting for us, as well as a few viral videos…like this one of a dog singing with her iPad ;)\n\n<object classid=\"clsid:d27cdb6e-ae6d-11cf-96b8-444553540000\" width=\"560\" height=\"340\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0\"><param name=\"allowFullScreen\" value=\"true\" /><param name=\"allowscriptaccess\" value=\"always\" /><param name=\"src\" value=\"http://www.youtube.com/v/Mk4bmK-acEM?fs=1&amp;hl=en_US\" /><param name=\"allowfullscreen\" value=\"true\" /><embed type=\"application/x-shockwave-flash\" width=\"560\" height=\"340\" src=\"http://www.youtube.com/v/Mk4bmK-acEM?fs=1&amp;hl=en_US\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>\n\nI’ll close with a caveat to my argument above—it’s not clear that meth (and Internet products like it) are actually sources of pleasure. Rather, they may simply <a href=\"http://www.lsa.umich.edu/psych/research&amp;labs/berridge/research/affectiveneuroscience.html\" target=\"_blank\">induce pleasure-seeking behaviors</a> that are never fully satisfied, and that’s what keeps people coming back.",
    "type": "post",
    "path": "/2011/01/10/the-pleasure-principle-not-all-products-need-to-be-painkillers/"
}