{
    "title": "The Entrepreneur's Guide to Conflicting Advice",
    "slug": "the-entrepreneurs-guide-to-conflicting-advice",
    "date": "2010-11-30T00:14:44.000Z",
    "url": "http://blog.500startups.com/?p=1116714534",
    "uri": "http://500.co/2010/11/29/the-entrepreneurs-guide-to-conflicting-advice/",
    "postId": "1116714534",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/11/aquaman-150x150.jpg",
        "http://500.co/wp-content/uploads/2010/11/joeheitzeberg-150x150.jpg"
    ],
    "creator": "",
    "categories": [
        "conflicting-advice",
        "entrepreneurs",
        "guest-posts",
        "joe-heitzeberg",
        "mediapiston",
        "mentors",
        "seattle",
        "startups",
        "tips"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2010/11/aquaman.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714540\" title=\"aquaman\" src=\"/backup/aquaman-150x150-2010-11-29-10-18-14.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2010/11/joeheitzeberg.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714536\" title=\"joeheitzeberg\" src=\"/backup/joeheitzeberg-150x150-2010-11-29-10-18-14.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<a href=\"http://500.co/wp-content/uploads/2010/11/joeheitzeberg.jpg\"></a><em>Joe Heitzeberg, AKA Aquaman (<a href=\"http://twitter.com/jheitzeb\" target=\"_blank\">@jheitzeb</a>) is a 500 Startups SuperMentor and Chief Piston at <a href=\"http://www.mediapiston.com/\" target=\"_blank\">MediaPiston</a>, a new crowdsourcing platform for content projects (pre-launch).  Prior to MediaPiston, Joe was the CTO at WhitePages.com and co-founder and CEO of Snapvine.com (acquired by WhitePages.com in June 2008).</em>\n\nCongratulations!  You’ve decided to take the startup leap.\n\nOne of the best parts? Having 1:1  access to incredibly successful people (especially if you’re working with 500 Startups!)\n\nOne of the challenges?  Making sense of conflicting advice.\n\nI polled some friends and fellow entrepreneurs and they all agreed -- you’re going to receive 180-degree conflicting advice on just about every aspect of your company.  I’m not just talking about advice from wantreprenuers, armchair quarterbacks, bankers-who’ve-never-run-companies and your mom. I'm also referring to advice from very experienced entrepreneurs with multiple successes under their belts.\n\nSo here it is: <strong>The Entrepreneur's Guide to Conflicting Advice!</strong>\n\n<strong>#1)  Remember, it’s your company\n</strong>You’re the rainbow-chasing entrepreneur.  More importantly, it is you who kissed your day job goodbye, raised the money, convinced others to join you and it is you who is ultimately accountable.\n\nNobody knows your business better than you do.  Others will have ideas and opinions about what you should do, but ultimately you’re the one that has to decide, follow-through and ultimately live with the consequences.\n\n<strong>#2)  Be goal-driven\n</strong>There is no recipe for how to get a startup off the ground.  Each company is unique and no one piece of advice is universally applicable in all situations.\n\nMost advice can’t be followed like a recipe.  It is more important to stay focused on your goals.  If advice isn’t adapted to solving for the situation at hand, it probably isn’t helping.\n\n<strong>#3)  Get fanatical supporters (not advice-givers)\n</strong>This blog post isn’t about how advice is useless, or that you should go it alone.  Au contraire - surround yourself with SuperMentors, advisors and investors who are aligned with your goals and who believe in you and can bring out the best in you -- by applying relevant experience to your particular challenges -- now and in the future.\n\nThis often means “advice” but more importantly it means having a cadre of fanatical supporters who are problem-solving and helping with your particular goals.\n\n<strong>#4)  Don’t get bogged down\n</strong>As has been said plenty of times before (and by the always awesome Mark Suster), <a href=\"http://www.bothsidesofthetable.com/2010/05/15/avoid-decision-by-indecision/\" target=\"_blank\">Avoid Decision by Indecision</a>.\n\nTo help you avoid this, with the help of some startup CEO friends, I’ve compiled a handy list of commonly conflicting advice -- so you can quickly recognize when you’re getting advice that may not be tailored to the particulars of your situation. When you come across these and don’t know what to do, remember to review your goals and get into problem-solving mode to make the choice that’s right for you.  At least you’ll know you’re in good company.\n\nHere they are....\n\n<strong> Fundraising</strong>\n\n1)  Take the money if and when you can get it  vs. Only raise what you need, delaying as long as possible\n2)  VCs don’t steal ideas  vs.  EIRs only attend in order to steal ideas\n3)  Founder liquidity is insane  vs.  Founder liquidity is required\n4)  Get funding from local / hands-on VCs  vs.  Get funding from Bay Area VCs\n5)  Don’t talk to VCs until you’re ready  vs.  Start building relationships before you quit your job\n6)  You must show the hockey stick  vs.  They all know the hockey stick is BS\n\n<em>“I was fooling no one but myself by pitching the hockey stick ramp. I had no clue how to execute against it, had no demonstrable success at scaling a business rapidly, and my assumptions simply couldn't be supported by what I was already seeing in the business. That was a pivotal moment of truth which drove me to go after angel backers and to concentrate on building a niche media business that's setup for continued growth without requiring new infusions of capital.”\n-- Tom Seery, CEO of <a href=\"http://www.realself.com/\" target=\"_blank\">RealSelf</a></em>\n\n<em>“It's like Animal from the Muppets yelling ‘Take money, take money!’ I think it stems from wanting to do something big (and wanting the corresponding salary that comes with a $10m raise?).  But I personally feel like it limits your options. There are a slough of people who say that taking any money is totally selling out and there are plenty of companies that took loads of cash who effectively killed all their positive exit options by driving up the cap table so aggressively.”\n-- Galen Ward, CEO of <a href=\"http://www.estately.com/\" target=\"_blank\">Estately</a></em>\n\n<strong>Vision\n</strong>1)  Make sure you have a big and clear vision vs. Vision is hot air, just do experiments\n2)  Follow a big vision / market vs. Stay focused on a niche and grow\n3)  Change the world vs. Follow the money\n\n<em>“The vision thing was the most interesting one for us.  One set of investors told us to drop the big vision stuff from our deck and focus on our tactical plans.  When we did that, another set of investors told us they didn't care about the tactical details and wanted to know what big important problem we were working on. Ultimately, we decided the important thing was to be true to our own entrepreneurial motivation (attack a big, important problem) and let investors self-select in or out depending on whether they were aligned with us.”\n-- Blake Scholl, CEO of <a href=\"http://barcodehero.com/\" target=\"_blank\">Barcode Hero</a></em>\n\n<em>\"We've received a lot of conflicting advice over the years about the direction to go with our product - concentrating on a niche or being broad but shallow. It's surprising how many entrepreneurs, investors and even customers differ on the fundamental roadmap of the company, but I suspect the truth lies somewhere in between. It's likely true that both paths have great opportunity, but straddling the fence is where we've gotten into trouble. As a startup, you have to make a call and stick with it, one way or the other.\"\n-- Rand Fishkin, CEO of <a href=\"http://www.seomoz.org/\" target=\"_blank\">SEOmoz</a></em>\n\n<strong>Product &amp; Marketing</strong>\n1)  Get a lot of users and figure out monetization later  vs.  Make money from day one\n2)  SEO vs. Viral vs. Social Media\n3)  Follow your vision vs. Let customers guide you\n4)  Be a platform first  vs.  Be an application first\n5)  Design is everything  vs.  Just look at craigslist\n6)  Find a working viral loop and build a product around it  vs. Products with high short-term virality often have no future\n\n<em>“Everyone talks and raves about viral/social marketing.  I think it's enormous, especially for abusive/violating apps from the likes of Slide/RockYou/etc.  But, for real value-add apps like we aspire to be, it's about getting real recommendations (i.e. links) from fans of the service that we've created.  Most of SEO is actually just getting real word-of-mouth (i.e. links) from people who really value your service.   That stuff is really hard.   Most people don't appreciate how hard that is.”\n-- Dave Schappell, CEO of <a href=\"http://www.teachstreet.com/\" target=\"_blank\">TeachStreet</a></em>\n\n<strong>Hiring</strong>\n1)  Build a balanced team up front  vs.  Bulid a solid dev team, bring on marketing later\n2)  Bring on the grey hairs  vs.  Tech is a young person’s game\n3)  Hire your friends  vs.  Never hire your friends\n4)  Must work 24x7 in order to win  vs.  It’s a marathon not a sprint\n\n<em>“I tend to think passion comes first, and people work very different ways.  If you want everyone to be the same, you will be severely disappointed.\tI think you are much better off to set high goals, hold them accountable, and let people find out their way to hit them.”\n-- Darrell Cavens, CEO of <a href=\"http://zulily.com/\" target=\"_blank\">Zulily.com</a></em>\n\n<em>“We are big believers in hiring for a startup the same way you'd hire if you were going off to war.  Brace for the fact that the situations you will encounter together will be much more difficult than you expected, make sure your team is smarter and better equipped than you are, be sure the person to your left and your right are people you trust with your life.  Whether they are your friends or not when you start this journey, make sure they are your friends when you end it.”\n-- Keith Smith, CEO of <a href=\"http://www.bigdoor.com/\" target=\"_blank\">BigDoor</a></em>\n\n<strong>Technology</strong>\n1)  Build a strong in-house dev team vs.  Save money by outsourcing everything\n2)  Hide your secret sauce  vs.  Be open (it’s all about execution anyway)\n3)  Hack prototypes vs.  Test driven development for everything\n4)  Open source vs. Microsoft .NET (etc)\n\n<em>\"We chose to use WordPress as our display engine instead of writing our own.  In the long-run, that's added complication.  In the short-run, it allowed us to get to market faster which enabled us to build a sustainable business before the end of our runway.  Continuing the airplane analogy, had we insisted on building for the long-run, we most likely would have never got the plane off the ground.\"\n-- Scott Porad, CTO of <a href=\"http://cheezburger.com/\" target=\"_blank\">Cheezburger Network</a></em>\n\n<strong>Business Development</strong>\n1)  Just build an API   vs.  Hire a well connected deal-maker\n2)  Never partner with other startups  vs.  Partnering with big companies is a distraction\n\n<em>“Sales is for revenue.  Bizdev is for valuation”\n-- Mike McCue, CEO of <a href=\"http://www.flipboard.com/\" target=\"_blank\">Flipboard</a> (via Twitter, <a href=\"http://www.twitter.com/mmccue\" target=\"_blank\">@mmccue</a>)</em>\n\n<strong>PR</strong>\n1)  Design your launch around TechCrunch  vs.  You’re just feeding your ego\n2)  The CEO must be your voice   vs.  Great PR firms make all the difference\n3)  Press releases are dead  vs.  PRWeb/PRNewsWire/PR/PR/PR!\n4)  Be secretive, don’t share anything   vs.  All PR is good PR,  you need it for hiring and marketing\n\n<em>“Why people share everything they are doing at conferences and in PR again and again is beyond me.  I guess if you like seeing your name in lights and that is the definition of success then OK. I would rather obsess about the customer, deliver great things and success will come.”\n-- Darrell Cavens, CEO of <a href=\"http://www.zulily.com/\" target=\"_blank\">Zulily.com</a></em>\n\n<strong>M&amp;A</strong>\n1)  Just focus on building your company  vs. Plan your exit from day one\n2)  Any exit less than $100m is a fail  vs. Maximize everyone’s odds of cash in bank\n3)  Use a banker to sell your company  vs.  Never use bankers to sell your company\n\n<em>“We've always tried to build businesses that have a solid foundation and will hopefully stand the test of time.  I try to live by the axiom: 'run your business like you will own it forever...or else you will.'”\n-- Keith Smith, CEO of <a href=\"http://bigdoor.com/\" target=\"_blank\">BigDoor</a></em>\n\n<strong>Competition</strong>\n1)  Ignore competitors  vs.  Dissect the competition and position yourself\n\n<em>“There's two schools of thought about competition.  The ‘Compete’ school know their competitors' products as well as their own and focus obsessively on outdoing them.  But I'm an adherent of the ‘Ignore’ school.  My new company, Sparkbuy, is in a ridiculously crowded space that peaked 5 years ago.  Thousands of competitors.  But I pretty much ignored them all.  Call it arrogance or ignorance, but I feel like the best startups keep their eyes on the goal, not the other runners.  I did circle back and make sure I wasn't re-inventing the wheel, but my main investment in competitive research was to fill out a slide in the pitch deck.\"\n-- Dan Shapiro, CEO of <a href=\"http://www.sparkbuy.com/\" target=\"_blank\">Sparkbuy</a></em>\n\n<strong>Making the Leap</strong>\n1)  Get 5 to 7 years of experience at BigCo first  vs.  Do it now before you’re tied down with mortgage, kids, etc\n2)  Get in the game / move to Silicon Valley  vs.  Stay out of the echo chamber / stay where you are\n\n<em>“Startups are a bit like harnessing tornadoes...there’s not too much else you can do to practice.”\n-- Terry Angelos, Co-Founder of <a href=\"http://www.trialpay.com/\" target=\"_blank\">TrialPay</a></em>\n\nGood luck!",
    "type": "post",
    "path": "/2010/11/29/the-entrepreneurs-guide-to-conflicting-advice/"
}