{
    "title": "The Data Behind Purchasing Behavior at UserVoice – Pricing for Conversion (Part I)",
    "slug": "the-data-behind-purchasing-behavior-at-uservoice-pricing-for-conversion-part-i",
    "date": "2013-07-18T17:25:21.000Z",
    "url": "http://500.co/?p=1116728499",
    "uri": "http://500.co/2013/07/18/the-data-behind-purchasing-behavior-at-uservoice-pricing-for-conversion-part-i/",
    "postId": "1116728499",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/07/UnSexy-2012-Pricing-for-Conversion.009.png",
        "http://500.co/wp-content/uploads/2013/07/UnSexy-2012-Pricing-for-Conversion.012.png",
        "http://500.co/wp-content/uploads/2013/07/UnSexy-2012-Pricing-for-Conversion.014.png",
        "http://500.co/wp-content/uploads/2013/07/UnSexy-2012-Pricing-for-Conversion.017.png",
        "http://500.co/wp-content/uploads/2013/07/UnSexy-2012-Pricing-for-Conversion.018.png",
        "http://500.co/wp-content/uploads/2013/07/UnSexy-2012-Pricing-for-Conversion.019.png",
        "http://500.co/wp-content/uploads/2013/07/UnSexy-2012-Pricing-for-Conversion.020.png",
        "http://500.co/wp-content/uploads/2013/07/UnSexy-2012-Pricing-for-Conversion.021.png",
        "http://500.co/wp-content/uploads/2013/07/UnSexy-2012-Pricing-for-Conversion.022.png",
        "http://500.co/wp-content/uploads/2013/07/UnSexy-2012-Pricing-for-Conversion.023.png"
    ],
    "creator": "",
    "categories": [
        "unsexy",
        "credit-card",
        "events",
        "guest-posts",
        "pricing",
        "trial",
        "uservoice"
    ],
    "content": "<em>This post was contributed by <a href=\"http://twitter.com/rrwhite\" target=\"_blank\">Richard White</a>, founder &amp; CEO of <a href=\"http://uservoice.com\" target=\"_blank\">UserVoice</a>, a leading customer feedback &amp; support platform. He’ll speak at the next <a href=\"http://unsexy.co\" target=\"_blank\">unSEXY conference</a> on Friday, August 9. <strong>Early bird ticket sales end TONIGHT at 11:59pm, PST</strong>, so <a href=\"http://unsexy2013.eventbrite.com/\" target=\"_blank\">REGISTER NOW and save</a>.</em>\n<p dir=\"ltr\">One of the biggest challenges I’ve found with running a SaaS business is the lack of real data put out there about how mechanics changes to the sign up funnel impact key conversion metrics. For my unSEXY Conf talk last year I wanted to do what I could to contribute what we’ve learned at UserVoice over the various changes we’ve made, to both our sign up process and to our pricing model itself.</p>\n<p dir=\"ltr\">I’ll be giving a follow-up to that talk this year but I wanted to catch everyone up on what was covered last year. So without further ado here is, in chronological order, the various changes we made and data we have on outcomes.</p>\n<p style=\"text-align: justify;\"><img class=\"size-full wp-image-1116728519\" alt=\"UnSexy 2012 - Pricing for Conversion.009\" src=\"/backup/UnSexy-2012-Pricing-for-Conversion-009-2013-07-18-13-12-25.png\" width=\"500\" height=\"375\" /></p>\n<p dir=\"ltr\">UserVoice was a completely free product for the first 10 months of it’s (public) existence and had a pretty healthy 39% month-over-month growth in account sign ups.</p>\n<p style=\"text-align: justify;\"><img class=\"size-full wp-image-1116728521\" alt=\"UnSexy 2012 - Pricing for Conversion.012\" src=\"/backup/UnSexy-2012-Pricing-for-Conversion-012-2013-07-18-13-12-25.png\" width=\"500\" height=\"375\" /></p>\n<p dir=\"ltr\">We cut that growth in half overnight simply by announcing that we were going to being introducing paid plans. You couldn’t even yet sign up for them - just fill out a lead form. It should also be noted that these new plans, for the most part, included features that weren’t currently available.</p>\n<p style=\"text-align: justify;\"><img class=\"size-full wp-image-1116728523\" alt=\"UnSexy 2012 - Pricing for Conversion.014\" src=\"/backup/UnSexy-2012-Pricing-for-Conversion-014-2013-07-18-13-12-25.png\" width=\"500\" height=\"375\" /></p>\n<p dir=\"ltr\">This was alarming. However a further analysis showed that we double the rate of active accounts after 30 days. So basically all we had done was drive away users that probably weren’t the best fit for our service.</p>\n<p dir=\"ltr\">One other thing to note is that once we did launch paid plans people that had signed up prior to their introduction converted to paid plans at roughly ¼ the rate of accounts that signed up after the plans were introduced. This is probably partly due to the fact that our plans were mainly feature, not usage, based so once you got up and running there was very little incentive to check out new premium features (like custom design, etc).</p>\n<p dir=\"ltr\"><strong>TAKEAWAY</strong>: Launching pricing earlier can help you find the real customers of your service and not be distracted by tire kickers.</p>\n<p style=\"text-align: justify;\"><img class=\"size-full wp-image-1116728525\" alt=\"UnSexy 2012 - Pricing for Conversion.017\" src=\"/backup/UnSexy-2012-Pricing-for-Conversion-017-2013-07-18-13-12-25.png\" width=\"500\" height=\"375\" /></p>\n<p dir=\"ltr\">We originally announced only two paid plans (priced at $289 &amp; $589 / mo) but we got a lot of feedback (via our own <a href=\"http://feedback.uservoice.com/forums/1-general-feedback/suggestions/84205-a-lower-priced-entry-level-plan\">UserVoice forum</a>) that people wanted sub-$100 plans.</p>\n<p style=\"text-align: justify;\"><img class=\"size-full wp-image-1116728527\" alt=\"UnSexy 2012 - Pricing for Conversion.018\" src=\"/backup/UnSexy-2012-Pricing-for-Conversion-018-2013-07-18-13-12-25.png\" width=\"500\" height=\"375\" /></p>\n<p dir=\"ltr\">We listened and added those at launch leaving us with 5 plans.</p>\n<p style=\"text-align: justify;\"><img class=\"size-full wp-image-1116728529\" alt=\"UnSexy 2012 - Pricing for Conversion.019\" src=\"/backup/UnSexy-2012-Pricing-for-Conversion-019-2013-07-18-13-12-25.png\" width=\"500\" height=\"375\" /></p>\n<p dir=\"ltr\">However we found 77% of our revenue came from two of these plans: Gold ($589/mo - 35% of revenue) and Bronze ($89/mo - 42%). The Silver plan ($289/mo) was what I call a \"wedge plan\": it didn’t have a ton of extra features over Bronze as it was simply designed to make it easier for you to either stay at $89 or justify making the jump to $589 (“Gold has so many more features than Silver why not pay the extra amount”). Tin ($19/mo) had a lot of accounts but at such a lower price point (relative to the others) it was never going to be a significant amount of revenue.</p>\n<p dir=\"ltr\"><strong>TAKEAWAY</strong>: Some pricing plans exist simply to make other plans look better.</p>\n<p style=\"text-align: justify;\"><img class=\"size-full wp-image-1116728535\" alt=\"UnSexy 2012 - Pricing for Conversion.020\" src=\"/backup/UnSexy-2012-Pricing-for-Conversion-020-2013-07-18-13-12-25.png\" width=\"500\" height=\"375\" /></p>\n<p dir=\"ltr\">Because we serviced a lot of young companies (non-profits &amp; government agencies) we heavily utilized discounts to give them access to our plans at price points they could afford.</p>\n<p dir=\"ltr\">We had 13% of paid accounts on some sort of discount (if we exclude folks on 100% discounts through various incubator / grant programs) with an average discount of 52%. Not surprisingly the LTVs on these discounted accounts were lower (17%) than non-discounted accounts. But this is offset by the fact that (at the time of this analysis) they were also 17% less likely to have churned.</p>\n<p dir=\"ltr\"><strong>TAKEAWAY</strong>: Discounts can be a useful tool for driving conversions without undermining long term LTV. However heavy usage might signal issues with your pricing structure.</p>\n<p style=\"text-align: justify;\"><img class=\"size-full wp-image-1116728537\" alt=\"UnSexy 2012 - Pricing for Conversion.021\" src=\"/backup/UnSexy-2012-Pricing-for-Conversion-021-2013-07-18-13-12-25.png\" width=\"500\" height=\"375\" /></p>\n<p dir=\"ltr\">At one point early on we tried having usage limits on the number of users who could give you feedback be part of our plan structure. Since most of our plans were feature based we saw very few upgrades post-trial. We wanted to add usage limits so that we could drive upgrades that scaled as the account scaled up it’s activity.</p>\n<p dir=\"ltr\">This was a huge failure. It created what I call a success penalty: the more successful you were in activating your users to give you feedback the more expensive the product became. On some level this made sense but since no one knew how to estimate this future usage it just created uncertainty about committing to a product without knowing the future cost of it. It was especially problematic because we were often working with young companies who didn’t know or were very optimistic about their future active user levels (and equally optimistic about what % of them would engage on UserVoice and give them feedback). It put us in the awkward position of tempering a customer’s enthusiasm about their use of our product (aka “There’s no way you’ll have 300K people on your site in 60 days time”).</p>\n<p dir=\"ltr\">When we removed the usage limits, which were designed to drive upgrades, we actually saw that upgrades increased 33%!</p>\n<p dir=\"ltr\"><strong>TAKEAWAY</strong>: If you're going to price on usage it needs to be on usage the customer has control over (number of seats, minutes used, etc)</p>\n<p style=\"text-align: justify;\"><img class=\"size-full wp-image-1116728541\" alt=\"UnSexy 2012 - Pricing for Conversion.022\" src=\"/backup/UnSexy-2012-Pricing-for-Conversion-022-2013-07-18-13-12-25.png\" width=\"500\" height=\"375\" /></p>\n<p dir=\"ltr\">At one point move from a 15 day free trial to a 30 day free trial. This had no measurable impact on any metric that we track. We kept it at 30 days purely for marketing reasons.</p>\n<p style=\"text-align: justify;\"><img class=\"size-full wp-image-1116728545\" alt=\"UnSexy 2012 - Pricing for Conversion.023\" src=\"/backup/UnSexy-2012-Pricing-for-Conversion-023-2013-07-18-13-12-25.png\" width=\"500\" height=\"375\" /></p>\n<p dir=\"ltr\"> <strong>Moving from requiring a credit card up front to not requiring a credit card (until the end of the trial) had no effect on overall conversions.</strong></p>\n<p dir=\"ltr\">The general view is that not requiring a credit card up front is good for new services where customers don’t quite know the value of a service. So this switch may have been more beneficial if we had made it earlier but by this point UserVoice was pretty well established and you knew what you were getting into. One group that really loved this switch was our support team - they now had a lot less angry emails from customers who had auto-converted (since you had to remember to close your account before the trial ended or be charged) and needed a refund (which we always gave).</p>\n<p dir=\"ltr\">Phew! That’s a lot to digest but yet we’re only halfway there. In Part II (coming out tomorrow) we’ll cover a whole new set of experiments including our most successful one ever.</p>\n<p dir=\"ltr\">And if you enjoyed this content then you’ll want to be at this year’s UnSexy conference on August 9th where I’ll be diving into changes from this last year including:</p>\n\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Migrating $5 plans to free</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Not running billing on the weekends</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Even bigger pricing changes (see uservoice.com/plans for a sneak preview)</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">... and much more</p>\n</li>\n</ul>\n<p dir=\"ltr\">I hope to see you there!</p>\n<p dir=\"ltr\"><em>Come back tomorrow for <a href=\"http://500.co/2013/07/19/the-data-behind-purchasing-behavior-at-uservoice-pricing-for-conversion-part-ii/\">Part 2</a>, where Richard dives even deeper into the unSEXY world of pricing!</em></p>",
    "type": "post",
    "path": "/2013/07/18/the-data-behind-purchasing-behavior-at-uservoice-pricing-for-conversion-part-i/",
    "backgroundImage": "/backup/cctrial-960x540-2013-07-18-13-12-25.png"
}