{
    "title": "The Food Startup Landscape: Investing Lessons Learned",
    "slug": "the-food-startup-landscape-investing-lessons-learned",
    "date": "2011-08-24T01:01:33.000Z",
    "url": "http://blog.500startups.com/?p=1116715829",
    "uri": "http://500.co/2011/08/23/the-food-startup-landscape-investing-lessons-learned/",
    "postId": "1116715829",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/08/food_heart_logo-300x300.jpg"
    ],
    "creator": "",
    "categories": [
        "andrew-pederson",
        "any-leaf",
        "calafia",
        "cookpad",
        "coupa",
        "coupa-cafe",
        "culturekitchen",
        "curry-village-foods",
        "dave-mcclure",
        "e-la-carte",
        "enrique-allen",
        "foodspotting",
        "gogomongo",
        "gogrubly",
        "google",
        "heardabout",
        "ilya-fushman",
        "mars",
        "metrics",
        "missy-krasner",
        "munchery",
        "odwalla",
        "olivia-wu",
        "pepsico",
        "physic-ventures",
        "punckfork",
        "quentin-topping",
        "republic-of-tea",
        "san-franola",
        "scott-giambastiani",
        "shopwell",
        "skipola",
        "smartgardner",
        "spoondate",
        "tom-cole",
        "uncategorized",
        "unilever",
        "vinod-khosla-ventures",
        "wednesdays",
        "william-rosenzweig",
        "yorder"
    ],
    "content": "<p dir=\"ltr\"><a href=\"http://500.co/wp-content/uploads/2011/08/food_heart_logo.jpg\"><img class=\"alignright size-medium wp-image-1116715854\" title=\"food_heart_logo\" src=\"/backup/food_heart_logo-300x300-2011-08-23-11-20-01.jpg\" alt=\"\" width=\"300\" height=\"300\" /></a>Thank you to everyone who came out to our event, “<a href=\"../2011/07/20/the-new-food-chain-investing-in-food-startups/\" target=\"_blank\">The New Food Chain: Investing in Food Startups</a>”  where we learned about world of food and technology and what kinds of  investment opportunities and new startups were were in the space today.  Investors like <a href=\"http://www.physicventures.com/leadership/management/william-rosenzweig\" target=\"_blank\">William Rosenzweig</a> Managing Director of Physic Ventures, <a href=\"http://www.khoslaventures.com/khosla/people_if.html\" target=\"_blank\">Ilya Fushman</a>, Ph.D., Principal, Vinod Khosla Ventures, and <a href=\"http://www.linkedin.com/in/tomcole\" target=\"_blank\">Tom Cole</a>,  Former Investor, Trinity Ventures shared their expertise on the market  and what to look for when investing in a food startups. We also saw  demos from hot new startups like <a href=\"http://culturekitchensf.com/\" target=\"_blank\">Culturekitchen</a>, <a href=\"https://spoondate.com/\" target=\"_blank\">Spoondate </a>and <a href=\"http://www.foodspotting.com/\" target=\"_blank\">Foodspotting</a> and many more.  Below are some take-aways from the evening.</p>\n<p dir=\"ltr\"><strong>The Big Picture</strong></p>\n<p dir=\"ltr\">William Rosenzweig from <a href=\"http://www.physicventures.com/\" target=\"_blank\">Physic Ventures</a> opened the event by providing the audience with a snapshot of  innovation in the space with a slide of a food startup map. Having  started <a href=\"http://www.republicoftea.com/\" target=\"_blank\">Republic of Tea</a>, and being one of the early founding executives at <a href=\"http://www.republicoftea.com/\" target=\"_blank\">Odwalla</a>,  he shared best practices for growing a new product/brand in the  industry. Will founded Physic Ventures to help continue to spur  innovation in the food industry and partners with <a href=\"http://www.unilever.com/\" target=\"_blank\">Unilever</a> and <a href=\"http://www.pepsico.com/\" target=\"_blank\">Pepsico</a> to help fund new innovators in the space.  Will laid out the primary obstacles for food startups and investors in this space:</p>\n\n<ul>\n\t<li>\n<p dir=\"ltr\">Food has slow adoption rates</p>\n</li>\n\t<li>\n<p dir=\"ltr\">Barriers of entry for this space are low</p>\n</li>\n\t<li>\n<p dir=\"ltr\">There is a lack of seasoned entrepreneurs in this segment of the industry</p>\n</li>\n\t<li>\n<p dir=\"ltr\">Food distribution channels and systems are entrenched</p>\n</li>\n</ul>\nWill’s advice to aspiring companies: “Be your first customer.”  Andrew Pederson, Global Sustainability Chocolate Manager at <a href=\"http://www.mars.com/global/index.aspx\" target=\"_blank\">Mars</a> and Michael Hammer, Director of Venture Capital Strategy at <a href=\"http://www.pepsico.com/\" target=\"_blank\">Pepsico</a> both talked about how large food corporations are working toward  putting out products that have healthier ingredients and sourcing from  sustainable farms.\n<p dir=\"ltr\"><strong>Investing in Food Startups</strong></p>\n<p dir=\"ltr\">Later,  we turned to our investor panel to better understand how technology and  social media are influencing the new food market. We specifically asked  our panelists for what they were looking for in today’s new food  startups.</p>\n\n<ul>\n\t<li>\n<p dir=\"ltr\">Tom  Cole, formerly at Trinity Ventures and currently personal investor and  food blogger was looking for startups who were not overcapitalized at  the start of their business. He said that many food companies don’t need  that much money to start out and if they overcapitalize, they then have  to generate bigger milestones and a clear exit.</p>\n</li>\n</ul>\n<ul>\n\t<li>\n<p dir=\"ltr\">Ilya  Fushman from Vinod Khosla Ventures said he was interested in startups  who were providing solutions to distribution challenges. He is also  interested in companies that have a technology advantage and unique IP.</p>\n</li>\n\t<li>\n<p dir=\"ltr\">Dave  McClure from 500 Startups said he looks for startups that are capital  efficient, revenue oriented, have online platforms, and have a good  distribution model. He is convinced that it is not hard to find  customers with food startups since food is a “highly frequency behavior  that is highly social.”</p>\n</li>\n\t<li>\n<p dir=\"ltr\">William  Rosenzweig from Physic Ventures talked about looking for teams who can  work well together as food startups take more then one leader. He is  also looking for entrepreneurs who can predict trends in the food  market.</p>\n</li>\n</ul>\nWe also heard from companies, like <a href=\"http://www.google.com/intl/en/about/corporate/index.html\" target=\"_blank\">Google</a>,  who have built entrepreneurial food programs as part of their corporate  wellness efforts. These programs have spurred new trends in local  communities.  For example, Executive Chefs: Scott Giambastiani, Quentin  Topping and Olivia Wu spoke of community supported agriculture and their  new <a href=\"http://googleblog.blogspot.com/2011/07/gone-fishinpiloting-community-supported.html\" target=\"_blank\">community supported fishery</a>, where they bring locally sourced food to employees to buy and take home.\n<p dir=\"ltr\"><strong>In The Oven</strong></p>\n<p dir=\"ltr\">We  had over a dozen demos from startups that are changing the way we  order, consume, cook and interact with food. Here are some of the  highlights:</p>\n\n<ul>\n\t<li>\n<p dir=\"ltr\"><a href=\"http://culturekitchensf.com/\" target=\"_blank\">Culturekitchen </a>connects  immigrant women with local foodies who want to learn traditional home  recipes from around the world. (Founded by Jennifer Lopez and Abby  Sturges)</p>\n</li>\n\t<li>\n<p dir=\"ltr\"><a href=\"http://punchfork.com/\" target=\"_blank\">Punchfork </a>scans  social networks and the web for recipes and displays the ones that have  been visited and shared the most. (Founded by Jeff Miller)</p>\n</li>\n\t<li>\n<p dir=\"ltr\"><a href=\"https://spoondate.com/\" target=\"_blank\">Spoondate </a>lets  you enter what you are craving into a comment stream and opens up the  possibility of meeting someone else for a date over the same craving.  (Founded by Raissa Nebie)</p>\n</li>\n</ul>\n<ul>\n\t<li> <a href=\"https://munchery.com/\" target=\"_blank\">Munchery</a> allows you to order  meals cooked by chefs for events. (Founded by Tri Tran)</li>\n</ul>\n<ul>\n\t<li> <a href=\"http://cookpad.com/\" target=\"_blank\">Cookpad</a> is the leading recipe sharing site in Japan with over 10M users. (Founded by Aki Sano)</li>\n\t<li><a href=\"http://skipola.com/\" target=\"_blank\">Skipola</a> allows restaurant chains to receive digital orders using an phone app. (Founded Igor Lebovic)</li>\n</ul>\n<ul>\n\t<li> <a href=\"http://elacarte.com/\" target=\"_blank\">E La Carte</a> puts tablets on tables at restaurants so you can order and pay for your  food more efficiently while you play games. (Founded by Rajat Suri)</li>\n</ul>\nCheck out other startups that also did demos: <a href=\"http://www.heardabout.com/splash\" target=\"_blank\">HeardAbout </a>, <a href=\"http://www.shopwell.com/\" target=\"_blank\">Shopwell</a>, <a href=\"http://www.smartgardener.com/\" target=\"_blank\">SmartGardner</a>, <a href=\"http://www.gogomongo.com/\" target=\"_blank\">GogoMongo</a>, <a href=\"http://wednesdays.com/\" target=\"_blank\">Wednesdays</a>, <a href=\"http://grub.ly/\" target=\"_blank\">Grubly</a>, <a href=\"http://www.crunchbase.com/company/anyleaf\" target=\"_blank\">Any Leaf</a> and <a href=\"http://www.yorder.it/\" target=\"_blank\">Yorder</a> as well.\n\n&nbsp;\n<div>\n<div>Thank you to everyone who helped make this event a success: <a href=\"http://500startups.com/mentors/missykras\" target=\"_blank\">Missy Krasner</a>, one of our mentors and former <a href=\"http://www.google.com/intl/en-US/health/about/\" target=\"_blank\">Google Health</a> leads who helped secure investor speakers and moderated the panels, <a href=\"http://500startups.com/people/169\" target=\"_blank\">Maria Susana Camino</a>,  our star summer intern, who organized the event logistics and outreach,  and a special shout out to our food sponsors who provided delicious  meals for the evening:<a href=\"http://www.coupacafe.com/\" target=\"_blank\"> </a><a href=\"http://calafiapaloalto.com/\" target=\"_blank\">Calafia</a>,<a href=\"http://www.sanfranolagranola.com/\" target=\"_blank\"> San Franola</a>, <a href=\"https://munchery.com/\" target=\"_blank\">Munchery</a>, <a href=\"http://www.curryvillagefoods.com/\" target=\"_blank\">Curry Village Foods</a> and <a href=\"http://www.coupacafe.com/\" target=\"_blank\">Coupa Café</a>.</div>\n</div>",
    "type": "post",
    "path": "/2011/08/23/the-food-startup-landscape-investing-lessons-learned/"
}