{
    "title": "The WhatsApp Effect: Don’t Base Your Acquisition Strategy on Outliers",
    "slug": "the-whatsapp-effect",
    "date": "2014-03-03T22:58:35.000Z",
    "url": "http://500.co/?p=1116731691",
    "uri": "http://500.co/2014/03/03/the-whatsapp-effect/",
    "postId": "1116731691",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2014/03/whatlberg.gif"
    ],
    "creator": "",
    "categories": [
        "acquisition",
        "distribution",
        "distribution",
        "paid-marketing",
        "whatsapp"
    ],
    "content": "<p dir=\"ltr\"><em>“There may be no greater testament to the viral nature of WhatsApp than the fact that the company has accomplished all this without investing a penny in marketing. Unlike their smaller competitors, it hasn’t spent anything on user acquisition. The company doesn’t even employ a marketer or PR person.” - <a href=\"http://www.businessinsider.com/facebook-is-buying-whatsapp-2014-2\">http://www.businessinsider.com/facebook-is-buying-whatsapp-2014-2</a></em></p>\n<a href=\"/backup/whatlberg-2014-03-03-14-16-58.gif\"><img class=\"aligncenter size-full wp-image-1116731693\" alt=\"whatlberg\" src=\"/backup/whatlberg-2014-03-03-14-16-58.gif\" width=\"480\" height=\"195\" /></a>\n“We haven’t done any paid marketing!”\n<h2 dir=\"ltr\">Stop It</h2>\n<p dir=\"ltr\">There’s that statement again. Every time I hear someone say this, especially when they’re a founder trying to raise money, I cringe. Yes, there are those rare products that grow like wildfire without spending a dime, but those are few and far between. For most startups, paid marketing and distribution are critical to success. If you’re boasting about the fact that you haven’t spent anything on marketing or distribution, that tells me you’re completely neglecting the biggest user acquisition channels – adwords, SEO, Facebook mobile installs, etc. Basically, you’re telling me that you don’t have the expertise or foresight necessary to acquire users via paid channels. Not good.</p>\n\n<h2 dir=\"ltr\">Outliers aren’t the norm</h2>\n<p dir=\"ltr\">Putting a company like WhatsApp on a “no marketing” pedestal sets a bad example for other companies. Based on what people are saying about WhatsApp’s amazing growth, you’d think not understanding how to acquire users profitably with paid marketing was a good thing. This couldn’t be further from the truth. For the 99% of companies out there are at *not* WhatsApp, paid marketing is a crucial tool for growth.</p>\n\n<h2 dir=\"ltr\">Paid Acquisition is Not For Us</h2>\n<p dir=\"ltr\">Here are some reasons I’ve heard why startups don’t focus on paid distribution:</p>\n\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">We don’t have product market fit.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">We’re focused on improving our product.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">We don’t have a marketing budget.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">We don’t have the expertise.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">We don’t have time.</p>\n</li>\n</ul>\n<p dir=\"ltr\">The last one is definitely the worst, but all of those excuses are pretty bad. There’s only one valid reason to neglect distribution, and that’s if you don’t have analytics/tracking properly installed. However, this can be solved by simply adding a pixel to your page! Here’s why the other reasons are BS, too:</p>\n\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>We don’t have product market fit.</strong> If you don’t have product market fit, you probably don’t have a lot of people using your product. And for the people who do use your product, you’re probably losing them quickly. With paid ads, you can test different value propositions and messaging. Most importantly, you can get to product market fit much faster because you’re bringing in new people all the time and testing your assumptions.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>We’re focused on improving our product.</strong> If testing your product with actual customers is not part of your improvement process, something is very wrong.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>We don’t have marketing budget.</strong> Do you have $5/day to spend? If not, you might have bigger problems. The point is that even a very small budget is enough to get started. The fact that you’re collecting data and learning to use the different ad platforms is hugely valuable. Keep in mind there are also plenty of retention tricks you can do for nearly $0, such as funnel abandonment emails.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>We don’t have the expertise.</strong> The only way to learn is to get started. You can read about distribution, watch videos on distribution, but the best way to learn distribution is by getting your hands dirty and trying it out.</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>We don’t have time.</strong> Yes, you do. Getting more traction for your product should be priority number 1.</p>\n</li>\n</ul>\n<h2 dir=\"ltr\">Conclusion</h2>\nYou’re probably not WhatsApp, so your app probably won’t grow to 350 million daily active users without any marketing. Get started with paid distribution today and TEST, TEST, TEST.\n<h2 dir=\"ltr\">What's Next?</h2>\n<p dir=\"ltr\">If you enjoyed this post, first check out these additional resources for how you can up your game from the 500 Distribution team:</p>\n\n<ul>\n\t<li><a title=\"5 Distribution Experiments You Can Do For $10 Or Less\" href=\"http://500.co/2014/03/13/5-distro-experiments-you-can-do-on-10-or-less/\" target=\"_blank\">5 Distribution Experiments You Can Do For $10 Or Less</a></li>\n\t<li><a title=\"How We Doubled Our Conversion Rate – Bombfell Co-Founder Bernie Yoo\" href=\"http://500.co/2014/03/24/how-we-doubled-our-conversion-rate-bombfell/\" target=\"_blank\">How We Doubled Our Conversion Rate - Bombfell Co-Founder Bernie Yoo</a></li>\n\t<li><a title=\"How to Suck Less at E-mail Marketing\" href=\"http://500.co/2013/08/13/how-to-suck-less-at-e-mail-marketing/\">How to Suck Less at Email Marketing</a></li>\n\t<li><a title=\"The Power of Trigger Emails\" href=\"http://500.co/2013/10/25/the-power-of-trigger-emails/\">The Power of Trigger Emails</a></li>\n</ul>\n<p dir=\"ltr\">Then, sign up to get a daily bite-sized distro hack (and one awesome GIF) delivered to your inbox:</p>\n<strong>&gt;&gt; <a title=\"Distrosnack 500 Startups Distribution Email Newsletter\" href=\"http://eepurl.com/BfYXn\">Subscribe to Distrosnack here</a> &lt;&lt;</strong>",
    "type": "post",
    "path": "/2014/03/03/the-whatsapp-effect/",
    "backgroundImage": "/backup/whatsapp1-960x540-2014-03-03-14-16-58.jpg"
}