{
    "title": "The Secret Pregnant Founder",
    "slug": "the-secret-pregnant-founder",
    "date": "2013-03-15T04:13:40.000Z",
    "url": "http://500.co/?p=1116726337",
    "uri": "http://500.co/2013/03/14/the-secret-pregnant-founder/",
    "postId": "1116726337",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "founders",
        "pregnant",
        "tiny-post",
        "uncategorized",
        "women"
    ],
    "content": "<article id=\"post-45274414810\"><section><em><em><strong>The following post was contributed by <a href=\"http://twitter.com/mmiranda\">Melissa Miranda</a>, founder of <a href=\"http://tinypost.co/\" target=\"_blank\">Tiny Post</a></strong></em></em>\n\nPregnant. That was my big secret when I was pitching (and winning) at Women 2.0 a year ago. Not only am I a female founder, I’ve also led my startup while becoming a mom at the same time.I wish we didn’t have to have this debate so I could be working instead of writing my story. I wish there wasn’t any bias in Silicon Valley. I wish I didn’t have to think carefully about how I could write this so I could still be perceived as a strong and capable individual, not a victim of gender bias or a privileged super hero (or whatever they are calling Marissa and Sheryl).But I write because we need more women in tech, and to inspire someone to join us here is to contribute to the solution.\n\nTruth is that women are treated differently in Silicon Valley. Most people are not aware of their bias, just like symphony orchestras had no idea they were judging female musicians differently until they introduced blind auditions. Just like that, they went from being 90% male to 50-50. We don’t have blind VC pitches here, nor do we have a rigorous data set for Steven Levitt to write a chapter for the next edition of Freakonomics, so we’ll never really know how the gender bias plays out for sure.I can say that I’ve walked into a dinner of aspiring entrepreneurs who were all male and been asked point blank: “So, how come you are here?” because it was inconceivable that a woman would be founder. I also know that some smart VCs recognize their bias and are actively hiring women to source deals (so they don’t miss the next Pinterest). Silicon Valley is human, complete with faults and desire for self improvement.\n\nI do know what it’s like to fundraise while pregnant. Awkward. Do you disclose?  Will they think that just because their wife decided to stay home you will too? Or will it all be irrelevant because the one woman you are pitching to in the room will automatically figure out that someone with your body type would never wear such an outfit unless the midline was out of sorts, and the guy in the room will notice that an excel document labeled Baby List is hanging out on your Chrome download tool bar? That’s what happened one pitch meeting, as they happily told me “we knew it!” when I ran into them again late into my 8th month.\n\nThere is hardly any precedent for a pregnant founder pitching. Not long ago, there also used to be little precedent for couples founding companies together. Married founders give investors pause, I know because I’m married to my co-founder. It’s funny to hear VCs wonder out loud how someone could work with their spouse because they could never see themselves working with their wife, and I smile to myself at the utter irrelevancy of that observation. Investing is such imperfect science.\n\nNow that the roster of successful married founders is growing, (thanks to EventBrite, Bebo, and hey even Y Combinator since PG’s wife, Jessica, also works there), investors no longer bat much of an eye at funding married founders. I hope the same will be true of women, and down the road in a more gender-equal future, pregnant women.\n\nSince you are wondering what the F happened when I had the baby, I’ll tell you that we hired a great team that could execute the details while I directed high level strategy taking care of baby. We launched Tiny Post 2 weeks before I gave birth, and released a major update 2 weeks after, and grew like bottle rockets with Apple promoting us around the world.\n\nWas it hard? Harder than I could ever have predicted. It wasn’t just the sleepless nights or pregnancy induced carpal tunnel syndrome, it was being responsible for a tiny human who didn’t come with an operating manual. A few times a week, I was able to walk to the office with baby sleeping in a carrier and bounce on a ball at my computer, but it was really having the full support of my co-founder and team that made it possible. It really took all of us to get through it. I’ve been back at work full time for a while now, feeling refreshed and driven. We’ve got something up our sleeve that will be revealed soon.\n\nAm I going to get stuff accomplished as a founder and a mom? Yes. Being an entrepreneur takes guts to try to accomplish something when all the odds are stacked against you. Perhaps the odds are a little steeper for women, and once in a while I notice it, but I don’t want to get hung up on the gender bias. The best way to have more women at the top is to climb up there myself.\n\n</section></article>",
    "type": "post",
    "path": "/2013/03/14/the-secret-pregnant-founder/",
    "backgroundImage": "/backup/Untitled-2013-03-14-13-22-13.png"
}