{
    "title": "The Designer-Driven Startup",
    "slug": "the-designer-driven-startup",
    "date": "2011-07-05T23:47:11.000Z",
    "url": "http://blog.500startups.com/?p=1116715564",
    "uri": "http://500.co/2011/07/05/the-designer-driven-startup/",
    "postId": "1116715564",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "design",
        "guest-posts",
        "uncategorized"
    ],
    "content": "<div><em>The author, Zach Weiner is the co-founder of <a href=\"http://storytree.me/\" target=\"_blank\">Storytree</a>, one of the first d.funded companies.  Zach is the product of the Stanford Symbolic Systems program, equal parts computer scientist and designer.  This post is the second in a series about the design-driven startup.  The first, entitled <a href=\"http://blog.storytree.me/the-designer-driven-startup-why\" target=\"_blank\">\"The Designer-Driven Startup: Why\"</a>, explains the need for a new kind of startup, and it can be found on the <a href=\"http://blog.storytree.me/\" target=\"_blank\">Storytree blog</a>.  This post details the solution.</em></div>\n<div><em>\n</em></div>\n<div>First, since design is an overloaded word, a clarification about what design means to us (I'm not talking about making things look good): design is a <strong>process*</strong> concerned with a product's meaning, not just its use and usability.</div>\n&nbsp;\n<div>While design in this sense of the word is not yet what people usually mean in the startup world, much of the process is familiar and practiced already.  In fact, its key tenet has even been adopted by the popular lean startup movement: fail early and often.  Usually manifested through lo-fidelity product testing with users, this serves to eliminate risk in a venture when it is cheapest (early failures cost less and risk falls with each iteration).</div>\n&nbsp;\n<div>Still, there is much more to design thinking, and if \"making something people want\" is the golden standard, then design may be the perfect tool.  The problem is that making something people want is a fairly complex goal, and even if you can build, ship, and test at lightning speed, it is highly unlikely that you happen to hit on that magical \"something\".  So, we decompose it into three pieces, each of which our process addresses:</div>\n&nbsp;\n<div><strong>1. Who are the \"people\" exactly?</strong> It'll be tough to convince me that it's everyone, and saying it's \"people like me\" is likely to mislead you, because as you build you'll think, \"I like this so others will too\" without realizing how biased you are.  So we begin by empathizing with our users and understanding them as complex people.  For instance, we discovered that many baby boomers are afraid of losing their family's stories and felt detached from loved ones spread around the country or the world, and decided to design for them.&nbsp;\n<div><strong>2. What do they want?</strong> The answer to this question does not yet mandate a particular solution.  For Storytree, the need we uncovered was not \"an internet service that will record you and display your story privately and prettily with features X, Y, and Z.\"  The need was \"a way to explore meaningful stories with loved ones before those stories are lost.\"&nbsp;\n<div><strong>3. What can we make that gives them what they want?</strong> This is the actual solution, with a feature list.  We take the our user + need + insight and come up with ways to answer the questions about our solution.  We are especially liberal with the ways we can prototype and test; we may even test with \"extreme\" users prototypes that barely resemble our product -- this way hidden problems become obvious.  By setting up storytelling booths for grandparents, we reached a key insight: it's tough telling a story to a blank slate, so we provide prompts to start people off.</div>\n&nbsp;\n<div>Note that very often the solution has a broader reach than was originally expected -- in our case, Storytree can be used for groups of old friends that want the stories behind a semester abroad rather than just the pictures.  But our process assures that we do not make assumptions about any of these pieces.  As a result, we can all but guarantee idea-market fit.  From there, we can iterate on various pieces of the solution until we reach product-market fit.</div>\n&nbsp;\n<div>Ultimately, engaging our users on a <em>deep</em> level helps us build products that inherently have meaning.</div>\n&nbsp;\n<div>The next post in this series discusses <a href=\"http://blog.storytree.me/the-design-driven-startup-challenges\">the challenges with a designer-driven startup</a>.</div>\n<div>------</div>\n&nbsp;\n<div>*The human-centered design process for those new to design thinking:</div>\n&nbsp;\n<div>You start by <strong>empathizing</strong> with a <em>specific user</em> in order to uncover a <em>core need</em> and an <em>unexpected insight </em>that will drive innovation.  user + need + insight <strong>define a point of view</strong>, which will focus your process.  You quickly flare, <strong>ideating</strong> as many wild ideas as possible based on that POV, before focusing on a few ideas that you can make practical.  You then <strong>prototype and test </strong>multiple ideas quickly with your users, at extremely lo-fidelity (frequently in &lt; 1 hr), meanwhile building a hi-fidelity solution that incorporates your learnings from each lo-fi prototype.  At every stage, you loop back to make sure that what you are doing is consistent with your POV, and often change both your POV and your solution (if you want to, I suppose you can call it a pivot).</div>\n&nbsp;\n<div>For methods, see the d.school bootcamp bootleg:</div>\n<div><a href=\"http://dschool.typepad.com/files/bootcampbootleg2010v2slim-1.pdf\" target=\"_blank\">http://dschool.typepad.com/files/bootcampbootleg2010v2slim-1.pdf</a></div>\n&nbsp;\n\n</div>\n</div>",
    "type": "post",
    "path": "/2011/07/05/the-designer-driven-startup/"
}