{
    "title": "This Week's Livestreamed Accelerator Talks",
    "slug": "this-weeks-livestreamed-accelerator-talks-3",
    "date": "2013-05-13T15:24:44.000Z",
    "url": "http://500.co/?p=1116727575",
    "uri": "http://500.co/2013/05/13/this-weeks-livestreamed-accelerator-talks-3/",
    "postId": "1116727575",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "accelerator",
        "design",
        "livestream",
        "marie-perruchet",
        "nir-eyal",
        "pitching",
        "stanford",
        "ux"
    ],
    "content": "We have some great speakers lined up this week for Batch 6! Don't miss out on getting great tips for your startup – check out the livestream schedule below:\n\n<strong>Storytelling Class with <a href=\"https://twitter.com/Nanookleskimo\" target=\"_blank\">Marie Perruchet</a></strong>\n\nStories have a unique power to persuade and motivate, because they appeal to our emotions and have the ability to shape beliefs and change minds. No decisions are made, no products sold, and no partnerships forged, are launched based on a slide show with dry numbers. In this hour talk, Marie teach you which narrative communication techniques work best for effective speaking, and how to incorporate these techniques into your upcoming Demo Day pitch.\n\nWe will go through interactive exercises to:\n\n- know how to use your personal story to inspire other people\n- develop a comfortable and effective style for pitching\n- know how to incorporate body language that commands attention and respect\n\n<a href=\"http://new.livestream.com/500SAcc\" target=\"_blank\">Watch it Tuesday, 5/14 at 12:00pm PST</a>\n\n<strong>Behavior By Design with <a href=\"https://twitter.com/nireyal\" target=\"_blank\">Nir Eyal</a></strong>\n\nNir Eyal founded and sold two tech companies since 2003 teaches the \"Behavior by Design\" class at the Stanford Graduate School of Business. Nir's last company, AdNectar, received venture funding from Kleiner Perkins and was sold in 2011. He is also an advisor, consultant, and investor in several Bay Area companies and is a contributing writer for TechCrunch and Forbes. Nir blogs about the intersection of psychology, technology, and business at <a href=\"http://www.nirandfar.com/\">www.NirAndFar.com</a>.\n\n<a href=\"http://new.livestream.com/500SAcc\" target=\"_blank\">Watch it Tuesday, 5/15 at 3:00pm PST</a>",
    "type": "post",
    "path": "/2013/05/13/this-weeks-livestreamed-accelerator-talks-3/",
    "backgroundImage": "/backup/500-960x540-2013-05-13-13-10-24.jpg"
}