{
    "title": "Thoughts on Tech & Family",
    "slug": "thoughts-on-tech-family",
    "date": "2012-04-18T03:11:29.000Z",
    "url": "http://500.co/?p=1116719855",
    "uri": "http://500.co/2012/04/17/thoughts-on-tech-family/",
    "postId": "1116719855",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<em><em>The below is a guest post by Shireen Rahjou, Community &amp; Media Relations Manager at <a href=\"http://www.go.co/\">.CO</a>. You may have seen her running around SXSW in an orange t-shirt, spoiling all the .CO VIP's (startups registered on a .CO domain). This social butterfly comes from a business background, holds a Masters in PR and she wants to be every .CO's best friend. We’re excited to have .CO on board as a 2012 Annual Partner so we’ll definitely be seeing more of Shireen at future 500 events.</em></em>\n_______________________________________________________\nI can think back to the early 90’s and remember the bulky desktop computer that took an eternity to power on and once it was on, I needed my folks' assistance figuring out the command to type so that I could play my pixelated computer game. The command “win.exe” is not something that today’s children know. They are fortunate enough to be part of a generation that can navigate the web better than their parents and embrace just about every piece of technology that’s offered to them from handheld video games to a touchscreen remote control. To put it simply, if you were to place an iPad in a child’s lap, they will be mesmerized and entertained for hours and chances are, they won’t need your assistance. (Okay, maybe they’ll need your iTunes password but that’s about it).\n\n<em></em>Technology has come a long way since I was kid and I can only begin to imagine what is yet to come. Children are growing up with iPads and laptops as educational aids. Technology is just as much a part of their education as it is their entertainment – so, why not tap into the family tech market?! Think of the endless opportunities that exist for businesses to break into the multi-trillion dollar “mommy market.” Technology impacts the everyday lives of each member of the family – now, it’s your opportunity to create something spectacular that will impact the lives of families around the world.\n\nAs a business owner, entrepreneur or parent, you can skip ahead of the game with the help of some thought-leaders in the family tech industry. Get some inside info on industry trends and projections, get child-specific UX design tips from industry pros – and much more! The best part is that it’s all happening at the MamaBear family tech conference. If that sparked your interest, head over to the event website <a href=\"http://mamabeartech.co/\" target=\"_blank\">mamabeartech.co</a> for the full agenda. You’re guaranteed to be inspired by influencers who are innovating the way families everywhere use technology. Think back to your childhood, what really cool technology did you wish existed? If it doesn’t exist today – create it! Do you have an idea that could make parenting your children less stressful? Get those ideas flowing and we’ll see you in Mountain View, CA at MamaBear!",
    "type": "post",
    "path": "/2012/04/17/thoughts-on-tech-family/"
}