{
    "title": "Top 3 Trends for 500’s Fall Accelerator Applicants",
    "slug": "top-3-trends-for-500s-fall-accelerator-applicants",
    "date": "2013-09-23T16:58:44.000Z",
    "url": "http://500.co/?p=1116729683",
    "uri": "http://500.co/2013/09/23/top-3-trends-for-500s-fall-accelerator-applicants/",
    "postId": "1116729683",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "unsexy",
        "accelerator",
        "b2b",
        "batch007",
        "founders",
        "musings",
        "startups",
        "startups",
        "trends"
    ],
    "content": "<p dir=\"ltr\">After spending several days talking to companies from all around the world, interviews for 500 Startups’ accelerator Batch 007 are over! Overall, this group had not just the highest number of applicants, but also the highest average quality of any batch. Founders are getting smarter about proving assumptions and building businesses based on real-world problems. Most demonstrated traction, and a good portion were already generating revenue, even if modest.</p>\n<p dir=\"ltr\">From the 130+ interviews, we noticed several underlying trends that were quite interesting. The trends fell into 3 areas: startup categories, founder relationships, and what founders actually thought of 500 Startups.</p>\n<p dir=\"ltr\"><strong>Unsexy B2B Startups Are Hot</strong></p>\n<p dir=\"ltr\">We tend to invest in specific categories like consumer commerce, education tech, family tech, SMB/B2B tools, data &amp; productivity, financial services, payments, ticketing, fashion tech, food tech, health tech, and entertainment. So it comes as no surprise that those types of startups tend to apply to our accelerator program.</p>\n<p dir=\"ltr\">Such “unsexy” startups were a common trend. Out of the companies we met, ~60% were B2B plays ranging from business research to real estate investing. This is contrary to the latest Silicon Valley meme that founders only build premium services for themselves (see <a href=\"http://nymag.com/daily/intelligencer/2013/07/bart-strike-shows-privatizations-dark-side.html\">this</a> and <a href=\"http://bits.blogs.nytimes.com/2013/06/02/disruptions-the-echo-chamber-of-silicon-valley/\">this</a>).</p>\n<p dir=\"ltr\">We’re interested in startups that solve real world, non-Silicon-Valley-bubble problems. Of course, we sometimes invest in premium services and consumer startups too. But the trend continues to show that 500 finds unsexy to be very sexy. It’s easy to get early traction with a product that solves #techpeopleproblems, but getting early traction with a non-Valley product typically conveys higher scalability potential.</p>\n<p dir=\"ltr\"><strong>Strong Founder Relationships</strong></p>\n<p dir=\"ltr\">We always ask applicants how well the founders know each other. Founder breakups are one of the biggest causes of startup failure, so a good foundation is critical to a company’s success. Teammates with a long history – like founders who’ve worked on products together, longtime friends, spouses, or even siblings –  are better at navigating the ups and downs, extreme pressure, disagreements, and constant rejection that are a daily part of startup life.</p>\n<p dir=\"ltr\">If co-founders have known each other for a while, they’ve probably been through tough times already – and will probably be able to make it through the difficult times ahead. If co-founders have only known each other for 6 months, they really don’t know how their partner will handle the crazy emotions that come with running a startup.</p>\n<p dir=\"ltr\">One trend we noticed was very close founder relationships. There were quite a few married founders, which we thought was a good sign; some of our portfolio companies with successful exits were run by married founders, including Wildfire Interactive, Khush, Moonfruit, and Viki.</p>\n<p dir=\"ltr\">We noticed that married founders typically had a better dynamic during interviews. One person would state a point, then the other would expand or support their point even further. This is in contrast to some non-married, short-term founders that sometimes contradicted each other, or weren’t as in-sync as founders who knew each other well.</p>\n<p dir=\"ltr\">During our 15-minute interviews, we wanted to see a passionate, in-sync team that’s able to handle the stress of running a startup.</p>\n<p dir=\"ltr\"><strong>500 Startups’ Reputation</strong></p>\n<p dir=\"ltr\">We also asked startups what they wanted to get out of our accelerator program. Their answers told us two things: 1) why people think joining 500 Startups is valuable and 2) what the founders who applied needed help with.</p>\n<p dir=\"ltr\">It’s wasn’t surprising to learn that only a few startups applied to our program because they needed funding. The majority were looking for help with specific areas of their startup that they thought could be improved.</p>\n<p dir=\"ltr\">We emphasize 3 areas of startup expertise: design, data, and distribution. In the last 6 months, we hired 3 distribution hackers-in-residence (<a href=\"http://twitter.com/percival\" target=\"_blank\">Sean Percival</a>,<a href=\"http://twitter.com/malaparte\" target=\"_blank\"> Andrei Marinescu</a>, and <a href=\"http://twitter.com/matthewberman\" target=\"_blank\">myself</a>) and launched the <a href=\"http://500.co/distribution/\">500 Startups Distribution Program</a>. This strategy was validated by the percentage of interviewees who mentioned applying to 500 Startups for our distribution expertise. This was actually the #1 thing founders said they wanted to get out of our accelerator program.</p>\n<p dir=\"ltr\">The second thing people mentioned was our network. With over 200 mentors and 1,000 founders spanning every startup category and area of expertise, it’s obvious why someone would want to be part of the 500 family.</p>\n<p dir=\"ltr\"><strong>Conclusion</strong></p>\nWe met with a ton of talented, passionate, successful founders, so choosing startups to enter this fall’s accelerator program was extremely difficult. Hopefully this gives you some insight into what our selection process is like and what you’re up against when you apply. If you didn’t make it in this time, keep your head up; we’ve had more than a few startups get rejected multiple times before joining the 500 family. Keep hustling!",
    "type": "post",
    "path": "/2013/09/23/top-3-trends-for-500s-fall-accelerator-applicants/",
    "backgroundImage": "/backup/chairs-960x540-2013-09-23-13-11-58.jpg"
}