{
    "title": "The Top 5 Myths about Distributed Teams",
    "slug": "top-5-myths-about-distributed-teams",
    "date": "2011-04-01T01:26:35.000Z",
    "url": "http://blog.500startups.com/?p=1116715183",
    "uri": "http://500.co/2011/03/31/top-5-myths-about-distributed-teams/",
    "postId": "1116715183",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "brainient",
        "distributed-teams",
        "emi-gal",
        "guest-posts",
        "london",
        "startups",
        "uk",
        "video",
        "video",
        "video-ads",
        "video-advertising"
    ],
    "content": "<iframe title=\"YouTube video player\" width=\"640\" height=\"390\" src=\"http://www.youtube.com/embed/17rEfcswE1g\" frameborder=\"0\" allowfullscreen></iframe>\n\n<em><a href=\"http://twitter.com/emigal\" target=\"_blank\">Emi Gal</a> is the founder and CEO of <a href=\"http://brainient.com\" target=\"_blank\">Brainient</a>, part of the 500 Startups family. Based in London, Brainient builds tools that help agencies turn existing video ads into interactive experiences. Brainient is a Seedcamp winner, a The Next Web runner-up and part of the UKTI Global Entrepreneurship Programme. Brainient is Emi's third company. Previously, he founded a number of UK and Romanian startups: Skimbit / Skimlinks, eOk (Romania), BrainTV (Romania), iHireyou (UK), to name a few. Emi is also a speaker and lecturer at various entrepreneurship and internet events, a Seedcamp Week '09 Winner and one of Romania's top 5 achievers according to PEPSI. He blogs very often at <a href=\"http://www.emigal.com/\" target=\"_blank\">www.emigal.com</a></em>\n\n“Yes, we’re seven people, full-time, and our burn-rate is just about ten thousand pounds (which, for those of you across the pond, is about fifteen thousand dollars).” The investor could not believe it. How could seven people work full-time for less than $2500 / month and be able to eat every day? “Location,” I told him while showing a simple slide with the faces of our team members on it.\n\nLocation has always been something I’ve tried leveraging as much as possible in all my entrepreneurial endeavours. It’s worked out quite well so far. At Brainient, we have nine people in Bucharest, Romania and four in London, with the cost of those in London almost the same as the ones in Bucharest.  If we were to employ thirteen people in London, we could not afford it.\n\nThere’s some skepticism regarding outsourcing and distributed teams, deservedly so, because most “outsourcing” projects fail. But having done it for the past few years, I’ve discovered that they can be successful. So here are a few myths floating around that I would like to address, as I think that’s all they are: Myths.\n\n<strong>Myth #1: Distributed teams are difficult to manage\n</strong>That’s true. Except it’s not. As a matter of fact, they’re easier to manage because you have less meetings and less face-time. Which, provided you’ve hired the right people, means better productivity. Of course, there are times when you need to shout at the developers and the internet connection “drops” all of the sudden (ISPs be damned), but other than that you grow to love it after a while. Plus, there’s nothing more pleasant than waking up in the morning to see that the bug you reported in the evening is now fixed.\n\n<strong>Myth #2: Outsourced developers will steal your IP\n</strong>I used to run a web development outsourcing company and not once did I see this happen. Truth be told, there are two types of developers: those who care and those who don’t. Those who care will want to stick with you because you have the product vision and customers, so the IP is somewhat useless to them. Those who don’t only care about the pay-check and don’t give a fuck about the IP (this one’s for you Dave). You don’t want to hire the latter anyway.\n\n<strong>Myth #3: You need to be in the same room in order to be creative\n</strong>When I moved to London almost two years ago, this was my main worry. How will I be able to bounce ideas off my CTO if he’s not sitting in front of me anymore? Well, as it turns out, he is. Skype is King, long live Skype. I actually love it now, because it means I can work from literally anywhere, without the psychological barrier that I have to be in the same room as everyone else. I’m in Hawaii as I write this post. Ok, I’m not but I could be if it weren’t so damn expensive. How about you?\n\n<strong>Myth #4: I don’t speak the language. Oh my, what if they swear at me?\n</strong>Well, first of all, that’s the first thing you need to learn. You’ll use it a lot and McClure likes it. But I’ll tell you a secret: in Eastern Europe, if you’re under 35 and you don’t speak English, you’re a twat. So everybody speaks it. Of course, you’ll often giggle when you hear us speak, but you will be able to communicate. Quite well. Full stop.\n\n<strong>Myth #5: Outsourcing never works\n</strong>I hear this over and over again. But at the same time, many startups have been doing it successfully for years: 37signals, LiveRail, Seesmic and UberVU, to name just a few. And it works like a charm. Ask them.\n\nTo sum up, leveraging location is something every startup should look at. It’s probably not for everyone, but if you need to expand your runway or run faster without fighting Facebook &amp; Google for the smartest brains in town (we all know what that means), you should give it a try. If you need help, drop me an email. (You can find it at <a href=\"http://www.emigal.com\">www.emigal.com</a>) I know some people.",
    "type": "post",
    "path": "/2011/03/31/top-5-myths-about-distributed-teams/"
}