{
    "title": "Top 10 Tech Investing Trends For 2011",
    "slug": "top-10-tech-investing-trends-for-2011",
    "date": "2011-01-16T00:12:56.000Z",
    "url": "http://blog.500startups.com/?p=1116714751",
    "uri": "http://500.co/2011/01/15/top-10-tech-investing-trends-for-2011/",
    "postId": "1116714751",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/01/McClure-231x300.jpg"
    ],
    "creator": "",
    "categories": [
        "955-dreams",
        "amazon",
        "android",
        "appbistro",
        "apple",
        "apsalar",
        "brainient",
        "check-ins",
        "china",
        "crowdflower",
        "crowdsourcing",
        "dave-mcclure",
        "design",
        "facebook",
        "family",
        "family-2-0",
        "foodspotting",
        "foursquare",
        "gazehawk",
        "google",
        "ipad",
        "iphone",
        "kids",
        "language",
        "medialets",
        "musings",
        "mygengo",
        "payvment",
        "retailigence",
        "seniors",
        "tech-predictions",
        "tech-trends",
        "twitter",
        "udemy",
        "ux",
        "video",
        "wildfire-interactive",
        "youtube"
    ],
    "content": "<a href=\"http://www.storenvy.com/products/36295-coloring-book-jonny-s-startup-adventure\" target=\"_blank\"><img class=\"alignnone size-medium wp-image-1116714755\" title=\"McClure\" src=\"/backup/McClure-231x300-2011-01-15-11-18-12.jpg\" alt=\"\" width=\"231\" height=\"300\" /></a>\n\n<em>This post by 500 Overlord <a href=\"http://twitter.com/davemcclure\" target=\"_blank\">Dave McClure</a> was originally published on <a href=\"http://blogs.reuters.com/small-business/2011/01/04/top-10-tech-investing-trends-for-2011/\" target=\"_blank\">Reuters</a>.</em> No apologies for shameless plugs and links on several of our <a href=\"http://500startups.com/companies.php\">500 Startups</a> we believe embody these trends.\n<h2>Top 10 Tech Trends for 2011</h2>\n<strong>1. (Way too many) Groupons, social games and photo-sharing apps</strong>\n\nUnimaginative VCs — which is to say, all of us — tend to start the new year off throwing good money after bad on last year’s tired and expired ideas. 2011 will be no exception for “innovation imitation” with more group-buying ecommerce plays, more social game startups, and even more ways to do photo-sharing on Facebook and Twitter, now new and improved with 37 shades of yellow-gray filters. Humbug. My first easy and obvious prediction is that VCs will waste a ton of money chasing hundreds of “me-too” startup ideas. Nothing new here Kmart shoppers… let’s move along.\n\n<strong>2. Commerce and coupons for location-based services (LBS), aka “The $5 check-in”</strong>\n\nWhile there have been a bajillion startups pitching “check-ins” and location-based services in 2010, I really believe 2011 is the year we see this category finally get some legs and take off. Why? Because companies are finally starting to provide discounts and coupons to customers via mobile devices. And once the affiliate market develops for exchanging location and profile data, we should see more people adopting check-in behavior to qualify for discounts and loyalty programs for their favorite offline services. As I wrote earlier this year in a post called “<a href=\"http://500hats.typepad.com/500blogs/2010/04/checkins-are-coupons.html\">Check-ins are Coupons</a>”, once financial incentives are combined with existing game mechanics, we’ll start seeing mainstream usage for services like Foursquare and Facebook Places. Going forward we will see an explosion of LBS innovation after Google, Facebook, and other platforms begin pushing revenue incentives for apps that facilitate location data.\n\n<strong>3. Crowdsourcing: The Web-enabled mass assembly line</strong>\n\nThe Internet is a great platform for distribution, but now you can use it to reach not only customers, but also workers — it’s called <strong><a href=\"http://en.wikipedia.org/wiki/Crowdsourcing\">crowdsourcing</a></strong>. While Amazon Mechanical Turk has been around for a few years enabling access to thousands of remote workers, new startups like <a href=\"http://crowdflower.com\">Crowdflower</a> (disclosure: I’m an investor) offer platforms for managing the distribution of small, specific tasks to a large and scalable workforce around the world.  By combining the Web with an “on-demand” workforce companies can grow rapidly, remixing both digital and human to weave an entirely new fabric of business services.\n\n<strong>4. URLs for IRL: enabling the Internet of “things”</strong>\n\nYet another innovation around integration: the offline world is quickly becoming stapled into the future by combining physical representations with digital ones. Imagine if everything you touched, held, or viewed in real life became a separate online addressable entity… kind of like slapping a sticker with a URL onto anything and connecting it to the Web. Not quite cyberspace, rather this augmented reality is how we are building out the real world online, and subsequently can deliver benefits of identification, indexing, categorization, discovery, and location to the offline world. This new and enhanced Internet enables offline discovery and navigation of many previously hidden real-world resources. Our investment in <a href=\"http://Retailigence.com\">Retailigence</a> is also connected to this trend.\n\n<strong>5. The Emergence of global languages and geographic arbitrage</strong>\n\nCurrent estimates suggest more that two billion people around the world use the Internet via PCs, and including mobile phones perhaps three billion people are online, or around half the entire population of the earth. As shown by this <a href=\"http://shanghaiist.com/2010/12/23/infographic_chinese_the_new_dominan.php\" target=\"_blank\">infographic</a>, English and Mandarin dominate the online conversation with close to 500 million speakers online and more than a billion offline. Also growing in online influence: Spanish, Arabic, Hindi, and Portuguese. What’s interesting is that these languages also seem poised to drive cultural trends globally. Looking at average GDP and Internet penetration by language, we can map out a geographic playbook for any Internet startup to prioritize how they lay the online smackdown on the planet, and use geographic arbitrage to move the point of innovation, production, and transaction to optimal locations. For more info on this topic, see p.5 of this <a href=\"http://mygengo.com/report/translation-industry-2009\">2009 report on global language trends</a> by <a href=\"http://MyGengo.com\">MyGengo</a>, a 500 Startups portfolio company.\n\n<strong>6. YouTube killed the video star: Distribution and monetization of online video</strong>\n\nAfter years of free online video via YouTube, you’d think it’s impossible for anyone to make money online. But on the contrary: Apple, Netflix, and Hulu are laughing all the way to the bank, and even YouTube itself is rumored to be close to break-even. Massive distribution and monetization platforms are now a reality for online video, which should translate into tremendous opportunities for startups. We've already invested in video monetization startup <a href=\"http://Brainient.com\">Brainient</a> and education video site <a href=\"http://udemy.com\">Udemy</a>; and we have several other video distribution and promotion investments we will announce soon. Expect more innovation and development in video, as millions of iPad and other tablet devices become mainstream, and as YouTube continues to expand its influence on global culture and entertainment. Here’s lookin’ at you, kid.\n\n<strong>7. More iPads, iPhones, iOs Apps and more Android on the way</strong>\n\nApple continues to be an irresistible force of nature when it comes to consumer computing devices and application platforms. Bloggers are already arguing whether Apple will “only” ship 45 million iPads in 2011, or if they’ll exceed 50-60 million units. Nice problem to have for a product barely a year old, eh? At the same time Android devices are growing in popularity, and seem poised to compete effectively with Apple for mobile application dominance. Regardless, both platforms will drive huge amounts of user and developer activity, and the future couldn’t look brighter for startups focused on mobile apps and services. Our investments in mobile ads platform <a href=\"http://medialets.com\">MediaLets</a> and mobile analytics provider <a href=\"http://apsalar.com\">Apsalar</a> reflect our strong belief in the growth of mobile infrastructure services.\n\n<strong>8. Design is the new black: The growing importance of user experience and design</strong>\n\nAlong with Apple’s success — or perhaps because of it — <strong><a href=\"http://www.businessweek.com/innovate/content/jan2010/id20100120_303529.htm\">design has become a critical skill for startups</a></strong>. Apple's fanatic obsession with simplicity and user experience has also become a priority for consumer-focused startups in particular. The most notable example of this is one of my former portfolio companies, Mint.com, acquired by Intuit in 2009. As with Apple, the Mint team had a never-ending passion for design and UX (user experience), and many people attribute much of Mint’s successes to their unique and compelling Web design. I expect the design trend to continue and even accelerate; look for growing and continuing investment in design-driven and UX-driven products. Our  investments in eye-tracking startup <a href=\"http://gazehawk.com\">GazeHawk</a>, foodie pic-porn startup <a href=\"http://Foodspotting.com\">Foodspotting</a>, and in <a href=\"http://955dreams.com\">955 Dreams</a> and their new  <a href=\"http://itunes.apple.com/us/app/historyofjazz/id411521458?mt=8\">History of Jazz app</a> for the iPad are great examples of where we see the industry heading with design and UX.\n\n<strong>9. Family 2.0: Apps for kids and grandmas</strong>\n\nBetter design and better user experience has made it easier for new audiences to start using the Web, particularly the young and the old. My kids – now 3 and 5 – have become big fans of using the iPhone and iPad, and when I watch them their experience is so natural and easy. They never had to read a manual, they just started touching and swiping and pinching – it was <em>magical</em>. But while kids have become easy and eager adopters of these devices, there remains quite a large amount of education content and apps to deliver. And not just for kids, but also for older folks too -- more and more seniors are comfortable with computers and computing devices, so expect a growing market for users of all ages.\n\n<strong>10. Facebook is dead. Long live Facebook.</strong>\n\nSome folks continue to complain that Facebook is overvalued, or Facebook has jumped the shark, or Facebook app development is challenging and the rules change constantly. To these folks I say: <em>stop whining, get over yourselves, and <strong>get to work</strong>.</em> Facebook is an unstoppable global juggernaut 600 million users strong, and dominating our online experience. While Twitter has certainly  grown leaps and bounds too, it’s impossible to ignore how significant Facebook has become as a familiar and frequent environment… for <em>everyone</em>. And generally, this is a good thing. While the idiosyncrasies of Facebook platform change all the time, it’s worth the effort. And regardless of whether you’re building games or productivity tools, there's no question enabling access and distribution through the Facebook ecosystem is a huge benefit for both developers and users. Our investments in this area include social media marketing platform <a href=\"http://wildfireapp.com\">Wildfire Interactive</a>, shopping cart and e-commerce solution <a href=\"http://payvment.com\">Payvment</a>, and <a href=\"http://AppBistro.com\">AppBistro</a> which offers fan page apps and utilities. Expect these startups and more Facebook Connect and “Like” buttons popping up in an online neighborhood near you.\n\nAlright folks, that’s a wrap. Tell me why I’m wrong, stupid, or crazy in the comments below. Happy New Year to everyone!",
    "type": "post",
    "path": "/2011/01/15/top-10-tech-investing-trends-for-2011/"
}