{
    "title": "Top Tech Connectors in Chile & Argentina: The GOAP Organizers  ",
    "slug": "top-tech-connectors-in-chile-argentina-the-goap-organizers",
    "date": "2011-06-16T23:51:01.000Z",
    "url": "http://blog.500startups.com/?p=1116715476",
    "uri": "http://500.co/2011/06/16/top-tech-connectors-in-chile-argentina-the-goap-organizers/",
    "postId": "1116715476",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/06/Geeks.png",
        "http://500.co/wp-content/uploads/2011/06/Tim.png",
        "http://500.co/wp-content/uploads/2011/06/Vanesa.png"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<strong><a href=\"/backup/Geeks-2011-06-16-11-18-51.png\"><img class=\"alignnone size-full wp-image-1116715433\" title=\"Geeks\" src=\"/backup/Geeks-2011-06-16-11-18-51.png\" alt=\"\" width=\"977\" height=\"156\" /></a>\n</strong>\n\n<strong>Want to know how exciting Chile and Argentina are right now? </strong>\n<ul>\n\t<li><strong>Chile’s </strong>focus on entrepreneurship has strong support from the government and its Startup Chile incubator – in fact, President Sebastián Piñera, who was an entrepreneur himself, has made it a government mandate to invest in startups and embrace the future of technology.</li>\n\t<li><strong>Argentina’s </strong>Palermo Valley is brimming with geeks, their tech community is strong, the city of Buenos Aires is a vibrant culture to live and work, and they count startups like Globant and Mercado Libre as hometown successes.</li>\n</ul>\nFrom April 29<sup>th</sup> – May 8<sup>th</sup>, Geeks on a Plane (#GOAP) toured Brazil, Chile and Argentina and had the extremely unique experience of connecting with other geeks throughout South America.  Check out the video:\n\n<iframe width=\"560\" height=\"349\" src=\"http://www.youtube.com/embed/Kc1Ia56wl3w\" frameborder=\"0\" allowfullscreen></iframe>\n\nAlong the way, we partnered with tech connectors on the ground who helped to organize events, rally the community, and support the GOAP mission: to connect geeks worldwide, share challenges and opportunities, and make new friends.\n\nWant to get hyper-connected in Chile &amp; Argentina? Here’s who you need to ping…\n\n<strong><span style=\"text-decoration: underline;\">Tim Delhaes</span></strong>\nDirector Americas, First Tuesday\nSantiago, Chile\nFind Tim on Facebook <a href=\"https://www.facebook.com/tim.delhaes\">HERE</a>\n<a href=\"http://twitter.com/#!/tim_delhaes\">@tim_delhaes\n</a> <a href=\"/backup/Tim-2011-06-16-11-18-51.png\"><img class=\"alignnone size-full wp-image-1116715482\" title=\"Tim\" src=\"/backup/Tim-2011-06-16-11-18-51.png\" alt=\"\" width=\"311\" height=\"416\" /></a>\n<strong>What is your background and how did you end up in the world of entrepreneurship?</strong>\n<em>My last “traditional” job was working as a surfing instructor on a small German island</em><em> when I was 16. Even at the beach I could not tolerate having people ordering me around and telling me when to surf or not.</em>\n<strong>What does a geek in Chile look like?</strong>\n<em>Usually a broke musician or alcoholic comic artist.</em>\n<strong>How has the face of entrepreneurship in Chile changed in the last 5-10 years?</strong>\n<em>In an </em><a href=\"http://youtu.be/1bzt3W2rVaI\"><em>interview </em></a><em>before his last concert, Bono - a self declared “Chile fan” - said that Chile´s exciting past is one of the things that brings U2 back every few years. But, he continued, more exciting than the past is the country´s future. The country has become “sexy”. </em>\n<em>Living in Chile for over 10 years, starting, busting and selling start-up´s has been a wild ride. We have shared this journey with many other entrepreneurs in Chile who have contributed to the transformation of Chile from a third world country with no translation for the word \"venture capital\" to an international brand with a vibrant and multinational economy.</em>\n<strong>What is the biggest challenge entrepreneurs face in Chile?</strong>\n<em>Chile is still lacking \"entrepreneurial culture\". More competitive markets, faster iteration of ideas, more honesty and acceptance of failure are part of that. No matter how heavy your foot is on the gas, the traffic only lets you drive in first gear.</em>\n<strong>What changes would you like to see in the startup ecosystem in Chile?</strong>\n<em>While in Silicon Valley usually a lot of second rate ideas can evolve into multinationals, in Chile the few shitty ideas usually stay shitty ideas. Chile needs more networking events that allow for faster “street smart” learning as well as more innovation in financial instruments, specifically for the missing middle.</em>\n<strong>What are the advantages to having a startup in Chile?</strong>\n<em>It’s hard to beat the quality of life mixed with consistent economic growth and unbeatable sense of security. Go </em><a href=\"http://bit.ly/kH2gdH%20\"><em>surfing</em></a><em>, sailing, skiing, climbing, hiking or parachuting within one hour of the city without getting robbed, shot or living behind cement walls.</em>\n<strong>What are some unmet needs that you think entrepreneurs should pursue in Chile?</strong>\n<em>Want to make money? Go clone something.</em>\n<em>Want to innovate? Ask yourself what can you do in Chile that is hard to do somewhere else? What local industries exist that could use innovation? Where can you \"pivot\" with customers quickly?</em>\n<strong>What have been some of your failures, and what have you learned from them?</strong>\n<em>Timing is everything. You can be a great surfer but without waves you will paddle your ass off with no results. Once you have waves, its timing again: one second too late you won’t get the wave. One second too early you go over the falls.</em>\n<strong>How can entrepreneurs in Chile get connected with the tech ecosystem there?</strong>\n<em>Join us at </em><a href=\"http://bit.ly/9YnJkc%20%20\"><em>firsttuesday.cl</em></a>\n<strong>Who has been your greatest inspiration and why?</strong>\n<a href=\"http://www.youtube.com/watch?v=s0Pw7vKtqpo\"><em>Laird Hamilton</em></a><em>, apart from riding 60 foot waves and making it look like a walk in the park, invented tow surfing as </em><a href=\"http://bit.ly/iGCSiA%20\"><em>foil boarding</em></a><em>. Go out, Invent a sport.</em>\n<strong>What do you love most about living in Chile? What is a MUST SEE for visitors?</strong>\n<em>Leave the city, go </em><a href=\"http://bit.ly/kH2gdH%20\"><em>surfing</em></a><em>, sailing, skiing, climbing, hiking or parachuting. Give me a call to join in;)</em>\n<strong>Describe your experience with Geeks on a Plane. Why does it matter to entrepreneurs there?</strong>\n<em>Always put lifestyle - not work - first. There is no better thing than to make new friends, share a beer, wine or Pisco Sour.  Trust is the base of all business. GOAP is a great example of that.</em>\n<em> </em>\n\n<strong><span style=\"text-decoration: underline;\">Vanesa Kolodziej</span></strong>\nFounder, Palermo Valley\nBuenos Aires, Argentina\nConnect with Vanesa on Facebook <a href=\"https://www.facebook.com/vanesak\">HERE</a>\n<a href=\"http://twitter.com/#!/vanesak\">@Vanesak\n</a> <a href=\"/backup/Vanesa-2011-06-16-11-18-51.png\"><img class=\"alignnone size-full wp-image-1116715480\" title=\"Vanesa\" src=\"/backup/Vanesa-2011-06-16-11-18-51.png\" alt=\"\" width=\"312\" height=\"416\" /></a>\n<strong>What is your background and how did you end up in the world of entrepreneurship?</strong>\n<em>I finished high school at the Lester B Pearson United World College in Canada, with students from 80 countries from around the world and studied Political Science at San Andrés University in Buenos Aires, Argentina. I also took some MBA classes at Babson College. San Andrés is an amazing institution, where I got not only a world-class education but it also introduced me to entrepreneurship. I was fortunate enough to study there with some of the best local entrepreneurs, who started their own businesses as soon as they graduated. So I followed and learned from them.</em>\n<strong>What does a geek in Argentina look like?</strong>\n<em>He or she definitely works in Palermo, is most probably a Mac user but could have both an iPhone and an Android phone at the same time, and has attended many Palermo Valley Nights. If the geek is a guy, he loves soccer (Futboll as we call it). If the geek is a girl, she will buy her clothes at the local design shops in the Palermo area.</em>\n<strong>How has the face of entrepreneurship in Argentina changed in the last 5-10 years?</strong>\n<em>Entrepreneurship has changed tremendously, thanks to the increase in ideas and technology transfer (due to the extended use of blogs, among many others), and the deep decrease of the cost to start a company. This was helped for a long period of time by a favorable dollars to peso exchange rate, where building companies locally was very cheap in dollar value. Nowadays more people are learning all they need online, then starting their businesses and gaining much traction with little investment. Also, the ecosystem has matured much and many successful entrepreneurs have become angel investors, helping and supporting a new batch of entrepreneurs. </em>\n<strong>Which, in your opinion, are the 3 most successful tech startups in Argentina and why do they matter?</strong>\n<em>Mercado Libre (www.mercadolibre.com) is the main e-commerce website of Latin America, present in 12 countries and having a presence in Nasdaq (MELI). It also offers one of the main payment platforms, Mercado Pago. Started in 1999 by Hernan Kazah and Marcos Galperin, then students at Stanford, it quickly grew to become one of the most successful companies in Lat Am</em>.\n<em>Globant (www.globant.com) is the main Argentinean software development house. Started in 2003, it has grown to have more than 2000 employees and global operations, having Google, LinkedIn, Disney and EA, among many others. It was stated by Martin Migoya (CEO), Guibert Englebienne (CTO), Nestor Nocetti (VP Innovation Labs) and Martin Umaran (COO).</em>\n<em>OLX (www.olx.com) is the main free classified provider in India, Portugal, Mexico and South America. Stated in Buenos Aires in 2006 by Fabrice Grinda (Co- CEO) and Alec Oxenford (Co- CEO), it has grown to be used in 96 countries and have classifieds in 40 languages.</em>\n<strong>What is the biggest challenge entrepreneurs face in Argentina?</strong>\n<em>There are many challenges, including the limited local market size and the lack of investment capital. What I consider to be the most important challenge also constitutes the base for the most important strength of Argentinean Entrepreneurs: the constant instability and rule changes, that has helped local entrepreneurs to develop a special stamina that prepared them to deal with uncertainty and chaos, a great core competence in today’s constantly changing world.</em>\n<strong>What changes would you like to see in the startup ecosystem in Argentina?</strong>\n<em>Argentina has amazingly creative entrepreneurs, who are always willing to give 100% for their projects in all areas. We need two things: first, to have more capital available for these entrepreneurs and their start ups. We need to have more investors, especially at the early stage level, who will be willing to risk their money in creative ideas. Second, we need to have more mentors: we need more experienced entrepreneurs transferring their knowledge and experience, and providing valuable recommendations.</em>\n<strong>What are the advantages to having a startup in Buenos Aires?</strong>\n<em>Buenos Aires is an amazing city to start a business. The human resources and the talent available are great. Also, there is a big entrepreneurial community, with events almost every week and much needed peer support. Finally, the city is so vibrant, so alive, that it is constantly providing entrepreneurs with new ideas and inspiration. </em>\n<strong>What are some unmet needs that you think entrepreneurs should pursue in Argentina?</strong>\n<em>There are many unmet needs, especially in the e-commerce area, as well as in the mobile and payments areas. Another sector that could dramatically benefit from clever entrepreneurial solutions are the problems of the bottom of the Pyramid consumers (those who live with less than 2 dollars a day), including education, transactions and media consumption, among many.</em>\n<strong>What have been some of your failures, and what have you learned from them?</strong>\n<em>I have many failures from which to obtain valuable learning. My latest one taught me a simple but very important lesson for all entrepreneurs: to ask what I wanted, if I don’t ask, I will never receive. But to ask, you need to have a clear idea of what you want. My lesson: decide what you want and ask for it! You will most probably get it.</em>\n<strong>How can entrepreneurs in Buenos Aires get connected with the tech ecosystem there?</strong>\n<em>The main local tech connector is Palermo Valley, a NGO that organizes networking events almost every month, for 500+ entrepreneurs and tech related people. I co-founded it 3 years ago: it started as a simple twitter message, and it has grown to a movement with similar events in over 50 cities in LatAm and the US. If you are in town, do not miss your opportunity to connect with the local community at a Palermo Valley event.</em>\n<em>You can also check Startup Digest Buenos Aires, which I co-curate, for the most updated tech events every week.</em>\n<strong>Who has been your greatest inspiration and why?</strong><em> </em>\n<em>I have an enormous admiration for the Mercado Libre co-founders, Marcos Galperin and Hernan Kazah. They have created one of the most amazing companies in Lat Am following simple but effective principles: great focus and impeccable execution. They have done what all entrepreneurs can only dream of: ringing the Nasdaq bell! And they are still incredibly approachable people, always willing to help the local entrepreneurs with advice and contacts.</em>\n<strong>What do you love most about living in Buenos Aires? What is a MUST SEE for visitors?</strong>\n<em>I love EVERYTHING! I love the super modern Puerto Madero where you can safely walk down its Rivera any time of the day and night, the design and chic stores in Palermo, the Boca Soccer stadium that looks like it’s alive each time the local team plays there, the coffee stores at any corner, the great bbq restaurants, the parks... Come to BA in November or December... you will fall in love with the city and its energy, I promise!</em>\n<strong>Describe your experience with Geeks on a Plane. Why does it matter to entrepreneurs there?</strong>\n<em>I had the most amazing experience with the GOAP group, and all of them seemed to have had a great experience in BA too! They had a chance to meet many local entrepreneurs and organizations, and have great fun also!</em>\n<em>It was a really important visit for our ecosystem too: it helped put Buenos Aires on the map for many people in Silicon Valley and other tech centers. Also, many entrepreneurs had a chance to exchange ideas, create new links and explore business opportunities. I hope GOAP South America becomes an annual trip!</em>\n\nOther folks who helped us in Chile &amp; Argentina include:\n\t<li>Alan Farcas – Organizer in Santiago and Managing Director, Endeavor Chile</li>\n\t<li>Oskar Hjertonsson - Organizer in Santiago and Founder, Groupon Latin America</li>\n\t<li>Endeavor.org – Many other folks at Endeavor Brazil, Chile, Argentina, &amp; Global</li>\n\t<li>For the awesome connectors in Brazil – check out this post <a href=\"http://500.co/2011/06/15/top-tech-connectors-in-brazil-the-goap-organizers/\">HERE</a>.</li>\nMore info on Geeks on a Plane and upcoming trips to Asia and India can be found at <a href=\"http://geeksonaplane.com/\">www.geeksonaplane.com</a>",
    "type": "post",
    "path": "/2011/06/16/top-tech-connectors-in-chile-argentina-the-goap-organizers/"
}