{
    "title": "Top Tech Connectors in Brazil: The GOAP Organizers",
    "slug": "top-tech-connectors-in-brazil-the-goap-organizers",
    "date": "2011-06-16T03:35:04.000Z",
    "url": "http://blog.500startups.com/?p=1116715416",
    "uri": "http://500.co/2011/06/15/top-tech-connectors-in-brazil-the-goap-organizers/",
    "postId": "1116715416",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/06/Geeks.png",
        "http://500.co/wp-content/uploads/2011/06/Rein-300x198.png",
        "http://500.co/wp-content/uploads/2011/06/Ricardo-Normand-300x200.png",
        "http://500.co/wp-content/uploads/2011/06/Veronica-Serra-146x300.png"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<a href=\"/backup/Geeks-2011-06-15-11-22-35.png\"><img class=\"alignnone size-full wp-image-1116715433\" title=\"Geeks\" src=\"/backup/Geeks-2011-06-15-11-22-35.png\" alt=\"\" width=\"977\" height=\"156\" /></a>\n\n<strong>Want to know how exciting Brazil is right now? </strong>\n<ul>\n\t<li><strong>Brazil’s </strong>middle class is booming, their economy is growing steadily, and the 2014 World Cup &amp; 2016 Olympics have made it one of the most attractive emerging markets worldwide.</li>\n</ul>\nFrom April 29<sup>th</sup> – May 8<sup>th</sup>, Geeks on a Plane (#GOAP) toured Brazil, Chile and Argentina and had the extremely unique experience of connecting with other geeks throughout South America.  Check out the video:\n<div id=\"playnav-curvideo-title\">\n\n<iframe width=\"560\" height=\"349\" src=\"http://www.youtube.com/embed/Kc1Ia56wl3w\" frameborder=\"0\" allowfullscreen></iframe>\n\nAlong the way, we partnered with tech connectors on the ground who helped to organize events, rally the community, and support the GOAP mission: to connect geeks worldwide, share challenges and opportunities, and make new friends.\n\nWant to get hyper-connected in Brazil? Here’s who you need to ping…\n\n<strong><span style=\"text-decoration: underline;\">Reinaldo Normand</span></strong>\nCEO &amp; Co-Founder, 2Mundos\nSao Paulo &amp; Rio de Janeiro, Brazil\nFind Reinaldo on Facebook <a href=\"https://www.facebook.com/profile.php?id=1237355651\">HERE</a>\n<a href=\"http://twitter.com/#!/rnormand\">@rnormand\n</a> ﻿﻿﻿﻿<a href=\"http://500.co/wp-content/uploads/2011/06/Rein.png\"><img class=\"alignnone size-medium wp-image-1116715428\" title=\"Reinaldo Normand\" src=\"/backup/Rein-300x198-2011-06-15-11-22-35.png\" alt=\"\" width=\"300\" height=\"198\" /></a>\n<strong>What is your background and how did you end up in the world of entrepreneurship?</strong>\n<em>I started my first company at 19 when I worked at an Internet ISP in Belo Horizonte, Brazil. After that, I started 5 other companies in Brazil, the U.S., and China. Currently, I am based out of San Francisco with a social gaming company focused on Brazil. </em>\n<strong>What does a geek in (your city) look like?</strong>\n<em>A geek is a normal person but prefers wifi over beer. </em>\n<strong>How has the face of entrepreneurship in Brazil changed in the last 5-10 years?</strong>\n<em>In Brazil, until 2009, entrepreneurs were seen as losers. That is not the case anymore. Entrepreneurs are cool and they're flocking all over. </em>\n<strong>Which, in your opinion, are the 3 most successful tech startups in Brazil and why do they matter?</strong>\n<em>Submarino, Buscapé and Peixe Urbano. Submarino was founded during the bubble and has spearheaded e-commerce in Brazil.  Buscapé was the largest exit so far and Peixe Urbano leads the pack of Groupon clones, showing that execution is more important than branding. </em>\n<strong>What is the biggest challenge entrepreneurs face in Brazil?</strong>\n<em>Lack of experience, an open environment to share ideas and networking and lack of mentorship. Also, the legislation punishes those who want to start a company. </em>\n<strong>What changes would you like to see in the startup ecosystem in Brazil?</strong>\n<em>More interaction between Silicon Valley and Brazil. Changes in the labor laws, tax system and mindset of politicians to support startups. <strong> </strong></em>\n<strong>What are the advantages to having a startup in Brazil?</strong>\n<em>1) The internal market is huge. 2) The hype Brazil is getting right now. 3) The unfulfilled opportunities. </em>\n<strong>What are some unmet needs that you think entrepreneurs should pursue in Brazil?</strong>\n<em>Mostly focus on the needs for the World Cup 2014 and the Olympic Games. These are the best opportunities for startups right now to get traction. </em>\n<strong>What have been some of your failures, and what have you learned from them?</strong>\n<em>I ran an internet portal in 1999 and was about to be acquired. I wasn’t prepared for the bubble burst that occurred in April 2000. After that, I was abandoned – I had no money left and was almost bankrupt. I needed to scale down and start from zero again. Timing is everything. </em>\n<strong>How can entrepreneurs in Brazil get connected with the tech ecosystem there?</strong>\n<em>Mostly through social networks and meetups organized by companies such as Brazil Innovators and universities. </em>\n<strong>Who has been your greatest inspiration and why?</strong>\n<em>Carl Sagan. The man was ahead of his time, made very complex subjects looks simple and was bold enough to face the establishment with his beliefs. He was the first serious scientist to talk seriously about black holes, alien life and other dimensions. </em>\n<strong>What do you love most about living in your city? What is a MUST SEE for visitors?</strong>\n<em>I live in San Francisco now but in my hometown, Belo Horizonte, I recommend that people go to the happy hours that happen every day in the thousands of bars scattered around the city. </em>\n<strong>Describe your experience with Geeks on a Plane. Why does it matter to entrepreneurs there?</strong>\n<em>It is amazing how you meet awesome people that are really low profile and at the same time accomplished. I think the greatest effect of GOAP in a country such as Brazil is to raise awareness about entrepreneurship and bring the mentoring and experience of Silicon Valley folks to local entrepreneurs.</em>\n\n<strong><span style=\"text-decoration: underline;\">Ricardo Normand</span></strong>\nCo-Founder, Perspeck\nSao Paulo &amp; Rio de Janeiro, Brazil\nFind him on Facebook <a href=\"https://www.facebook.com/profile.php?id=100000188988938\">HERE</a>\n<a href=\"http://twitter.com/#!/rinormand\">@rinormand\n</a> <strong> </strong><a href=\"http://500.co/wp-content/uploads/2011/06/Ricardo-Normand.png\"><img class=\"alignnone size-medium wp-image-1116715431\" title=\"Ricardo Normand\" src=\"/backup/Ricardo-Normand-300x200-2011-06-15-11-22-35.png\" alt=\"\" width=\"300\" height=\"200\" /></a>\n<strong>What is your background and how did you end up in the world of entrepreneurship?</strong>\n<em>I am a seasoned professional with a depth of experience in different industries, particularly dealing with venture capital investments in life sciences and IT, strategic planning and entrepreneurship. I have a solid educational background in different and complementary areas of knowledge, from biology to law, and IT &amp; Finance. I have always had an entrepreneurial soul. My experience as a Seed Capital fund manager in tech companies brought me back to this amazing world of entrepreneurship - now as an entrepreneur!!</em>\n<strong>What does a geek in Brazil look like?</strong>\n<em>Looks like every Geek around the world, sometimes they are exotic, sometimes they look like ordinary people...</em>\n<strong>How has the face of entrepreneurship in Brazil changed in the last 5-10 years?</strong>\n<em>In Brazil, it has changed a lot in the last 5 years. We didn't have an entrepreneurship culture in the past because we were a hyperinflation country, but now entrepreneurs are becoming more organized and are better than ever..</em>\n<strong>Which, in your opinion, are the 3 most successful tech startups in Brazil and why do they matter? </strong>\n<em>i. Sensedia (www.sensedia.com) a startup that is a spin-off from one of the most successful IT companies in Brazil (Ci&amp;T). Sensedia has its own high-level tech entrepreneurs and started as a world class company - now based in Brazil and US.</em>\n<em>ii. Busca Pé (www.buscape.com.br) - probably the most successful startup in Brazil (the largest exit until now) that is still growing by acquisitions of many other tech startups - not so common in Brazil...</em>\n<em>iii. Deskmetrics (www.deskmetrics.com.br) - is the newest one, but a very promising startup nonetheless. They raised angel investor money from the beginning and are looking to reach the global market. They think big!</em>\n<strong>What is the biggest challenge entrepreneurs face in Brazil?</strong>\n<em>Our ecosystem is so young that is so difficult to start here: i. Because it is not easy to sell tech solutions to other companies in Brazil; ii. Our early stage investment structure is just starting to increase now; and iii. Brazil has one of highest tax-to-GDP rates in the world, over 35% and taxes are so numerous and complicated that it encourages informality (hence, tax evasion), discouraging innovation.</em>\n<strong>What changes would you like to see in the startup ecosystem in Brazil?</strong>\n<em>i. To have more investors looking for early stage and startup companies (angel investors, VC's, etc); ii. To have a specific legal system (taxes) for tech startup companies; and iii. More international investors looking and investing in opportunities here - they can help to quickly change our ecosystem.</em>\n<strong>What are the advantages to having a startup in Brazil?</strong>\n<em>Nowadays, Brazil has a larger market than ever and the country is more stable. Furthermore we are a very \"social country” and we have creative people - a nice place for all kinds of social apps development.</em>\n<strong>What are some unmet needs that you think entrepreneurs should pursue in Brazil?</strong>\n<em>Most of our entrepreneurs are 1st time entrepreneurs. So, they need to learn more about how to build a business (and make money). A great place for accelerators in my opinion...</em>\n<strong>What have been some of your failures, and what have you learned from them?</strong>\n<em>As manager of the 1st seed capital fund in Brazil I didn't realize that most of our entrepreneurs had no understanding about venture capital and the startup process. We had some amazing tech solutions in our portfolio, but usually the entrepreneurs didn't realize how to make a successful company. Some nice companies died during this period... We have to help our entrepreneurs in many ways and work hands-on inside the companies.</em>\n<strong>How can entrepreneurs in Brazil get connected with the tech ecosystem there?</strong>\n<em>Nowadays they have been more organized. We have a lot of initiatives of startup meeting all around the country, but the investors’ community has to participate more in these kinds of events to help the ecosystem mature quickly. </em>\n<strong>Who has been your greatest inspiration and why?</strong>\n<em>Pitch Johnson from Asset Management Company - he showed me that it is possible to change and create an ecosystem. You just have to be connected to the right people and work hard. You will have success if you are persistent in what you believe. </em>\n<strong>What do you love most about living in your city? What is a MUST SEE for visitors?</strong>\n<em>Belo Horizonte-MG (Brazil) is one of the most important cities after São Paulo and Rio de Janeiro, but a better place to live IMHO. All visitors have to visit our historical cities around here - baroque architecture. </em>\n<strong>Describe your experience with Geeks on a Plane. Why does it matter to entrepreneurs there?</strong>\n<em>It was an awesome experience to be able to connect with a large and diversified  group of people (geeks, entrepreneurs, VC's and investors).  After the 1st group from Silicon Valley that we brought in November, 2010 to be connected with the entrepreneur community all around the world, Silicon Valley will help us put Brazil on the map of potential opportunities.</em>\n\n<strong><span style=\"text-decoration: underline;\">Veronica Serra</span></strong>\nFounding Partner, <em>Pacific Investimentos</em>\nSao Paulo, Brazil\n<a href=\"http://500.co/wp-content/uploads/2011/06/Veronica-Serra.png\"><img class=\"alignnone size-medium wp-image-1116715432\" title=\"Veronica Serra\" src=\"/backup/Veronica-Serra-146x300-2011-06-15-11-22-35.png\" alt=\"\" width=\"146\" height=\"300\" /></a>\n<strong>What is your background and how did you end up in the world of entrepreneurship?</strong>\n<em>I'm a private equity investor but have been investing my own capital in early stage companies for more than a decade. I am also part of endeavor.org which supports entrepreneurs </em>\n<strong>What does a geek in Brazil look like?</strong>\n<em>Like anywhere else</em>\n<strong>How has the face of entrepreneurship in Brazil changed in the last 5-10 years?</strong>\n<em>Entrepreneurship has grown to be recognized, and despite all challenges, today there is more access to capital.</em>\n<strong>Which, in your opinion, are the 3 most successful tech startups in Brazil and why do they matter?</strong>\n<em>1. Mercado Libre - a regional success with its largest operation in Brazil. Has been the consolidator in its market, helped many smaller retailers access the e-tail market and is a pioneer on secure payments</em>\n<em>2. Buscapé: successful, gained scale and helps everyone buy better online</em>\n<em>3. Zaz - a pioneer at its time, acquired later by Terra (Telefonica)</em>\n<strong>What is the biggest challenge entrepreneurs face in Brazil?</strong>\n<em>There are challenges with the complex tax and labor system, high interest rates and poor infrastructure</em>\n<strong>What changes would you like to see in the startup ecosystem in Brazil?</strong>\n<em>- On the entrepreneur side: more down to earth expectations on valuation, more informed about standard investment terms and governance</em>\n<em>- On the buyer side: large corporations being more open to doing business with tech start-ups</em>\n<em>- On the press - more coverage on the sector</em>\n<strong>What are the advantages to having a startup in Brazil?</strong>\n<em>São Paulo - largest consumer market in Brazil, qualified workforce, large corporate customers - all in one huge city</em>\n<strong>What are some unmet needs that you think entrepreneurs should pursue in Brazil?</strong>\n<em>Mobile applications, security applications that work, technologies that serve classes C &amp; D</em>\n<strong>What have been some of your failures, and what have you learned from them?</strong>\n<em>Early on, trusting people who did not deserve it</em>\n<strong>How can entrepreneurs in Brazil get connected with the tech ecosystem there?</strong>\n<em>Being open and reaching out to other entrepreneurs, angel investors and endeavor.org</em>\n<strong>Who has been your greatest inspiration and why?</strong>\n<em>Various entrepreneurs who are resilient, think big, work hard and built amazing businesses, some of them global</em>\n<strong>What do you love most about living in your city? What is a MUST SEE for visitors?</strong>\n<em>The diversity and energy. A must see? The great restaurants and art galleries on week days, and the gorgeous beaches on the seaside during the weekends</em>\n<strong>Describe your experience with Geeks on a Plane. Why does it matter to entrepreneurs there?</strong>\n<em>I was intro’d by Wences Casares, and helped organize a day of visits in São Paulo, later hosting everyone for a dinner at my place. Interesting to meet people involved with innovation in a variety of ways.</em>\n<em> </em>\n\n<em> </em>\n\nOther folks who helped us in Brazil include:\n<ul>\n\t<li>Wenceslao Casares – Co-organizer of GOAP South America and Co-CEO, Bling Nation</li>\n\t<li>Bedy Yang – Organizer in Sao Paulo and Founder, Brazil Innovators</li>\n\t<li>Diego Remus &amp; Bob Wolheim – Orgainzer in Sao Paulo and Founders, Startupi</li>\n\t<li>Endeavor.org – Many other folks at Endeavor Brazil, Chile, Argentina, &amp; Global</li>\n</ul>\nMore info on Geeks on a Plane and upcoming trips to Asia and India can be found at <a href=\"http://geeksonaplane.com/\">www.geeksonaplane.com</a>\n\n</div>",
    "type": "post",
    "path": "/2011/06/15/top-tech-connectors-in-brazil-the-goap-organizers/"
}