{
    "title": "Traction and Sustainable Growth – A How-to Guide for Startups   ",
    "slug": "traction-and-sustainable-growth-a-how-to-guide-for-startups",
    "date": "2013-08-28T17:08:12.000Z",
    "url": "http://500.co/?p=1116729477",
    "uri": "http://500.co/2013/08/28/traction-and-sustainable-growth-a-how-to-guide-for-startups/",
    "postId": "1116729477",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/08/tony-stark-blows-kisses.gif",
        "http://500.co/wp-content/uploads/2013/08/catpillow.gif",
        "http://500.co/wp-content/uploads/2013/08/catDJ.gif",
        "http://500.co/wp-content/uploads/2013/08/kittenmoving.gif",
        "http://500.co/wp-content/uploads/2013/08/emailtiming.png",
        "http://500.co/wp-content/uploads/2013/08/listentodave.png"
    ],
    "creator": "",
    "categories": [
        "content",
        "distribution",
        "emails",
        "growth",
        "growth-hacking",
        "seo",
        "startups",
        "traction"
    ],
    "content": "<p dir=\"ltr\"><em>Today’s guest post is by the co-founder of <a href=\"http://limk.com/\">Limk</a>, <a href=\"http://twitter.com/OguzSerdar\" target=\"_blank\">Oguz Serdar</a>. Get even more distribution tips by following @<a href=\"https://twitter.com/500Distribution\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\">email newsletter</a>.</em></p>\n<p dir=\"ltr\">So you’ve built a decent, functional product. You’re proud of it. You tell yourself that your growth curve should always look like a hockey stick—up and to the right.</p>\n<p dir=\"ltr\">\"If you build it, they will come.” At least that’s what you thought. That might have worked for Kevin Costner's character in Field of Dreams, but in the real world, that kind of thinking will make your startup fail. Since most startups die because they don’t get enough traction, sustainable growth should be your #1 goal.</p>\n<p dir=\"ltr\">Here’s an overview on getting traction and growth for your startup:</p>\n<p dir=\"ltr\"><strong>Be really awesome or be really trustworthy</strong></p>\n<p dir=\"ltr\"><a href=\"/backup/tony-stark-blows-kisses-2013-08-28-13-12-08.gif\"><img class=\"aligncenter size-full wp-image-1116729491\" alt=\"tony-stark-blows-kisses\" src=\"/backup/tony-stark-blows-kisses-2013-08-28-13-12-08.gif\" width=\"245\" height=\"296\" /></a></p>\n<p dir=\"ltr\">Some products really <em>are</em> awesome enough to attract 25,000 users on their first day (<a href=\"http://www.quora.com/Instagram/How-did-Instagram-get-its-first-25-000-signups\">Instagram</a>) or have 50 million users (<a href=\"http://news.yahoo.com/waze-sale-signals-growth-israeli-high-tech-174533585.html\">Waze</a>) over time because of their unique value proposition. This could be a subject for an entirely different post, but let’s focus on the methods applicable to any startup, instead of looking at rare success stories.</p>\n<p dir=\"ltr\">When you're still getting the right product/market fit, you should invest effort in creating trust in your brand by doing the following:</p>\n<p dir=\"ltr\"><strong>Aggressive and continuous SEO</strong></p>\n<p dir=\"ltr\"><a href=\"/backup/catpillow-2013-08-28-13-12-08.gif\"><img class=\"aligncenter size-full wp-image-1116729493\" alt=\"catpillow\" src=\"/backup/catpillow-2013-08-28-13-12-08.gif\" width=\"240\" height=\"169\" /></a></p>\n<p dir=\"ltr\">Compared to other sources, visitors coming from search engines are likely to stay on your site longer. This is because people put trust in Google and other search engines they use daily. Use this to your advantage! Be aggressive when applying any of the following SEO techniques to your website:</p>\n\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><a href=\"http://www.slideshare.net/oguzserdar/how-to-20887921/13\">Build a pyramid around your content</a>: Make sure to have your entire content on the bottom of that pyramid, and start redistributing content by focusing on the keywords that you aim high in search engines.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><a href=\"http://www.slideshare.net/oguzserdar/how-to-20887921/13\">Keep systematically link building</a>: Link building still works to get better SERP rankings. Make sure to do continuous link building in your content pyramid. The algorithms of search engines might change over time, but keep in mind you’re dealing with machines that have specific rules, not with people who do SERP rankings all day long. As long as you’re not trying to fool with them with dirty, spammy methods, you’ll get more traffic.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Use the right <a href=\"http://schema.org/\">schema markup</a>, depending on your content: When used correctly, schema markup can greatly increase your SERP visibility and presence. Just be sure to select the appropriate markup, depending on your content type. I’ll give two examples: Do you have video content? Use the video schema markup to get results such as <a href=\"http://shuffle.limk.com/images/limk_seo.jpg\">this</a>. Get creative: Do you have song information from <a href=\"https://plus.google.com/+Madonna/about\">Madonna</a> as your content? Make her the page author or, even better, include <a href=\"http://www.youtube.com/watch?v=EDwb9jOVRtU\">an official video</a> with video schema markup of the related item—and watch the results over time.</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Create a loyal social media fan base</strong></p>\n<p dir=\"ltr\"><a href=\"/backup/catDJ-2013-08-28-13-12-08.gif\"><img class=\"aligncenter size-full wp-image-1116729495\" alt=\"catDJ\" src=\"/backup/catDJ-2013-08-28-13-12-08.gif\" width=\"395\" height=\"230\" /></a></p>\n&nbsp;\n<p dir=\"ltr\">Don’t underestimate the amount of traffic you can drive from different social media channels. And it’s not just about how many followers you have in your official accounts. Follow these rules:</p>\n\n<ul>\n\t<li>1st rule: Social media is not about YOU.</li>\n\t<li>2nc rule: Social media IS NOT about YOU.</li>\n\t<li>3rd rule: It’s about THEM.</li>\n\t<li>4th rule: Keep them interested with GREAT CONTENT.</li>\n</ul>\n<p dir=\"ltr\">Every social media platform has different characteristics, so the best thing to do is have specific game plans for different social media platforms.</p>\n<strong>Let’s take a closer look:</strong>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Twitter: Try to engage with the thought leaders of your market. Get them to retweet your content. Consider creating imaginary characters in your niche such as <a href=\"https://twitter.com/FAKEGRIMLOCK\">FAKEGRIMLOCK</a> or <a href=\"https://twitter.com/StartupLJackson\">Startup L. Jackson</a>. Be as creative as possible with 140 characters, and regularly encourage your existing website audience to tweet your content.  See <a href=\"https://dashboard.io/blog/the-impact-of-immigration-on-entrepreneurship-and-the-us-economy\">this</a> example.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><a href=\"http://www.slideshare.net/oguzserdar/how-to-20887921/12\">Facebook</a>:  Keeping your targeted audience in mind, and run experiments—not only on your official Facebook page but also with related pages that you create for your audience. Is your startup a community for geeks? Slowly grow another Facebook page where people claim “I love science.” Is your startup about web developers? Do the same with another page that’s focused on humor for programmers. You get the point.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Stumbleupon, Reddit etc.: Platforms like these are driven by a combination of <a href=\"http://moz.com/blog/reddit-stumbleupon-delicious-and-hacker-news-algorithms-exposed\">algorithms</a> and user-submitted content. Find boards and channels related to your startup and build a small audience. Once you start getting initial traffic, display some indicators to your incoming visitors from these platforms to nudge your content items back to the platforms. Keep repeating this process.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Quora: This works best for certain niches, like SAAS products. Have someone on your team  answer related questions for your market. If you have a killer feature you can use to your advantage, make sure there’s a question about that pain point and do your best when answering it. You can even ask existing customers to answer those questions and explain how awesome your product is.</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Syndicate Your Content</strong></p>\n<p dir=\"ltr\"><a href=\"/backup/kittenmoving-2013-08-28-13-12-08.gif\"><img class=\"aligncenter size-full wp-image-1116729497\" alt=\"kittenmoving\" src=\"/backup/kittenmoving-2013-08-28-13-12-08.gif\" width=\"380\" height=\"240\" /></a>In a perfect world, you’d get big publishers like Gawker and LifeHacker to syndicate every new blog post you write. Getting them to share your content is hard, but possible. The techniques below are often used to get attention from big publishers:</p>\n\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Create content directly or indirectly related to your audience. If your product helps people lose weight, blog about health and weight loss—use scientific facts that are applicable to anyone.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Reach out to popular bloggers in your niche, and ask them to distribute your posts. Make sure your content is interesting and not overly self-promotional.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Use <a href=\"http://www.helpareporter.com/\">HARO</a> (Help a Reporter Out). Rather than trying to guess what the press is going to write, help them out—even if it’s not directly related to your product.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Do your content syndication at first. Redistribute your blog post on <a href=\"http://tumblr.com/\">Tumblr</a>, <a href=\"http://blog.quora.com/Introducing-Blogs-on-Quora\">Quora Blog</a>, <a href=\"http://medium.com/\">Medium</a>, and other platforms. Create a schedule for pushing your content out onto these platforms.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Leverage the content recommendation platforms. My startup is building <a href=\"http://limk.com/shuffle/\">one</a>, but there are a few <a href=\"http://www.quora.com/Content-Discovery/Which-content-discovery-platform-is-best-for-earning-money-Outbrain-Gravity-nRelate-which-one-do-you-use-and-why/answer/Alicia-Salsbury\">other platforms</a> you can use to syndicate or promote your content.</p>\n</li>\n</ul>\n<p dir=\"ltr\">This isn’t something you can achieve overnight, but you'll start to see results if you keep at it.</p>\n<p dir=\"ltr\"><strong>Programmable Lifecycle Emails</strong></p>\n<p dir=\"ltr\"><a href=\"/backup/emailtiming-2013-08-28-13-12-08.png\"><img class=\"aligncenter size-full wp-image-1116729499\" alt=\"emailtiming\" src=\"/backup/emailtiming-2013-08-28-13-12-08.png\" width=\"600\" height=\"330\" /></a></p>\n<p dir=\"ltr\">Once you start getting lots of traction, you’ll need a process to keep people using your product. <a href=\"http://www.slideshare.net/oguzserdar/how-to-20887921/14\">There are a couple great services</a> that can help you define required triggers and set an indefinite emailing process to keep up with your users. Here are some tips to consider when planning these emails:</p>\n\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Welcome them personally. Send an email to new users a few hours after they sign up, and offer personal help from someone on your team. Preferably one of the founders.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Set up condition-based triggers such as sessions, steps. Think with a pirate mindset (<a href=\"http://playbook.thoughtbot.com/defining-actionable-metrics/aarrr/\">AAARR</a>), and define the most important data points for your activation stage. Encourage your users to complete those steps to increase activation rates in general.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Group your users, and reward loyal users. In most web communities, 95% of the total audience is comprised of lurkers, followers, and wallflowers. Use emails to reward and give exclusivity to  your power users.</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Use time-period-based emails. This is your turn to increase retention rates by encouraging not-so-active users. Don’t email a user more than once, but make sure to use multiple time periods (i.e., if last seen &gt; 5 days, if last seen &gt; 7 days). You can also use this method to educate your users, especially if you’re trying to sell something (i.e., 7 days after signup date, 30 days after signup date).</p>\n</li>\n</ul>\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">The Rule of Seven. The old marketing adage says that a prospect needs to see or hear your marketing message at least seven times before they take action and buy from you. Use this rule when planning your emails.</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Copy 99% of the time, be innovative 1% of the time — rinse and repeat</strong></p>\n<p dir=\"ltr\"><a href=\"/backup/listentodave-2013-08-28-13-12-08.png\"><img class=\"aligncenter size-full wp-image-1116729501\" alt=\"listentodave\" src=\"/backup/listentodave-2013-08-28-13-12-08.png\" width=\"600\" height=\"392\" /></a> <a href=\"http://www.slideshare.net/oguzserdar/how-to-20887921/5\">My last piece of advice</a> comes from Sith Lord Dave McClure. Whether you call it “growth hacking” or something else, these techniques—and similar ones—have been around for years. They’re not rocket science. Don’t reinvent the wheel when it comes to planning sustainable growth. Use what makes sense for your startup – then use 1% of your time to try something new and innovative. If you keep optimizing, I guarantee you’ll see amazing results!</p>\n<strong>Conclusion</strong>\n<p dir=\"ltr\">Traction is the only thing that matters for startups. And traction even trumps team and vision when going for a big round of fundraising.</p>\nBe lean, but <a href=\"http://www.slideshare.net/oguzserdar/how-to-20887921/17\">don’t use it as an excuse to not take sales and marketing seriously</a>. Focus on traction as early as possible, and set aside time every day to try different techniques. Good luck.",
    "type": "post",
    "path": "/2013/08/28/traction-and-sustainable-growth-a-how-to-guide-for-startups/",
    "backgroundImage": "/backup/version2-2013-08-28-13-12-08.jpg"
}