{
    "title": "Announcing Twilio Fund for 500 Startups",
    "slug": "twilio-fund-for-500-startups",
    "date": "2010-09-23T19:14:54.000Z",
    "url": "http://blog.500startups.com/?p=1116714142",
    "uri": "http://500.co/2010/09/23/twilio-fund-for-500-startups/",
    "postId": "1116714142",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/09/twiliofund.png?w=263"
    ],
    "creator": "",
    "categories": [
        "announcements",
        "microfund",
        "microfunds",
        "platforms",
        "platforms",
        "twilio",
        "twilio-fund"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2010/09/twiliofund.png\"><img class=\"alignnone size-medium wp-image-1116714159\" title=\"twiliofund\" src=\"http://500.co/wp-content/uploads/2010/09/twiliofund.png?w=263\" alt=\"\" width=\"263\" height=\"300\" /></a>\n\nToday we’re excited to announce <a href=\"http://500startups.com/twiliofund\">Twilio Fund</a>, a $250,000 micro-fund for investments in startups that are powered by <a href=\"http://twilio.com\">Twilio</a>’s APIs for phone calls and text messages. Via Twilio Fund, we’ll offer investments of $10,000 in up to 10 companies for a 1% stake in the company. In addition, one or more of these companies may be selected for a $50,000 investment and invitation to participate in our soon-to-be announced accelerator program at the 500 Startups space in Mountain View, CA. (You can also read about this <a href=\"http://gigaom.com/2010/09/23/got-a-twilio-based-app-get-some-investment-dollars/\">announcement here</a>)\n\n<strong>Startups Helping Startups\n</strong>About two years ago, Twilio launched as an unfunded fledgling company, setting out to disrupt the telecommunications industry and bring the fire of telephony down the mountain to the world of over 10 million web developers. The founding team worked from coffee shops and coworking spaces, and gained notoriety for <a href=\"http://techcrunch.com/2008/11/18/no-one-is-safe-from-the-rickroll-now/\">rickrolling</a> TechCrunch’s Michael Arrington, and later writing Google Voice in <a href=\"http://techcrunch.com/2008/11/20/twilio-powerful-api-for-phone-services-that-can-recreate-grandcentral-in-15-lines-of-code/\">15 lines of code</a>.  Things moved quickly from launch and today, Twilio has amassed a substantial following in the developer world, with an active developer community of over 20,000 ranging from Fortune 100s to young scrappy startups.\n\nYou can find members of the Twilio team at startup events and hackathons like Super Happy Dev House, <a href=\"http://www.startupweekend.org\">Startup Weekend</a>, and next week's <a href=\"http://disrupt.techcrunch.com/2010-sf/)\">TechCrunch Disrupt</a>.\n\n<strong>Building a Business on Twilio\n</strong>The Twilio team is passionate about building great tools for developers which in turn help their businesses, products, or new features launch faster, often at a fraction of the cost. To date, hundreds of startups have leveraged Twilio in a wide range of use cases like support hotlines, call tracking, marketing, notifications, and many more. Developers use Twilio’s paid APIs to programmatically make and receive phone calls and text messages -- something which is common to hundreds of thousands of web applications but has been complicated, unreliable, and expensive to implement until now.\n\nDave makes it clear in his <a href=\"http://500hats.typepad.com/500blogs/2010/07/moneyball-for-startups.html\">investment thesis</a> that startups should have their revenue model nailed down from the beginning and acquire paying customers soon after. Because Twilio costs money, it’s critical for startups using their APIs to know how they’re going to support that cost. So it’s not uncommon that Twilio-powered startups have a clear revenue model in place and are on their way to building a profitable business.\n\nWe’ve seen startups integrating Twilio into their products, including a number of our own portfolio companies like <a href=\"http://www.teachstreet.com\">TeachStreet</a>, <a href=\"http://homeboodle.com\">HomeBoodle</a>, and <a href=\"http://www.mogotix.com\">Mogotix</a> (which just <a href=\"http://gigaom.com/2010/09/23/mogotix-looks-to-accelerate-mobile-ticketing/\">recently launched</a>). We’re excited about the emergence of these Twilio-powered companies and look forward to making investments in this ecosystem of innovative, creative, impactful companies. Twilio has grown into a powerful developer platform, and when it comes to supporting builders and entrepreneurs, we’re putting our money where our mouth is.\n\n<strong>How the Micro-Fund Application Process Works\n</strong>A few details about the application process:\n<ul>\n\t<li>Applications will be accepted starting <strong>Monday September 27th</strong> through <strong>10pm PST on November 16, 2010</strong> at <a href=\"http://500startups.com/twiliofund\">http://500startups.com/twiliofund</a>.</li>\n\t<li>The most promising companies will be invited to meet with Dave at the 500 Startups space in Mountain View, CA during the <strong>weekend of December 4th.</strong></li>\n\t<li>Investment decisions will be made the <strong>week of December 6th.</strong></li>\n</ul>\nIf you’re currently working on a startup and weren’t thinking of using Twilio, now might be a good time to investigate integrating Twilio’s APIs into your product to get your foot in the door.\n\nWe’ll update you on <a href=\"http://twitter.com/500startups\">@500startups</a> when we open up the application process on Monday. Until then, take a look at the <a href=\"http://twilio.com\">Twilio APIs</a> and get coding!",
    "type": "post",
    "path": "/2010/09/23/twilio-fund-for-500-startups/"
}