{
    "title": "7 New Twilio Fund Winners: Fightin' Crime, Helpin' Seniors, Bringin' Sexting Back.",
    "slug": "twilio-fund-bringing-sexting-back",
    "date": "2011-03-01T23:26:40.000Z",
    "url": "http://blog.500startups.com/?p=1116715076",
    "uri": "http://500.co/2011/03/01/twilio-fund-bringing-sexting-back/",
    "postId": "1116715076",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/02/twiliofund-263x300.png",
        "http://500.co/wp-content/uploads/2011/02/workersnow-300x86.png",
        "http://500.co/wp-content/uploads/2011/02/callyo-300x115.png",
        "http://500.co/wp-content/uploads/2011/02/magnoliaprime-300x67.png",
        "http://500.co/wp-content/uploads/2011/02/fastcall411-300x103.png",
        "http://500.co/wp-content/uploads/2011/02/qwipd.png",
        "http://500.co/wp-content/uploads/2011/02/knockknock-300x108.png",
        "http://500.co/wp-content/uploads/2011/03/GetVolta.jpg"
    ],
    "creator": "",
    "categories": [
        "announcements",
        "callyo",
        "fastcall411",
        "knockknock",
        "magnolia-prime",
        "micro-funds",
        "microfunds",
        "platforms",
        "platforms",
        "qwipd",
        "twilio",
        "twilio-fund",
        "volta",
        "workersnow"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/02/twiliofund.png\"><img class=\"alignnone size-medium wp-image-1116715083\" title=\"twiliofund\" src=\"/backup/twiliofund-263x300-2011-03-01-11-17-26.png\" alt=\"\" width=\"263\" height=\"300\" /></a>\n\n<em>This announcement is also referenced by articles in the following publications: <a href=\"http://mashable.com/2011/03/01/twilio-fund/\">Mashable</a>, <a href=\"http://blog.programmableweb.com/2011/03/01/twilio-startup-fund-announces-six-more-winners/\">ProgrammableWeb</a>.</em>\n\nLast December, we <a href=\"http://500.co/2010/12/21/twilio-fund-ends-world-hunger-makes-voicemail-fun-again-enlists-a-few-good-superheroes-sort-of/\">announced the first 3 recipients</a> of the Twilio Fund. To refresh your memories - the <a href=\"http://500.co/2010/09/23/twilio-fund-for-500-startups/\">Twilio Fund</a> is a new ‘microfund’ investment model for 500 Startups. Through the Twilio Fund, we invest $10,000 in companies building on top of the Twilio platform. In addition, one or more of these $10K recipients may be selected for a $50,000 investment and invitation to participate in the 500 Startups accelerator program.\n\nWe’re excited to announce 7 new Twilio Fund $10K recipients!\n<ul>\n\t<li><a href=\"http://workersnow.com\">WorkersNow</a> - crowdsourced labor platform for general contractors</li>\n\t<li><a href=\"http://callyo.com/\">Callyo</a> - phone number provisioning for law enforcement agencies</li>\n\t<li><a href=\"http://magnoliaprime.com/\">MagnoliaPrime</a> - custom voice messaging for seniors &amp; caregivers</li>\n\t<li><a href=\"http://fastcall411.com/\">FastCall411</a> - lead generation for local search publishers</li>\n\t<li><a href=\"http://qwipd.com/\">Qwipd</a> - service for flirting, \"sexting\", &amp; other greetings via SMS</li>\n\t<li><a href=\"http://knockknock.in/\">KnockKnock</a> - mobile app to navigate customer service phone mazes</li>\n\t<li><a href=\"http://getvolta.com\">Volta</a> - A/B testing framework for live, outbound phone calls</li>\n</ul>\nMeet the latest Twilio Fund recipients below, in their own words:\n<p style=\"padding-left: 30px;\"><a href=\"http://500.co/wp-content/uploads/2011/02/workersnow.png\"><img class=\"alignnone size-medium wp-image-1116715082\" title=\"workersnow\" src=\"/backup/workersnow-300x86-2011-03-01-11-17-26.png\" alt=\"\" width=\"300\" height=\"86\" /></a></p>\n<p style=\"padding-left: 30px;\"><strong><a href=\"”http://workerexpress.com/”\" target=\"”_blank”\">WorkersNow</a></strong></p>\n<p style=\"padding-left: 30px;\">WorkersNow is delivering a revolutionary hiring experience to construction contractors. Our online staffing platform brings contractors the flexibility to hire temporary labor with the convenience of expediting the hiring process. WorkerExpress is passionate about empowerment through labor. We offer workers the ability to showcase their skills and guarantee them payment for their services. We’re not your run-of-the-mill web startup. We solve tangible problems (e.g. how do you make sure someone does not get injured at a job site) and place a high emphasis on revenue and listening to our customers. We then build solutions that solve a customer's pain.</p>\n<p style=\"padding-left: 30px;\">WorkersNow was founded by a Pablo Fuentes, a Stanford MBA (UCLA undergraduate) and Joe Mellin, a Stanford d.school product designer (Cal undergraduate) with product management experience. Our CTO is Sean Falconer, PhD in Computer Science from University of Victoria and Stanford Medical School post-doc.</p>\n<p style=\"padding-left: 30px;\"><a href=\"http://500.co/wp-content/uploads/2011/02/callyo.png\"><img class=\"alignnone size-medium wp-image-1116715077\" title=\"callyo\" src=\"/backup/callyo-300x115-2011-03-01-11-17-26.png\" alt=\"\" width=\"300\" height=\"115\" /></a></p>\n<p style=\"padding-left: 30px;\"><strong><a href=\"”http://www.callyo.com”\" target=\"”_blank”\">Callyo</a></strong>\nAs criminals become more sophisticated, local and state police must equip themselves with equally sophisticated intelligence technology. Callyo was created to bring a higher level of innovation and efficiency to law enforcement agencies and first responders nationwide – regardless of their size – to help everyday police officers serve and protect us better. Callyo’s products include Virtual Investigation Phones, Undercover Police Bugs, Mobile Court Orders, Crime Tip Lines, Radio Interoperability Solutions, Social Media Intelligence platforms and other cutting edge technologies. Twilio’s cloud communication platform is an important component of Callyo, enabling rapid provisioning of numbers, complex call routing, recording and transcriptions services. In a business where reliability is essential, Callyo trusts the Twilio network for vital police communications, where a dropped or misrouted call could put an officer’s life in danger.</p>\n<p style=\"padding-left: 30px;\">Callyo was founded by crisis technologist Chris Bennett. Bennett is a graduate of Harvard University and The Wharton School and has received such prestigious recognitions as Florida’s Public Information Award. His team consists of talented developers and law enforcement experts alike, where hackers and covert operations detectives gather around the whiteboard James Bond style to solve important problems in police intelligence.</p>\n<p style=\"padding-left: 30px;\"><a href=\"http://500.co/wp-content/uploads/2011/02/magnoliaprime.png\"><img class=\"alignnone size-medium wp-image-1116715080\" title=\"magnoliaprime\" src=\"/backup/magnoliaprime-300x67-2011-03-01-11-17-26.png\" alt=\"\" width=\"300\" height=\"67\" /></a></p>\n<p style=\"padding-left: 30px;\"><strong><a href=\"”http://magnoliaprime.com/”\" target=\"”_blank”\">Magnolia Prime, Inc.</a></strong></p>\n<p style=\"padding-left: 30px;\">Magnolia Prime is an innovative, proprietary service that allows a health care clinician or other caregiver to set up and deliver customized voice messages to a specific elderly person’s telephone at a time defined by the clinician or caregiver. Think of Magnolia Prime as social networking for the senior set that is coupled with \"On Star\" benefits.</p>\n<p style=\"padding-left: 30px;\">By the year 2020, there will be over 70MM elderly individuals in the U.S. Many senior citizens are uncomfortable interacting with the world via computers, smart phones, or other high tech gadgets; Magnolia Prime provides technology-appropriate solutions to help the elderly remain independent and in their homes. Twilio is an important link that allows Magnolia Prime to reach seniors on their terms.</p>\n<p style=\"padding-left: 30px;\">Twilio's extensive API for phone and text message notification delivery allows Magnolia Prime to leverage it's patent-pending processes to their full measure. Twilio was selected as a service provider for its reliability and outstanding developer support.</p>\n<p style=\"padding-left: 30px;\">One senior described her Magnolia Prime experience by saying, “All of your information is helpful. I couldn't do anything without you.” A clinician reported, “What I found compelling about the Magnolia Prime is the simplicity of use for health care agencies focused on quality care and the bottom line. As staff we must implement patient care plans in a timely manner, while maintaining the relationship with the client and providing quality care. This service helps agencies manage these things in a simple and cost effective way.”</p>\n<p style=\"padding-left: 30px;\"><a href=\"http://500.co/wp-content/uploads/2011/02/fastcall411.png\"><img class=\"alignnone size-medium wp-image-1116715078\" title=\"fastcall411\" src=\"/backup/fastcall411-300x103-2011-03-01-11-17-26.png\" alt=\"\" width=\"300\" height=\"103\" /></a></p>\n<p style=\"padding-left: 30px;\"><strong><a href=\"”http://fastcall411.com/”\" target=\"”_blank”\">FastCall411</a></strong></p>\n<p style=\"padding-left: 30px;\">Companies with mobile local search directories find it difficult to engage and sell local merchants. FastCall411 solves this problem using Twilio-powered voice applications, integrated with proprietary technology and deep analytics. We improve clients' sales efficiencies and are paid based on success.</p>\n<p style=\"padding-left: 30px;\">The FastCall411 product stack uses every aspect of the Twilio API: automated outbound dialing, assigning telephone numbers, tracking inbound calls, conference calls, call recording, SMS notifications, etc. Call reporting is presented within the native Salesforce reporting interface and dashboards. We also deliver click-to-call (with answering machine drop) and click-to-SMS within the Salesforce lead and contact objects. If you can image the idea inside sales platform - we are building it with Twilio and Salesforce.com.</p>\n<p style=\"padding-left: 30px;\">Here’s an example of an outbound verification call (powered by Twilio) that will also be available in the Salesforce.com App Exchange: <a href=\"http://www.fastcall411.com/contact\" target=\"_blank\">http://www.fastcall411.com/contact</a></p>\n<p style=\"padding-left: 30px;\">FastCall411 is gaining traction and in production. Customers include a public company with deep roots in local search. The team includes Richard Rosen, CEO, and David Jones, PhD, CTO. The company also has a rock star advisory board made up of leaders in mobile local search.</p>\n<p style=\"padding-left: 30px;\"><a href=\"/backup/qwipd-2011-03-01-11-17-26.png\"><img class=\"alignnone size-full wp-image-1116715081\" title=\"qwipd\" src=\"/backup/qwipd-2011-03-01-11-17-26.png\" alt=\"\" width=\"300\" height=\"131\" /></a></p>\n<p style=\"padding-left: 30px;\"><strong><a href=\"”http://qwipd.com”\" target=\"”_blank”\">Qwipd.com</a></strong>\nThe term “sexting” went from an Urban Dictionary oddity to mainstream lingo within six months – and now it has its own webpage.  Qwipd.com helps users send witty, flirtatious text messages to partners over their mobile phones. Using the Twilio platform to send and receive text messages, Qwipd gives users A and B choices that allow them and their partner to control the direction, tone, and “steaminess” of the banter – it’s the choose-your-own-ending story you always wanted.</p>\n<p style=\"padding-left: 30px;\">Qwipd covers both ‘just for fun’ flirting and occasion-based messages for birthdays, Valentine’s Day, or anniversaries. Users can browse through a variety of opening lines to find one that fits their style – whether that be role-playing Neo and Trinity or commiserating over the White Stripes. Qwipd focuses on mobility and real-time messaging to deliver the next generation of sexting: Flirting 2.0.</p>\n<p style=\"padding-left: 30px;\">Qwipd was founded by Jeff Tannenbaum, who has been working in consumer internet products for the last 15 years and plans on never mailing a Christmas card again.</p>\n<p style=\"padding-left: 30px;\"><a href=\"http://500.co/wp-content/uploads/2011/02/knockknock.png\"><img class=\"alignnone size-medium wp-image-1116715079\" title=\"knockknock\" src=\"/backup/knockknock-300x108-2011-03-01-11-17-26.png\" alt=\"\" width=\"300\" height=\"108\" /></a></p>\n<p style=\"padding-left: 30px;\"><strong><a href=\"”http://knockknock.in/”\" target=\"”_blank”\">KnockKnock</a></strong>\nknockknock is a mobile app with a Twilio backend for navigating customer service phone mazes.  Forget waiting on hold or dialing to navigate. Users indicate who they want to speak with (e.g. \"Comcast\"), and what they want to speak about (e.g. \"Report a Problem with My Service\"), then hang up.  They receive a call back once knockknock has navigated the phone maze, then waited on hold to fetch a human being who is ready to help them.</p>\n<p style=\"padding-left: 30px;\">We don't rely on any cooperation from the companies themselves, and instantly support virtually every phone maze.  As a result, we can save our users literally years of collective time every single month.  knockknock is Jon Turow and Rishi Bhat, who met at UPenn in Philadelphia way back in 2003.</p>\n<p style=\"padding-left: 30px;\"></p>\n<p style=\"padding-left: 30px;\"><a href=\"http://GetVolta.com\"><img class=\"alignnone size-full wp-image-1116715097\" title=\"Volta\" src=\"/backup/GetVolta-2011-03-01-11-17-26.jpg\" alt=\"Volta: the A/B testing framework for live, outbound phone calls.\" width=\"254\" height=\"115\" /></a></p>\n<p style=\"padding-left: 30px;\"><strong><a href=\"http://getvolta.com\">Volta</a></strong></p>\n<p style=\"padding-left: 30px;\"><strong><a href=\"http://getvolta.com\"></a></strong>Volta<strong> </strong>is an A/B testing framework for live, outbound phone calls, powered by Twilio. Via simple API, companies can insert event-based call \"triggers\" into their existing software. When calls are triggered, agents log in and begin calling. Volta provides analytics that measure the effectiveness of each call. By testing and improving the attributes of call scripts and live agents, outbound phone strategies become more effective... and more profitable. Volta shows businesses what works for outbound calls.  Volta won <a href=\"http://launch.is/blog/closing-ceremonies-the-launch-2011-awards.html\">Best Business Model</a> at the Launch 2011 conference last week.  Patrick Stockwell is the founder/CEO of Volta.</p>\n<strong>What's next? </strong>In a few weeks, we will be announcing a $50K recipient from these ten $10K recipients. This company will also receive an offer to participate in the next <a href=\"http://500startups.com/accelerator\">500 Startups Accelerator program</a>. Once we announce the $50K recipient, we will “re-open” the doors on the Twilio Fund and start looking for the next batch of Twilio-powered startups to join the Twilio Fund. So hang onto your hats and stay tuned!",
    "type": "post",
    "path": "/2011/03/01/twilio-fund-bringing-sexting-back/"
}