{
    "title": "Go F*#% Yourself! Unconventional Ways to Bootstrap Your Startup Idea",
    "slug": "unconventional-ways-to-bootstrap-your-startup-idea",
    "date": "2010-11-02T16:47:48.000Z",
    "url": "http://blog.500startups.com/?p=1116714410",
    "uri": "http://500.co/2010/11/02/unconventional-ways-to-bootstrap-your-startup-idea/",
    "postId": "1116714447",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/11/image0-150x150.png",
        "http://500.co/wp-content/uploads/2010/11/image1.png",
        "http://500.co/wp-content/uploads/2010/11/image2.png?w=126",
        "http://500.co/wp-content/uploads/2010/11/image3.png?w=150",
        "http://500.co/wp-content/uploads/2010/11/image4-150x150.png"
    ],
    "creator": "",
    "categories": [
        "bootstrapping",
        "crowdfunding",
        "friends-and-family",
        "funding",
        "fundraising",
        "guest-posts",
        "lending-club",
        "mentors",
        "microfinance",
        "p2p",
        "peer-to-peer-lending",
        "private-funding",
        "rob-garcia",
        "social-loan",
        "super-angels",
        "tips",
        "zorro"
    ],
    "content": "(…and by f*#%, I mean “fund!”)\n\n<a href=\"http://500.co/wp-content/uploads/2010/11/image0.png\"><img class=\"alignnone size-thumbnail wp-image-1116714442\" title=\"image0\" src=\"/backup/image0-150x150-2010-11-02-10-10-47.png\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"/backup/image1-2010-11-02-10-10-47.png\"><img class=\"alignnone size-full wp-image-1116714414\" title=\"image1\" src=\"/backup/image1-2010-11-02-10-10-47.png\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet Zorro, aka SuperMentor <a href=\"http://twitter.com/#!/robgarciasj\">Rob Garcia</a>. Rob oversees product strategy at Lending Club.  Rob has over 12 years of experience building extraordinary digital user experiences as a consultant and entrepreneur.  His super powers include destroying evil user interactions, envisioning innovative products, and building user-centric armies.</em>\n\nWe all know about the traditional angel investors and venture capitalists as your main source of capital when starting a business.  But they typically prefer to jump in when there is a something tangible to look at (beta product or proof-of-concept).   Before you get to that point, most entrepreneurs finance themselves to build the minimum feature-set that will wow both customers and potential investors.  So how do you fund your idea until then? <strong>Fund yourself!</strong>\n\n<em><strong>Traditional Funding Sources</strong></em>\n\n<em><strong> </strong></em>Perhaps your idea is good enough that you have family, friends, angels, and even venture capitalists ready to go on it with you.  The reality is that not many ideas get funded at this stage.  Instead, you try to scour time and resources from your friends and business network to get your idea up and running.  You will most likely incur expenses on your credit card or your savings will be depleted to get you through this phase.\n\nIn fact, this is what happened to Lending Club’s founder, Renaud Laplanche. Renaud financed his first company primarily with credit cards. Then he looked at the statements, asking himself “What am I doing paying 18% to the credit card companies??”\n\nThe bad news is that the current financial crisis has made everyone more conscious with their money, making it even harder to bootstrap your business idea.  It has been documented extensively how venture capitalists are being extra cautious while credit card companies keep increasing their rates for no other reason other than just to keep the service available, even to good credit card holders.\n\nWell, don't despair... the good news is that tough times are also the hotbed of innovation, and the financial industry is no exception.\n\n<em><strong>Unconventional Funding Sources</strong></em>\n\n<em><strong> </strong></em>Several alternatives have emerged recently connecting people with money to those who need it, and this is nothing but great news for entrepreneurs.  <strong>Super angels, peer-to-peer lending, microfinance, crowdfunding, </strong>and<strong> private family funding</strong> are some of the financial innovations coming out of the Web 2.0 revolution that can be very useful to entrepreneurs:\n\n<strong>Super Angels: </strong>A new trend in angel investing, Super Angels are very active angel investors who make hundreds of small investments in short periods of time hoping to ignite some great ideas and hit it big time.  They’re fast, nimble and fun… and typically more responsive than your run-of-the-mill angel investor.\n\n<strong>Peer-to-Peer Lending:</strong> Get up to $25,000 with a 3 or 5 year fixed rate personal loan from strangers at <a href=\"http://lendingclub.com\" target=\"_blank\">Lending Club</a> or Prosper.com.  That’s right: s-t-r-a-n-g-e-r-s! You can get funded by other people and you don't even need to know who they are.   Nearly 8% of the loans on  <a href=\"http://lendingclub.com\" target=\"_blank\">Lending Club</a> are used for business purposes.  Before you jump on one of these sites, make sure your credit history shows responsible financial behavior and a good credit score to qualify.  Interest rates on peer-to-peer loans are typically lower than those of similar loans at a traditional lending institution.\n\n<a href=\"http://500.co/wp-content/uploads/2010/11/image2.png\"><img title=\"image2\" src=\"http://500.co/wp-content/uploads/2010/11/image2.png?w=126\" alt=\"\" width=\"126\" height=\"150\" /></a>\n\n<a href=\"http://500.co/wp-content/uploads/2010/11/image2.png\"></a><strong>Microfinance:</strong> Get a small business loan from <a href=\"http://kiva.com\" target=\"_blank\">Kiva</a> or <a href=\"https://www.microplace.com/\" target=\"_blank\">Microplace</a> to help you get started.   Even though these sites have primarily focused on entrepreneurs in third world countries, they opened to US-based businesses last year, with help from fantastic organizations like <a href=\"http://www.accionusa.org/\" target=\"_blank\">Accion USA</a> and <a href=\"http://www.opportunityfund.org/\" target=\"_blank\">Opportunity Fund</a>.\n\n<strong><a href=\"http://500.co/wp-content/uploads/2010/11/image3.png\"><img class=\"alignnone size-thumbnail wp-image-1116714416\" title=\"image3\" src=\"http://500.co/wp-content/uploads/2010/11/image3.png?w=150\" alt=\"\" width=\"150\" height=\"117\" /></a></strong>\n\n<strong><a href=\"http://500.co/wp-content/uploads/2010/11/image3.png\"></a>Crowdfunding</strong>: Let the \"crowd\" fund you through widgets and websites that allow you to appeal to the world (starting with the 4 Fs: fans, friends, family and fools) and through your social networks (Facebook, Twitter, MySpace, LinkedIn, etc), then collect the dough to get you going.  This has worked modestly well for the music industry with sites like <a href=\"http://slicethepie.com\" target=\"_blank\">SliceThePie.com</a> and <a href=\"http://SellaBand.com\" target=\"_blank\">SellaBand.com</a> leading the crow funding movement.  <a href=\"http://kickstarter.com\" target=\"_blank\">Kickstarter.com</a> and <a href=\"http://www.indiegogo.com\" target=\"_blank\">IndieGogo.com</a> have taken the concept and applied it to any endeavor from art to code (wait, coding is an art too, right?), but <a href=\"http://40Billion.com\" target=\"_blank\">40Billion.com</a> is the first one to focus on startups.  Also, <a href=\"http://www.chipin.com/\" target=\"_blank\">Chipin</a> is a nifty little widget that allows you to collect money for any cause.  The last entrant in this space is <a href=\"http://www.profounder.com\" target=\"_blank\">Profounder</a>, the brainchild of former Kiva cofounder Jessica Jackley.\n\n<strong><a href=\"http://500.co/wp-content/uploads/2010/11/image4.png\"><img class=\"alignnone size-thumbnail wp-image-1116714446\" title=\"image4\" src=\"/backup/image4-150x150-2010-11-02-10-10-47.png\" alt=\"\" width=\"150\" height=\"150\" /></a></strong>\n\n<strong>Private Family Funding</strong>: Have a friend or family member who is willing to give you a \"social loan\" until you hit it big?  Don't just take the money and create an awkward situation that could damage your relationship for years to come... nothing worse than hiding from uncle Bill at the Thanksgiving dinner.  Instead, formalize the loan via sites like <a href=\"http://virginmoneyUS.com\" target=\"_blank\">VirginMoneyUS.com</a> or <a href=\"http://lendingkarma.com\" target=\"_blank\">LendingKarma.com</a>, which let you create the necessary legal documentation to track the loan for a modest fee.  You get the benefit of negotiating the loan terms directly while building your credit and your startup.\n\nSee? Bootstrapping is more exciting than ever before. There are innovative options that did not exist just 3 years ago, and they should not be ignored.  If you have the right idea, the passion, and the drive to make it happen, don't let it die. Give it a chance.\n\n<em>Images courtesy of <a href=\"http://www.flickr.com/photos/jamescridland/613445810/\" target=\"_blank\">James Cridland</a>, <a href=\"http://www.flickr.com/photos/configmanager/4469766057/in/photostream/\" target=\"_blank\">configmanager</a>, <a href=\"http://www.nytimes.com/2008/08/24/weekinreview/24kershaw.html\" target=\"_blank\">Lewis Scott</a>/New York Times, and <a href=\"http://www.post-gazette.com/pg/07252/815600-28.stm\" target=\"_blank\">Daniel Marsula</a>/Post-Gazette.</em>",
    "type": "post",
    "path": "/2010/11/02/unconventional-ways-to-bootstrap-your-startup-idea/"
}