{
    "title": "Use SCIENCE to Get More Customers: The Distribution Hacking Framework",
    "slug": "use-science-to-get-more-customers-the-distribution-hacking-framework",
    "date": "2013-03-21T22:40:37.000Z",
    "url": "http://500.co/?p=1116726419",
    "uri": "http://500.co/2013/03/21/use-science-to-get-more-customers-the-distribution-hacking-framework/",
    "postId": "1116726419",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/03/dog.jpg",
        "http://500.co/wp-content/uploads/2013/03/wenn5366126-1024x682.jpg"
    ],
    "creator": "",
    "categories": [
        "adwords",
        "distribution",
        "distribution",
        "distribution-hacking",
        "facebook-ads",
        "growth",
        "promoted-tweets",
        "startups"
    ],
    "content": "<p dir=\"ltr\"><strong><em><a href=\"http://twitter.com/MatthewBerman\" target=\"_blank\">Matt Berman </a>recently joined 500 Startups as an in-house Distribution Hacker. As part of his role, he launched the 500 Distribution Program where he’ll work 1:1 with select 500 portfolio companies on user acquisition, analytics, funnel optimization, email marketing, split testing, and demographic research.</em></strong></p>\n<p dir=\"ltr\">Have you ever felt completely clueless when starting to think about paid distribution?</p>\n<p dir=\"ltr\"><a href=\"/backup/dog-2013-03-21-13-16-40.jpg\"><img class=\"size-full wp-image-1116726425 aligncenter\" alt=\"dog\" src=\"/backup/dog-2013-03-21-13-16-40.jpg\" width=\"500\" height=\"282\" /></a></p>\n<p dir=\"ltr\">Today, I’m going to teach you the basics of a distribution hacking framework so you can properly test channels – and get more customers.</p>\n<p dir=\"ltr\"><strong>What is Distribution Hacking?</strong></p>\n<p dir=\"ltr\">Distribution hacking is a way to grow your customer base through paid distribution channels like Facebook Ads, Google Adwords or Promoted Tweets. If you’re familiar with “growth hacking” (a very common term now), you already have an idea of what distribution hacking is. Distribution hacking is nearly identical to growth hacking in terms of methodology; the main difference being growth hacking focuses on internal/free mechanisms for growth, while distribution hacking focuses on external/paid channels but uses internal optimization to support external channels.</p>\n<p dir=\"ltr\">The biggest misunderstanding about distribution hacking (and just as much so about growth hacking) is that there’s some secret sauce or faucet that can be turned on/off easily to get the hockey stick growth curve. <strong>THIS IS FALSE.</strong></p>\n<p dir=\"ltr\"><a href=\"http://500.co/wp-content/uploads/2013/03/wenn5366126.jpg\"><img class=\"alignleft  wp-image-1116726433\" alt=\"the office 071009\" src=\"/backup/wenn5366126-1024x682-2013-03-21-13-16-40.jpg\" width=\"491\" height=\"327\" /></a></p>\n<p dir=\"ltr\">Distribution hacking is much like the<a href=\"http://en.wikipedia.org/wiki/Scientific_method\"> scientific method</a>. You hypothesize a distribution channel, set up an experiment and make sure you can isolate and measure your hypothesis (clean data), run the experiment, and confirm results. Once you discover something that works, you optimize by driving down acquisition costs or improving customer LTV (lifetime value).</p>\n<p dir=\"ltr\"><strong>Distribution Hacking as a Framework</strong></p>\n<p dir=\"ltr\">The following is the framework I use when starting distribution hacking with a new product/service:</p>\n\n<ol>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Define target customer/demographic</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Define conversion goal(s) &amp; funnel(s)</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Implement/refine analytics tools to track goals and funnels properly</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Implement/refine split testing tools to run our experiments and iterate quickly on them</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Hypothesize channels to acquire customer/demographic and set up ads on those channels</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Execute the acquisition experiment</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">Optimize the channel or return to step 5</p>\n</li>\n</ol>\n<p dir=\"ltr\">And that’s it! It’s a simple framework that can be implemented by anyone.</p>\n<p dir=\"ltr\"><strong>What Makes a Good Distribution Hacker?</strong></p>\n<p dir=\"ltr\">A distribution hacker is only as good as the rate at which he or she can get through the steps of the framework – and this can only come from experience. Knowing how to quickly set up many variations of ad copy, use each of the ad platforms, implement analytics properly and send data correctly down the funnel is learned mostly through trial and error.</p>\n<p dir=\"ltr\">Good distribution hackers will also have a ton of historical data to guide them to their channel hypothesis. Knowing that Facebook Ads work better for certain types of products and services as opposed to Google AdWords can only come through testing.</p>\n<p dir=\"ltr\"><strong>Start Testing NOW</strong></p>\n<p dir=\"ltr\">Distribution hacking benefits startups at all stages. In the early stages, you can use it to conduct research and better understand your customer, while reaching important early adopters. When you’re trying to scale rapidly, distribution hacking can help compound growth. And at the later stages of a startup, it can provide a consistent and scalable way to bring in new users at a positive ROI.</p>\n<p dir=\"ltr\"><strong>The only way to get get good at distribution hacking is to DO IT.</strong> All it takes is some time and money (doesn’t need to be a huge budget, you can start small) to have a better understanding of how to acquire new users. When the time comes to scale your user acquisition efforts, you have a good foundation to start with.</p>\nIn future posts, I’ll go into detail about specific distribution techniques. Check back soon for more. If you’ve done distribution hacking, please feel free to leave tips below in the comments. And if you have any questions, post them too!",
    "type": "post",
    "path": "/2013/03/21/use-science-to-get-more-customers-the-distribution-hacking-framework/",
    "backgroundImage": "/backup/chemistry-cat-764x540-2013-03-21-13-16-40.jpg"
}