{
    "title": "Using In-App Messages to Get More Social Media Followers",
    "slug": "using-in-app-messages-to-get-more-social-media-followers",
    "date": "2013-09-03T19:05:31.000Z",
    "url": "http://500.co/?p=1116729553",
    "uri": "http://500.co/2013/09/03/using-in-app-messages-to-get-more-social-media-followers/",
    "postId": "1116729553",
    "description": "",
    "images": [
        "https://lh3.googleusercontent.com/Fo1wPJmwTvssrlpjnVHC2Gj3f12gCPCVROXufRG_Bczz0HX2kKFEq-eJEFH3MOhROaMiW5hyojgC06WXPv_aLWZ2J69fdBQNi9fhT685e_mm0Z421qvvjWCu",
        "http://500.co/wp-content/uploads/2013/09/1000.gif"
    ],
    "creator": "",
    "categories": [
        "contests",
        "distribution",
        "dropbox",
        "facebook",
        "in-app",
        "popups",
        "social-media",
        "tips",
        "twitter"
    ],
    "content": "<p style=\"text-align: left;\"><em>This post is part of the ongoing Distribution Tuesday series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em></p>\n<p dir=\"ltr\">Many startups obsess over how many followers or fans they have, and with good reason – once people follow you, you have a direct channel through which you can share company updates, promotions, and more.</p>\n<p dir=\"ltr\">If you’re an early-stage startup, getting early followers can be a challenge, but it can be done. In addition to using the methods <a href=\"http://500.co/2013/08/22/getting-early-social-media-followers-besides-grandma/\">outlined by Sean Percival in this post,</a> you can do a few tricks inside your app to give people more of an incentive to follow you online. If all you’re saying is “like us for news and updates!” you probably won't be very successful. Giving users a real incentive is key to getting them to take action and follow you.</p>\n<p dir=\"ltr\">Here are a few easy ways to do that:</p>\n<p dir=\"ltr\"><strong>Reward people for follows</strong></p>\n<p dir=\"ltr\">One the best examples of this is how Dropbox offer users free storage. If you click on the “get more storage” section of your Dropbox account, you’ll see this: <img alt=\"\" src=\"https://lh3.googleusercontent.com/Fo1wPJmwTvssrlpjnVHC2Gj3f12gCPCVROXufRG_Bczz0HX2kKFEq-eJEFH3MOhROaMiW5hyojgC06WXPv_aLWZ2J69fdBQNi9fhT685e_mm0Z421qvvjWCu\" width=\"683px;\" height=\"282px;\" /></p>\n<p dir=\"ltr\">125 MB may not seem like much, but they’re just shy of 3 MILLION followers on Twitter. Dropbox is the indisputable king of social media growth hacking, even though they rarely post updates. Why? Because people like free stuff.</p>\n<p dir=\"ltr\">Is there something you can give users that costs you nothing or almost nothing? I’ve seen lots of iOS games pull this trick by offering stickers, in-game currency or something trivial (like a hat for your character) in exchange for a Facebook like or Twitter follow. Figure out what you can give away, then offer it to users in exchange for some social media love.</p>\n<p dir=\"ltr\"><strong>Popups</strong></p>\n<p dir=\"ltr\">Occasional popups in your app can be a good way to get more followers – just make sure you’re not annoying about it. Obviously, these should be set to only pop up every once in awhile (say, every 20 logins), and there should be an option like “don’t show me messages in the future” for people who don’t want to see anything.</p>\n<p dir=\"ltr\">Test a few different messages that speak to your specific audience, rather than saying something generic like “follow us online.” Is your app about fitness? Write something like “Get daily motivation in your newsfeed – like us on Facebook!” Do you specialize in cooking or recipes? Try “Being a good cook is sexy – follow us on Twitter and get sexier today.” Be clever or funny – basically anything but boring.</p>\n<p dir=\"ltr\">Also be sure to use the embedded follow/like buttons (see <a href=\"https://twitter.com/about/resources/buttons\">here</a> and <a href=\"https://developers.facebook.com/docs/reference/plugins/like/\">here</a>) that don’t require users to open another page. Most people are always logged into their social media channels, so you should make it easy for them to click “follow” or “like,” then get back to what they were doing. If they have to navigate to another page to follow you, they won’t.</p>\n<p dir=\"ltr\"><strong>Contests with good prizes</strong></p>\n<p dir=\"ltr\">I mention “good” here because I’ve seen SO MANY startups run contests with prizes no one wants. Sorry, but I won’t follow your app’s page to win a company shirt or a 5$ gift card. If you really want to motivate people, you need to give away something big, like an iPad or a $1000 Amazon gift card.</p>\n<p dir=\"ltr\"><a href=\"/backup/1000-2013-09-03-13-14-05.gif\"><img class=\"aligncenter size-full wp-image-1116729561\" alt=\"1000\" src=\"/backup/1000-2013-09-03-13-14-05.gif\" width=\"300\" height=\"225\" /></a></p>\n<p dir=\"ltr\">If you can’t afford something pricey, give away something that appeals to your demographic. I’m a big fan of Stitcher Radio (we stream 500’s podcast there), and they recently held a contest to win a Jambox. They promoted this through in-app audio ads, and all you had to do to enter was click on a message in the app.</p>\n<p dir=\"ltr\">There are tons of other ways to motivate people through your app, so remember to always experiment and try new things! Above all, tell users what you want them to do – don’t think that adding tiny social media icons at the footer of your homepage will actually do anything. People never click on those. Give users a good reason to follow you, then let them do it in one click and get back to what they were doing.</p>",
    "type": "post",
    "path": "/2013/09/03/using-in-app-messages-to-get-more-social-media-followers/",
    "backgroundImage": "/backup/shiba-960x540-2013-09-03-13-14-05.jpg"
}