{
    "title": "Want to help our startups do better on Facebook? Join the 500 Team!",
    "slug": "want-to-help-our-startups-do-better-on-facebook-join-the-500-team",
    "date": "2012-03-15T02:13:05.000Z",
    "url": "http://500.co/?p=1116719471",
    "uri": "http://500.co/2012/03/14/want-to-help-our-startups-do-better-on-facebook-join-the-500-team/",
    "postId": "1116719471",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "distribution",
        "distribution",
        "facebook",
        "facebook-ads",
        "jobs"
    ],
    "content": "Hot on the heels of our <a href=\"http://500.co/2012/02/28/were-hiring-a-senior-conference-producer/\">last hiring post for a Senior Conference Producer</a>, we're looking for a <b>Distribution Manager</b> to help 500 Startups companies with customer acquisition strategy, planning and media buying on Facebook!\n\n<strong>About The Position:</strong>\nAs a Distribution Manager, your primary role will be to work 1:1 w/ our portfolio companies and advise them on Facebook distribution via Facebook ads, platform, etc. You will report to one of the Partners and work closely with them to manage the distribution strategy for the portfolio. \n\n<b>Responsibilities include but are not limited to:</b>\n- Working 1:1 w/ 500 Startups portfolio companies as your client, advising them on how to do effective customer acquisition/distribution on the Facebook platform. We have over 250+ companies, but you will work w/ 5-7 companies at a time.\n- Developing scalable distribution resources for both seed investments and accelerator program, such as events, workshops, meetups, best practices, internal website, etc.\n- Interacting w/ platform companies such as Google, Facebook, Twitter, YouTube, LinkedIn, etc.\n\n<strong>The ideal candidate has:</strong>\n- Minimum 4-year Bachelor’s degree\n- Minimum 5 years work experience and track record of success\n- Minimum 2-4 yrs experience &amp; deep knowledge of Facebook distribution (Facebook marketing, ads, platform) and managing Facebook distribution for clients (especially startups)\n- Working knowledge of other online platforms including SEM (AdWords), SEO, YouTube, etc.\n- Strong project management skills\n- Strong client service skills\n- Strong interest in tech and startups, including experience working w/ startups (either as clients or in an advisory/mentor role)\n- Ability to work in a fast-paced startup environment and easily adapt to change.\n- Highly social and gets energized by connecting with others and creating opportunities for working together.\n- Gets the job done -- which means being a goal-setter and self-starter, operating efficiently and self-correcting, moving quickly but effectively, and meeting deadlines\n- Not afraid of failure and taking risks - able to dive headfirst into a foreign and confusing situation with ease, ask the right questions, independently figure out how to operate effectively, and - if you do fail, dust yourself off and try again.\n- Ability to wear many different hats, including the occasional dish washing (no one on the 500 Startups team is stranger to this!)\n\n<strong>TO APPLY: </strong>\n<a href=\"https://docs.google.com/spreadsheet/viewform?formkey=dGdSMmRMVmE1Um1hTnBOME41dmw1OFE6MQ\" target=\"_blank\">Apply here</a> <span style=\"color: #ff0000;\"><strong>no later than Friday March 23, 2012 11:59PM PDT.</strong></span>\n\nWe'll ask you for:\n1. Your resume (in PDF or Word format)\n2. Your LinkedIn profile\n3. Links to other online profiles: Twitter, AngelList, blog/website, etc.\n4. Minimum 3 references from the 500 Startups network - either portfolio companies or mentors.\n5. Any additional information that will give us a sense of your qualifications for this role. (ex. blog posts, videos, press articles, etc)\n\nIf we like what we see, We'll contact you to set up an interview. Please - no additional inquiries or spamming the 500 Network!",
    "type": "post",
    "path": "/2012/03/14/want-to-help-our-startups-do-better-on-facebook-join-the-500-team/"
}