{
    "title": "We are 500.  (No, really... we’re gonna be 500... as in 500.CO)",
    "slug": "we-are-500",
    "date": "2011-07-19T00:16:49.000Z",
    "url": "http://blog.500startups.com/?p=1116715732",
    "uri": "http://500.co/2011/07/18/we-are-500/",
    "postId": "1116715732",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<div>People often ask me if 500 Startups is a name or a goal. Although we don’t plan to get to 500 investments in our first fund, at 165 companies and counting we are already scaling up faster than any other investor on the planet. You may call us crazy -- hopefully, crazy like a fox -- but you sure as hell can’t call us lazy. And in the long run, we plan to grow far past 500 companies.&nbsp;\n\nBut beyond the simple number of companies, there are many aspects to 500 we find appealing. My fascination with the number 500 originally came about because I’m a fan of Dr. Seuss, author of the book “The 500 Hats of Bartholomew Cubbins”. Previously I used “500 Hats” as my DBA when i was doing consulting, and 500 Hats was also great short-hand for all the hats that entrepreneurs wear while getting a startup off the ground. As I was launching our new fund, I wanted to keep the number 500 to reflect our intention to invest in a large number of companies, but also to represent the large number of founders, mentors, and operators that we now have in our family (yes, we really do think of ourselves as a family of crazy geeks and entrepreneurs).\n\n500 Startups is now almost a year old, and the 500 brand has grown stronger and stronger. We have even started using the hashtag #500STRONG in our tweets to emphasize the grass-roots network effect our founders and mentors have in support of each other. We aren’t just a VC fund, we aren’t just an accelerator / incubator -- we are a village, we are a tribe... <strong>WE ARE 500.</strong>\n\nSo in that spirit, later this fall 500 Startups is going all-in on 500 -- 500.CO, to be exact. Our brand will still be 500 Startups, but our domain name will be changing from 500Startups.com to the short and simple 500.CO. This might seem a little odd at first, but then again we’ve never been scared of being different.\n\n.CO is quickly becoming the hot new geeky TLD in Silicon Valley. We have watched closely as other folks we respect like AngelList.com moved to Angel.CO, and Twitter started using T.CO for their URL shortener, and now we’re ready to jump in ourselves. At 500 Startups, we focus on doing things faster, making cycle time shorter, and simplifying brand.. we know no one cares about your product if it’s not fast, easy-to-use, and memorable. We want to OWN the brand 500, and 500.CO helps us get there.\n\nThe .CO domain launched to the public about a year ago. At the time, I was skeptical whether a new TLD could succeed in becoming a credible alternative to .com -- why would .CO be any different than the many other odd .biz, .info, or .mobi TLDs that came before it? But now just twelve months later, .CO has attracted over a million registrations in more than 200 countries, including big internet brands like Twitter and Amazon – and it’s also made it easier for hundreds of thousands of entrepreneurs around the globe to get a simple, short domain without having to deal with squatters or nosebleed prices. And today, amidst all the chatter about Google+ and their new social tools, even the big G has decided to go .CO, <a href=\"http://googleblog.blogspot.com/2011/07/gco-official-url-shortcut-for-google.html\">announcing its acquisition of G.CO</a> to serve as the official URL shortcut to Google products and services. So with Twitter, Amazon, and now Google, we think we’re in pretty good company with .CO.\n\nWhen it comes to web addresses, the old adage is true – shorter is sweeter.  On a personal note, I've been short my whole life so I'm glad that innovation is finally catching up.\n\n-Dave\n\n</div>",
    "type": "post",
    "path": "/2011/07/18/we-are-500/"
}