{
    "title": "Week 1 at @500startups: Get Better",
    "slug": "week-1-at-500startups-get-better",
    "date": "2012-10-10T03:16:26.000Z",
    "url": "http://500.co/?p=1116723644",
    "uri": "http://500.co/2012/10/09/week-1-at-500startups-get-better/",
    "postId": "1116723644",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/10/andythumb.jpg",
        "http://media.tumblr.com/tumblr_mbn4sozYje1qcskas.jpg",
        "http://media.tumblr.com/tumblr_mbn4xrkS1C1qcskas.jpg",
        "http://media.tumblr.com/tumblr_mbn50spiyA1qcskas.jpg"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<em>This post is a guest post from Andy Sparks. </em><em style=\"line-height: 23px;\">It is the first in a series titled “The Chronicles of 500: Weekly Essays on What I Learned from 500 Startups.” You can follow his journey in 500 on his blog <a href=\"http://andysparks.co/post/33249118120/chronicles-of-500-startups-week-1-get-better\">here</a>. </em>\n\n<a href=\"http://500.co/2012/10/09/week-1-at-500startups-get-better/andythumb/\" rel=\"attachment wp-att-1116723646\"><img class=\"size-full wp-image-1116723646 alignleft\" title=\"andythumb\" src=\"/backup/andythumb-2012-10-09-12-22-16.jpg\" alt=\"\" width=\"180\" height=\"180\" /></a>\n\n<em>Andy is </em><em style=\"line-height: 23px;\"><em>a Facilitator with Startup Weekend and </em></em><em>the Co-founder of <a title=\"http://www.launchgram.com/\" href=\"http://www.launchgram.com/\">Launchgram</a>, <em>a 500 Startups Batch 5 company. Launchgram makes it painless to stay updated on products and projects that haven't yet launched or reach completion . Follow LaunchGram on <a title=\"http://www.facebook.com/LaunchGram\" href=\"http://www.facebook.com/LaunchGram\">Facebook</a> and <a href=\"https://fr.twitter.com/LaunchGram\">Twitter</a>. </em></em>\n\n<strong id=\"internal-source-marker_0.1937264173757285\">You can also join the discussion on Hacker News <a href=\"http://news.ycombinator.com/item?id=4633848\">here</a>.</strong>\n<div>\n<div>\n\nLast week, I <a href=\"http://andysparks.co/post/32674907293/our-path-to-500-startups\">wrote about the path</a> that led my team at <a href=\"http://www.launchgram.com/\">LaunchGram</a> to our new home at <a href=\"http://500.co/accelerator\">500 Startups</a> and this week I’m pumped to kick off a new series of essays that detail what I’ve learned from my experience at 500.\n\n<strong>Quick Introduction</strong>\n\n</div>\n<div>\n\nOur first week diving into 500 Startups was a bit short, as it officially kicked off on Thursday, October 4th. There was no shortage of knowledge to be gained. This week’s takeaways are as follows:\n\n1. 500 Startups facilitates opportunities, but is not a solution to your problems,\n500 Startups is a Family\n2. Immediately after joining 500 Startups, fundraising is your full-time job.\n\n</div>\n<div><strong>3. 500 as a facilitator of opportunity, but not a solution to problems<img src=\"/backup/tumblr_mbn4sozYje1qcskas-2012-10-09-12-22-16.jpg\" alt=\"\" width=\"225\" height=\"319\" align=\"right\" /></strong></div>\n<div>Our first week at 500 Startups reminded me of an <a href=\"http://www.hark.com/clips/prkncmlnyh-put-your-nose-down-and-pay-attention-to-your-work\">episode of Mad Men</a> where Don tells Peggy, “You’re good. Get better. Stop asking for things.”</div>\n<div></div>\n<div>\n\n<a href=\"https://twitter.com/davemcclure\">Dave</a>, <a href=\"https://twitter.com/paulsingh\">Paul</a>, <a href=\"https://twitter.com/christine_tsai\">Christine</a>, and the entire 500 team kept reminding us that we were good enough to make it into 500, but that ~80% of us would be “fucking dead” within one year. If we want to survive, we need to get better pronto, and that’s on each company individually.\n\n</div>\n<div>\n\nOur survival, and ultimately our success or failure, will depend on each team’s ability to learn from the functional expertise of our batchmates, mentors, and previous 500 founders. The difference between Don and Dave is that not only is asking for things okay, it is encouraged. “Your problems are not unique,” is a phrase that’s been echoing around in my head all week. Dave would support Don’s overarching point: stop asking for permission from others, focus on your work, and just get shit done.\n\n</div>\n<div>\n\nWhile getting into 500 feels like a pretty big accomplishment, the team there made it clear that a long road lies ahead and while they can help us, they are by no means a “silver bullet.”\n\n</div>\n<div><strong>500 Startups <a href=\"http://www.youtube.com/watch?v=eBpYgpF1bqQ\">is a Family<img src=\"/backup/tumblr_mbn4xrkS1C1qcskas-2012-10-09-12-22-16.jpg\" alt=\"\" align=\"right\" /></a></strong></div>\n<div>The first thing that really struck me was how disarming the atmosphere of 500 Startups was. Prior to this, going to 500’s office was a relatively stressful experience given that we were pitching to be part of the program. It’s amazing how fast the energy in the 12th floor of 444 Castro changes when Dave McClure is bouncing up and down on a silver exercise ball with a shit-eating grin. The occasional mentor filtering in to give advice with a bottle of <a href=\"http://en.wikipedia.org/wiki/John_Dewar_%26_Sons\">DeWars</a> helps, too.</div>\n<div>Something families are great about is staying in touch, so naturally, if 500 is to be one grand family, internal communication is going to be pretty important. Lucky for us, Paul Singh has created a completely internal tool called “Dashboard,” that makes it ridiculously easy to interact with their network of 190+ mentors and countless past founders. Immediately after signing paper, multiple invitations to Google Groups and 500 founders-only resources went out. Internal communication tools are great, but only if people use them, and somehow the 500 team has made this happen.</div>\n<div>\n\nIn short, 500 Startups has successfully made it easy to feel like we’re part of an epic family which cares about each of its members from very early on, and that’s powerful.\n\n</div>\n<div><strong>Immediately after joining 500 Startups, fundraising is your full-time job</strong></div>\n<div><img src=\"/backup/tumblr_mbn50spiyA1qcskas-2012-10-09-12-22-16.jpg\" alt=\"\" width=\"225\" height=\"169\" align=\"left\" />It’s easy to get excited about a fresh infusion of $50k because at first that number sounds huge, but when you budget it out and you only have a few months suddenly you’re losing sleep. Losing sleep is something that’s mentioned a lot in the valley and in startup blogs all across the web, but when you actually can’t sleep because you’re worried you won’t be able to pay your friends you convinced to move across the country to work on a company, shit gets real fast.</div>\n<div></div>\n<div>\n\nGetting into 500 Startups certainly doesn’t make fundraising harder. On day two, Paul Singh and <a href=\"https://twitter.com/GeorgeKellerman\">George Kellerman</a> dropped some serious knowledge about fundraising. Here are a few gems I picked up on:\n\n</div>\n<div>1. You have 2-3 minutes to pitch your traction, problem, and solution. If they can’t understand what you do in that 2-3 minutes, they won’t understand you in 8, 10, 15 or 30.\n2. After your 2-3 minute pitch, shut the hell up; the next person to talk wins.\nEntrepreneurs think in terms of how much money they’re getting, but sometimes investors think in terms of what % of the company they’re buying (this varies from angel to angel / with VCs, but is good to be conscious of)\n3. Finally, you can’t go very long in Silicon Valley without hearing the phrase “fundraising is a full-time job.” It’s tough to give up some control over the product, but by this point I know I’ve built a team that can more than handle it on their own. Know that your people deserve big paychecks, so go get out there are bring them home.</div>\n<div><strong>\nConclusion</strong></div>\n<div>After our first week at 500 Startups, I’ve realized it’s on me to make things happen for LaunchGram. I’ve known this all along, but having it shoved in your face again never hurts. The 500 family can and will help; resources are on the table. The opportunities are right in front of me. The question is, will I take advantage of them? Will I leverage the brand? Will my company succeed? Will <a href=\"http://www.launchgram.com/\">LaunchGram</a> get better? You bet your ass it will, because we’re going to leverage every single opportunity and every single second to build the best damned company we can.</div>\n<div><strong>\nJoin the discussion on Hacker News <a href=\"http://news.ycombinator.com/item?id=4633848\">here</a>.</strong></div>\n</div>",
    "type": "post",
    "path": "/2012/10/09/week-1-at-500startups-get-better/"
}