{
    "title": "We're Looking for Design Unicorns! Show Us How Much You **Sparkle** for a Chance at 25K",
    "slug": "were-looking-for-design-unicorns-show-us-how-much-you-sparkle-for-a-chance-at-25k",
    "date": "2013-10-08T20:35:21.000Z",
    "url": "http://500.co/?p=1116729913",
    "uri": "http://500.co/2013/10/08/were-looking-for-design-unicorns-show-us-how-much-you-sparkle-for-a-chance-at-25k/",
    "postId": "1116729913",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "warmgun",
        "design",
        "design",
        "events",
        "funding",
        "investment",
        "startups",
        "warm-gun"
    ],
    "content": "<p dir=\"ltr\">Next month, we're hosting on of our favorite 500 conferences of the year – <a href=\"http://warmgun.com\" target=\"_blank\">Warm Gun</a>, our one-day conference about design. And this isn't the kind of design conference where we sit around and debate which fonts make us feel the most whimsical. This is about measurable design that will make your users happier and get you more traction.</p>\n<p dir=\"ltr\">As part of Warm Gun, we're looking for an awesome startup that's using good design to blow away the competition. Do you competitors look like Geocities? Is your UI slicker than baby oil? Then we WANT YOU. The startup we select will get 25k in funding, become part of 500 Startups' network of 1000+ founders, and have time on stage at Warm Gun to demo their product. BOOM.</p>\n<p dir=\"ltr\">Think you have what it takes? Here what we're looking for:</p>\n\n<h2 dir=\"ltr\">Design that's more than flat icons</h2>\n<p dir=\"ltr\">Good design isn't fancy fonts or nice colors – it's the product itself. Does your product work in an intuitive way? Do your customers rave about how easy it was to figure out how to do things? Are you constantly testing and optimizing how your product actually works? We hope so.</p>\n\n<h2 dir=\"ltr\">You know your customers</h2>\n<p dir=\"ltr\">You aren't building something for fun. You're building it because you know a specific set of customers has a problem you need to solve. And you talk to them again and again to figure out how to make things better. You're even on a first name basis with a few of your biggest fans.</p>\n\n<h2 dir=\"ltr\">Measurable traction</h2>\n<p dir=\"ltr\">Speaking of customers, you have 'em. You might not have as many as Facebook, but your customers spend a lot of time in your product. You’re getting more traction EVERY DAY, and can explain in detail where you're growing and why.</p>\n<p dir=\"ltr\">If you have what it takes, <a href=\"https://angel.co/unicorn-startup-design-award-2013/apply\">APPLY NOW on AngelList</a>. Applications close October 18th at midnight, PST. <strong>You have LESS THAN 2 weeks, so <a href=\"https://angel.co/unicorn-startup-design-award-2013/apply\">get on it!</a></strong></p>",
    "type": "post",
    "path": "/2013/10/08/were-looking-for-design-unicorns-show-us-how-much-you-sparkle-for-a-chance-at-25k/",
    "backgroundImage": "/backup/cpencil-870x540-2013-10-08-13-15-35.jpg"
}