{
    "title": "We're Hiring An Events Coordinator",
    "slug": "were-hiring-an-events-coordinator",
    "date": "2011-01-12T23:47:47.000Z",
    "url": "http://blog.500startups.com/?p=1116714739",
    "uri": "http://500.co/2011/01/12/were-hiring-an-events-coordinator/",
    "postId": "1116714739",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "announcements",
        "events",
        "events",
        "events-coordinator",
        "hiring"
    ],
    "content": "Know anyone who would be PERFECT in the Events group at 500 Startups? If so, pass along this info! Our events director, Christen O'Brien, is looking to hire an events ninja to start immediately. (Note: this is all part of our MASTER plan to have 500 events! MUAHAHAHAHA...)\n\n<strong><span style=\"text-decoration: underline;\">About the Position</span></strong>\n\n<strong> </strong>The Event Coordinator will report to the Director of Events and will be responsible for back-end and on-site coordination of both internal and external events and conferences. The ideal candidate for the position will quickly excel within the role and be well-poised to solely manage several events annually, which is a high-profile position among the tech industry's most influential people.\n\nThis is a high-growth role at a fast-paced company and thus requires a candidate who is extremely motivated, dedicated, and passionate about their career.\n\n<strong><span style=\"text-decoration: underline;\">Overall Responsibilities</span></strong>\n\n1.       <strong>Event Production:</strong> Production assistance with internal (incubator) and external (public) conferences and events such as:\n<ul>\n\t<li>Warm Gun (SF Bay Area &amp; NYC)</li>\n\t<li>SMASH summit (SF Bay Area &amp; NYC)</li>\n\t<li>Inbox Love (Mountain View)</li>\n\t<li>The Lean Startup SXSW (Austin, during SXSW)</li>\n\t<li>Geeks on a Plane (tours to South America, Asia, and India)</li>\n\t<li>500 Startups Demo Days (Mountain View, quarterly)</li>\n</ul>\n2.       <strong>External Business Development:</strong> Partnership acquisition with tech’s leading companies, such as Google, Facebook, Microsoft, Yahoo, Twitter, Salesforce, and LinkedIn. You will work alongside the Events Director and will quickly learn how to build partnerships effectively within the 500 Startups landscape.\n\n3.       <strong>Internal Business Development:</strong> Building relationships with our portfolio of 60+ startups and connecting them with event and partner opportunities at industry conferences, internal 500 Startups events, external 500 Startups conferences, as well as introductions to other companies and executives.\n\n<strong><span style=\"text-decoration: underline;\"> Specific Responsibilities</span></strong>\n\n<strong> </strong>\n\n<strong> </strong><strong>Pre-Event:</strong>\n<ul>\n\t<li><strong>Research:</strong> Work with Events Director to research and compile pre-event data such as competitive events, marketing partner targets, sponsor targets, topics, and speakers.</li>\n\t<li><strong>Project Management:</strong> Work with Events Director to engage relevant partners (event advisers), set-up meetings, and drive short and long-term goals.</li>\n\t<li><strong>Content Production:</strong> Be part of the process…attend team meetings and participate in discussions with relevant parties about topics and speakers.</li>\n\t<li><strong>Business Development:</strong> Engage the tech community…work with Events Director to secure event partnerships which involves research, conference calls, and in-person meetings.</li>\n\t<li><strong>Marketing Strategy:</strong> Innovate our marketing channels…work with Events Director to brainstorm and solidify marketing strategy for events and conferences. This will involve a large amount of social media.</li>\n\t<li><strong>Website Production</strong>: Alongside Events Director, work with designer to set-up event website, draft content, and incorporate social media platforms.</li>\n\t<li><strong>Back-End Management:</strong> Manage back-end technologies and channels - Set-up and manage eventbrite page, plancast page, facebook page, twitter stream, and other event/social media platforms.</li>\n\t<li><strong>Vendor Management:</strong> Coordinate with vendors as needed, such as printers, caterers, etc.</li>\n\t<li><strong>Speaker Management: </strong>Collect relevant information from speakers such as photo, logo, bio, etc.</li>\n\t<li><strong>Sponsor Management:</strong> Send contracts and invoices and collect payments from sponsors, as well as logos and photos.</li>\n\t<li><strong>Volunteer Recruitment:</strong> Recruit event volunteers from volunteer database and local universities.</li>\n\t<li><strong>Material Production:</strong> Alongside Events Director, make and assemble name badges for attendees, relevant signs, time cards, event production binders with all necessary information, etc.</li>\n</ul>\n<strong>On-Site:</strong>\n\n<strong> </strong>\n<ul>\n\t<li><strong>Event Management:</strong> Alongside Events Director, serve as “event producer” at most events during main stage and/or afternoon tracks. This is a “stage manager” role that involves constant timing, speaker management, management of audio visual technicians, and more.</li>\n\t<li><strong>Speaker Management:</strong> Serve as contact for arriving speakers, provide them with instructions and information regarding their roles, assist them with file uploads, and work with audio visual technicians to test presentations with speakers.</li>\n\t<li><strong>Volunteer Management:</strong> Alongside Registration Manager, oversee volunteers during event.</li>\n</ul>\n<strong>\nPost-Event:</strong>\n<ul>\n\t<li><strong>Vendor Follow-up:</strong> Ensure that all vendor payments are complete and all accounts are closed.</li>\n\t<li><strong>Sponsor Follow-up:</strong> Manage calls with sponsors to thank them and gather feedback.</li>\n\t<li><strong>Speaker Follow-up:</strong> Draft and send hand-written thank you cards to all speakers.</li>\n\t<li><strong>Attendee Follow-up:</strong> Draft and send post-conference thank you to all attendees, and manage any questions and comments.</li>\n</ul>\n<strong>Other:</strong>\n<ul>\n\t<li>Serve as contact point to funnel opportunities from the events division to relevant members of the 500 Startups team, such as introductions and potential partnerships</li>\n\t<li>Maintain competitive events calendar and ensure that Events page on 500 Startups website is up to date.</li>\n\t<li>Maintain appropriate levels of event supplies such as name badges, printer ink, badge boxes, sign holders, paper, etc.</li>\n\t<li>Constantly innovate and think up new ideas, strategies, partnerships, and locations where we should focus - the ideal candidate will excel in this role, always be searching for new methods and technologies, and eventually will run several 500 Startups events independently.</li>\n</ul>\n<strong>Requirements:</strong>\n\n<strong> </strong>\n<ul>\n\t<li><span style=\"text-decoration: underline;\">Education:</span> College degree from a 4-year university/college</li>\n\t<li><span style=\"text-decoration: underline;\">Location:</span> Candidate must be based in the San Francisco Bay Area (not a telecommute position)</li>\n\t<li><span style=\"text-decoration: underline;\">Traits:</span> Razor sharp, extremely motivated and career-driven, diplomatic, social, energetic, persuasive, humble, patient, and hard-working. Extra points for wit and humor!</li>\n\t<li><span style=\"text-decoration: underline;\">Personality:</span> You need to be the kind of person who’s bold enough to call someone you’ve never met, engaging enough to get to know them and build a relationship, resourceful enough to find the opportunities and seize them, hard-working enough to roll up your sleeves and get the job done, and thorough enough to close loops and deals independently.</li>\n\t<li><span style=\"text-decoration: underline;\">Experience:</span> You don’t need events experience, though it is a plus.</li>\n</ul>\n<strong>Annual Compensation:</strong>\nCommensurate with experience. Also includes potential for commission + a full benefits package.\n\n<strong>To Apply:</strong>\nCandidates should send their resume and salary requirements to <strong>christen at 500 startups dot com.</strong>",
    "type": "post",
    "path": "/2011/01/12/were-hiring-an-events-coordinator/"
}