{
    "title": "What Makes an Intern a Good Hire? ",
    "slug": "what-makes-an-intern-a-good-hire",
    "date": "2012-08-21T23:01:31.000Z",
    "url": "http://500.co/?p=1116722395",
    "uri": "http://500.co/2012/08/21/what-makes-an-intern-a-good-hire/",
    "postId": "1116722395",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/08/NatePic2.jpg",
        "http://500.co/wp-content/uploads/2012/08/internmatch.jpg"
    ],
    "creator": "",
    "categories": [
        "guest-posts",
        "startups",
        "tips"
    ],
    "content": "[caption id=\"attachment_1116722399\" align=\"aligncenter\" width=\"203\"]<a href=\"http://500.co/2012/08/21/what-makes-an-intern-a-good-hire/natepic2/\" rel=\"attachment wp-att-1116722399\"><img class=\" wp-image-1116722399      \" title=\"NatePic2\" src=\"/backup/NatePic2-2012-08-21-12-18-01.jpg\" alt=\"\" width=\"203\" height=\"270\" /></a> Nathan Parcells, Co-founder of Internmatch.com[/caption]\n\n<strong></strong>\n<em>This is a guest post by Nathan Parcells. Nathan Parcells is co-founder of <a href=\"http://InternMatch.com\" target=\"_blank\">InternMatch.com</a>, a leading website to help students find amazing internships and help companies find amazing</em> <em>interns.  Nathan has spoken at universities across the country on intern hiring issues and InternMatch was part of 500 Startups' first batch.</em>\n<p align=\"center\"><strong>Why Fantastic Interns add $50K+ of Value to Your Startup, and Mediocre Interns Will Cost You</strong></p>\n<p align=\"center\"><strong> </strong></p>\nA few years ago Aaron Patzer, co-founder of Mint.com, gave one of the best startup presentations I have seen.  He dissected the process of <a href=\"http://techcrunch.com/2009/10/07/everything-you-wanted-to-know-about-startup-building-but-were-afraid-to-ask/\" target=\"_blank\">Starting a Company</a>, and in doing so sparked countless conversations about the value of business co-founders, all of which helped lead to the rise of the hustler over the MBA.\n\n&nbsp;\n\nAt InternMatch we hear a similar debate about the value of interns at early stage companies.  Some startup founders swear by interns, looking at them as a strategic pipeline to <a href=\"http://venturebeat.com/2012/07/21/converting-interns-to-hires/\" target=\"_blank\">convert new hires</a> and grow, while others write them off as too much of a distraction. A big reason for this spectrum of experiences is the delta between good and fantastic interns at early stage companies.\n\n&nbsp;\n\n<strong>At a startup you simply cannot waste time and resources with employees who aren’t a good culture fit, are working on non-essential projects, or who need excessive attention.  You need fantastic interns, rather than simply good interns.</strong>\n<p style=\"text-align: center;\"> <a href=\"http://500.co/2012/08/21/what-makes-an-intern-a-good-hire/internmatch-4/\" rel=\"attachment wp-att-1116722409\"><img class=\"aligncenter  wp-image-1116722409\" title=\"internmatch\" src=\"/backup/internmatch-2012-08-21-12-18-01.jpg\" alt=\"\" width=\"614\" height=\"362\" /></a></p>\n&nbsp;\n\n&nbsp;\n\nSo what makes an intern fantastic?\n\n<strong> </strong>\n\n<strong>Cultural Fit: </strong>\n\n<strong> </strong>\n\nWhen an intern is the right fit for your company they bring energy, excitement, and new ideas into the office every day.  They complete their tasks with enthusiasm and precision and find new work to do even when you are too busy to assign something.\n\n&nbsp;\n\nIf an intern is a bad cultural fit, they’ll get bored and treat work like a class, doing just enough to pass.\n\n&nbsp;\n\nCultural fit is hard to define and can mean a number of different things for different companies.  For a language learning company like <a href=\"http://www.internmatch.com/company/mindsnacks/\" target=\"_blank\">MindSnacks</a> it might mean having taught yourself at least one language outside of class.  At a tech-centric company it might mean reading Hacker News on a weekly basis.  Regardless, of how you define culture, an intern won’t be fantastic if they aren’t thrilled about your startup's mission and personality.\n\n&nbsp;\n\n<strong>Find a Do-er:</strong>\n\n<strong> </strong>\n\nAnother attribute that is critical at small companies but not necessarily at large organizations is finding students who skew towards action over perfection.\n\n&nbsp;\n\nAt an early stage company you need someone who is scrappy, likes finding cost-efficient solutions, and isn’t afraid to turn in a mostly finished product.  You don’t want a student who comes up with great ideas, but needs a graphic designer, developer, and three grand to execute on them.\n\n&nbsp;\n\nOne way to find such “studentpreneurs” is to  screen for students who have completed quality extra-curriculars at college over those who have solely gotten straight A’s.  Students who are club presidents, have interesting side projects, and achieve outside of class, tend to be far more intrinsically motivated and comfortable creating their own goals rather than just following directions.\n\n&nbsp;\n\n<strong>Understands the working world:</strong>\n\n<strong> </strong>\n\nFantastic students intuitively get what it is like to work in a professional setting.  This does not mean that they have 2+ years of experience (although that can help), but it does mean they can send quality emails, communicate with co-workers, and ask smart questions that help them solve problems more efficiently.  Some of this can be taught, but if you have to teach all these skills you are probably not leveraging your time effectively as a founder.\n\n&nbsp;\n\nWhile you can usually detect these soft skills over the phone, at <a href=\"http://www.internmatch.com\" target=\"_blank\">InternMatch</a> we go a step further.  We mention in our internship descriptions that we love it when a student follows-up with us by email after they apply.  Those who follow these instructions and do so in a professional manner, pass another important bar in our mind.\n\n&nbsp;\n\n<strong>Don't Settle:</strong>\n\n&nbsp;\n\nMany of the most successful startup companies grew their early teams by tapping into the inexpensive and often brilliant talent that is available on college campuses. However, to avoid a hiring pitfall ALWAYS screen for interns who fit your culture, know how to deliver, and can act professional.  This is more important than pure skill.\n\n&nbsp;\n\nFor more hiring tactics check out our <a href=\"http://www.internmatch.com/guides/9-steps-with-tactics-to-hiring-rock-star-interns\" target=\"_blank\">how to hire a rock star intern presentation</a> or feel free to email me at <a href=\"mailto:nathan@internmatch.com\" target=\"_blank\">nathan@internmatch.com</a>.\n<div>\n<div data-tooltip=\"Show trimmed content\"></div>\n</div>",
    "type": "post",
    "path": "/2012/08/21/what-makes-an-intern-a-good-hire/"
}