{
    "title": "What Does that “Business Guy” at Your Startup Do, Anyway?",
    "slug": "what-does-that-business-guy-at-your-startup-do-anyway",
    "date": "2010-11-09T05:01:08.000Z",
    "url": "http://blog.500startups.com/?p=1116714475",
    "uri": "http://500.co/2010/11/08/what-does-that-business-guy-at-your-startup-do-anyway/",
    "postId": "1116714475",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2010/11/plasticman1-150x150.jpg",
        "http://500.co/wp-content/uploads/2010/11/chudson1-150x150.jpg"
    ],
    "creator": "",
    "categories": [
        "bd",
        "business",
        "business-development",
        "charles-hudson",
        "ex-googler",
        "guest-posts",
        "marketing",
        "mentors",
        "mentors",
        "sales",
        "tips"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2010/11/plasticman1.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714480\" title=\"plasticman\" src=\"/backup/plasticman1-150x150-2010-11-08-10-23-01.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2010/11/chudson1.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714486\" title=\"chudson\" src=\"/backup/chudson1-150x150-2010-11-08-10-23-01.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet Plastic Man aka 500 SuperMentor <a href=\"http://www.charleshudson.net/\" target=\"_blank\">Charles Hudson</a> (<a href=\"http://twitter.com/chudson\" target=\"_blank\">@chudson</a>). Charles is the Co-Founder of Bionic Panda Games, a new mobile games startup. Prior to Bionic Panda Games, Charles was the VP of Business Development at Serious Business (acquired by Zynga in February 2010) and the founder of Third Power LLC (acquired by WebMediaBrands in December 2009), the company behind some of the most successful conferences in the virtual goods and free-to-play games markets. Charles also held BD and product roles at IronPort Systems (now part of Cisco), Gaia Online, and Google. </em>\n\nCongratulations! You’re the business guy at a hot new startup. It’s Day 1. What are you supposed to do to validate the investors’ and management team’s decision to bring you on board?\n\nBeing the business guy at a startup is not easy. While the engineering team is busy checking in code and the product team is busy revising the product plan, you’re out meeting with people. Everyone else, from the finance person to the engineering team has measurable and observable deliverables in terms of code checkins, PRDs, and other key tasks that show up on a weekly progress report,  while what you’re doing isn’t easy to measure. You’re not closing deals because you don’t have a product. You’re not generating revenue because the product is still in development. You’re out trying to sell a dream (literally) – some day the startup will live up to all of the promises you’re making to potential partners. So what should you do every day?\n\nI believe there are 4 core activities that every startup business guy should do if you join in the early days:\n\n<strong>1. Be an early advocate for a business model and revenue model discovery.</strong> Everyone in your organization is going to be focused on building a killer product that users will love. But someone has to worry about the business model and distribution strategy. The good news for you as the business guy at your startup is that you can focus on that issue as a core part of your day. Even if the business model isn’t clear, it’s your job to take advantage of your seat at the table to advocate for potential business models, run early experiments with customers who believe in what you’re doing, and constantly make the case that what you’re doing has to turn into a business if the company is to ultimately be successful. If you don’t agitate for revenue and customer development and discovery, it’s easy to have that work deferred into the future. It’s never too early to start thinking through those issues.\n\nThe other natural byproduct of working as a revenue and business model advocate is that it forces you to get more involved in understanding the product roadmap and prioritization of pending features. It's critical that you find a way to be a part of those conversations early on. Most great Internet startups are driven by product and engineering people who have strong views about where the product should go and which features should be prioritized to achieve that end. If you wait until the product is nearly complete or about to ship, it's too late; the major opportunities to influence the direction of the product or at least understand why and how key features are being prioritized has been lost. The most frustrating experience many early businesspeople I've talked to encounter at startups is a feeling that the product people \"just don't get it\" when they come in with a big revenue opportunity, partnership, or deal. You're right - they probably don't get it. They're focused on building the product that they believe customers want. If you haven't invested the hours it takes to get to understand the product and engineering teams longer term plans, why they want to do what they want to do and when, and to build relationships with them, you'll never be a part of the process. Spend the time to connect with those teams and work with them - yu can rarely get anything meaningful done if it doesn't fit into the company's longer term product plans and vision.\n\n<strong>2. Be the one man or one woman combination of sales, business development, and marketing.</strong> In the early days of any startup, you’re probably going to be the only person responsible for the “business stuff.” You’re not going to have business counterparts in other key business functions such as marketing and sales. If you’re nominally the VP of Business Development, that’s not actually your job. Your job is to drive all of the business functions to the best of your abilities. Someday you might have a counterpart in sales, marketing, or other key business functions. But until you do, it’s your responsibility to drive those functions forward to the best of your ability and help the company better execute across all business functions, even though you’re only one person.\n\nFor those of you coming from big companies, this can be a jarring transformation. I know it was from me. For my first full-time business development role, I went from Google (15,000 employees when I left) to Gaia (about 65 employees at the time I joined). The nice thing about larger companies is that you can afford to staff all of those other business functions - if you're in business development, it's not your job to run marketing. And let's not overlook one critical difference between being at a big company such as Google, Yahoo, or Microsoft. When you call, people will pick up the phone because of the company you represent. Getting meetings is relatively easy. Getting small and large partners to line up behind your new product or vision can be easy when you have the power of a big brand behind you. That is rarely the case at a startup - you have to make it happen and it will take a lot of hustle to do so.\n\n<strong>3. Start building relationships that will pay off when your company starts to scale.</strong> Similar to the points raised in the first point, there are key relationships you want to start building early, even before it’s entirely clear how the product will turn out. In every early stage business, the management team knows the initial market you’re planning to target. And in every market, there are key other ecosystem participants you want to get to know for distribution relationships, corporate development opportunities, or for other reasons that will help both of your businesses. It’s never too early to start those conversations. The best part of starting those conversations early is that you get an opportunity to better understand how other people in your ecosystem are thinking about the problem you’re trying to solve. Do they have internal efforts already underway? Are they desperate to partner with someone else who has traction? Do they have strongly held beliefs about how the space you’re in is going to play out? These are all things that are good to know as you plot your strategy. And as the person who is focused on life outside of the four walls of your company, this is valuable intel you can bring back to everyone else in the company.\n\n<strong>4. Keep your ears open about the chatter in your industry so you don’t get blindsided</strong>. Don’t forget that the vast majority of your colleagues are focused on the internal issues that could keep your startup from succeeding.  They’re working on product planning and customer development issues that are unique to the product your company is building. But that’s not 100% of what you need to know to succeed. Sometimes it’s really important to know what’s happening in your industry. Is one of your competitors raising a major round? If so, what does that mean for your company? Will that major round allow them to out-spend your on sales and marketing or hire more engineers? Is there a big deal out for bid that doesn’t involve you? If so, what would it mean for the space if one of your competitors closes that deal? Is there a big public company actively looking to acquire someone in your space? These questions and 500 others are important to know if you’re running a startup. Those things can impact your startup’s perceived chances of success. As the business person at a startup, it’s your job to stay on top of industry chatter to make sure your startup isn’t left out in the cold if changes are afoot in your industry.\n\nWhen I was at Serious Business, making sure everyone on the management team had a good sense about the increasing rate of deal activity in the social games space in late 2009 and early 2010 was important information for us to have as we plotted our own strategy. Having some sense for who was looking to raise money, who was looking to make acquisitions, and the teams who were actively in play and on what terms was key to understand when assessing the best path for the company. The same was certainly true during my time at Gaia Online as well.\n\nLast but not least, you need to get comfortable with the fact that many of the activities you’re doing won’t show up in a weekly progress report. Building relationships, pushing for revenue models, and staying up to speed on what’s happening in your industry might not pay immediate dividends in the same way that code checkins and PRD revisions do. But nothing hurts startup morale more than being blindsided by a major industry development that you hear about on TechCrunch without being part of the conversation.\n\nI encourage all of my fellow businesspeople in startups to soldier on and continue to work hard even if your contributions aren’t always obvious at the moment.",
    "type": "post",
    "path": "/2010/11/08/what-does-that-business-guy-at-your-startup-do-anyway/"
}