{
    "title": "What You Need To Know To Go International (US Version)",
    "slug": "what-you-need-to-know-to-go-international-us-version",
    "date": "2011-01-20T13:03:44.000Z",
    "url": "http://blog.500startups.com/?p=1116714792",
    "uri": "http://500.co/2011/01/20/what-you-need-to-know-to-go-international-us-version/",
    "postId": "1116714792",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/01/coletteballou-150x150.jpg",
        "http://500.co/wp-content/uploads/2011/01/flags_globe-150x150.png"
    ],
    "creator": "",
    "categories": [
        "colette-ballou",
        "european-girl",
        "guest-posts",
        "international",
        "mentors",
        "mentors",
        "techhub",
        "tips",
        "visa",
        "visas"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/01/coletteballou.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116714793\" title=\"coletteballou\" src=\"/backup/coletteballou-150x150-2011-01-20-11-07-03.jpg\" alt=\"Colette Ballou\" width=\"150\" height=\"150\" /></a> <a href=\"http://500.co/wp-content/uploads/2011/01/flags_globe.png\"><img title=\"flags_globe\" src=\"/backup/flags_globe-150x150-2011-01-20-11-07-03.png\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>Meet European Girl, aka 500 Mentor <strong>Colette Ballou</strong>. Colette is the founder of <a href=\"http://www.balloupr.com/\" target=\"_blank\">Ballou PR</a>, the smartest and sassiest public relations agency on either side of the Atlantic, focusing on high-growth companies. She oversees activities for their Paris, London, New York and San Francisco offices and is a frequent speaker/moderator and a mentor/judge for startup organizations and events such as Seedcamp, Microsoft BizSpark, IBM SmartCamp, SXSW Start-Up Accelerator, the Telegraph Tech Start-Up 100 and TechCrunch. One of European Girl’s superpowers -- the ability to smoke a pack of cigarettes in a single puff.  Follow her on <a href=\"http://twitter.com/coletteballou\" target=\"_blank\">Twitter</a>.</em>\n\nHow exciting –<strong> you’re expanding internationally</strong>! Assuming you’ve done the research about potential demand, competition, etc., and you’ve narrowed down the list of countries to set up shop, here are some nitty-gritty things you need to get right from the get-go, along with solutions.  But first things first: <strong>Going international is a strategy, not an afterthought.</strong> The management team needs to be on board and aligned.  Get that right first. Then add these to your management team agenda:\n\n<strong>Location:</strong> Don’t just go with what everyone else is doing – select a location that makes sense for you.  Etsy selected Berlin, not London, for its European HQ.  Why?  No doubt the art scene and the (relatively) low cost of living played a part.  But also investigate local labor laws (see below).  Keep in mind that you want direct flights home.  It will make a difference.\n\n<strong>Language:</strong> That clever Canadian intern may have won a top grammar prize back at school in Montreal, but that doesn’t mean s/he can speak French the French way.  A sure fire way to alienate early adopters in new countries is to translate poorly.  Using French Canadians or South Americans for French or Spanish is a quick way to show a market that you are not local, nor serious about them. Solution: Use native translators, or stay in English until you can do the job right.\n\n<strong>Currency:</strong> Duh.  But if you are selling online, you need to get this right.  Customers are put off if you stray too far from actual foreign exchange rates.  Solution:  See how competitors or similar business have solved it.\n\n<strong>Accounting: </strong>All accounting rules are NOT the same (I learned that the hard way).  Solution:  Get a local accountant who speaks your language, and better still, one who understands US accounting rules.  Don’t necessarily go for a big recognized name as you will pay for it handsomely.  Start with a local person who specializes in start-ups and in your industry; you can always trade up.\n\n<strong>Tax/invoicing:</strong> Don’t underestimate how complicated this is – it is different in every country.  And don’t assume that the EU has one flat tax, either.  The VAT can really be torturous.  Solution:  Get a good local accountant (see above).\n\n<strong>Banking: </strong>Some banks have VERY strict rules about opening accounts due to fears of money laundering.  And some require a phone or electric bill, and you can’t get a phone because you don’t have a bank account … you get the picture.  Quickie solution that works:  Put your name on a local friend’s gas/electric/phone bill.  Note to self: Get local friend.\n\n<strong>Legal:</strong> I cannot stress this enough: It really blows to find out the hard way that you are doing something illegal.  Solution: Talk to a lawyer who specializes setting up small businesses in your new market.  You can likely do this from the US.\n\n<strong>Work visa:</strong> This will take up to 4x longer than you were expecting and in some countries, you cannot be in the country while you are applying.  They can tell – passport stamps say it all (of course, you can get around this in the Schengen states).  And the laws are always changing.  Solution:  Get a good immigration lawyer.  You can find this either locally or in the US.\n\n<strong>Labor laws:</strong> You’ve heard the horror stories about French labor laws.  I’ve lived them, and they would have destroyed a smaller company.  If just one of you can learn from my mistakes, I’ll be happy!   So, know the labor laws of your market, including what it takes to transfer people from the US.  Solution:  Find a lawyer in the US who can advise you on local labor laws – this may help you decide where to set up shop.\n\n<strong>Employee number one: </strong> Do not send a mid-level person from the US to set up shop.  This is the fastest way to fail – it shows the market that you are not really local or really serious.  Solution:  Either send a senior-level person (co-founder is perfect) or hire a top-level local person (I know, I know, scary due to labor laws).\n\n<strong>Space:</strong> No need to spring for expensive space – use co-working spaces! <a href=\"http://www.techhub.com/\" target=\"_blank\"> TechHub</a> in London is a great example.\n\n<strong>A note on the buddy system</strong>:  One of the best ways to enter a market is to follow a company you are close with, one who has already started the process and from whom you can learn.  They can give you advice on service providers, phone plans. And maybe even a desk or two!  Or if you are a part of <a href=\"http://www.microsoft.com/bizspark/\" target=\"_blank\">Microsoft BizSpark</a>, or <a href=\"http://www-05.ibm.com/ie/smarterplanet/smartcamp/index.html\" target=\"_blank\">IBM SmartCamp</a>, or <a href=\"http://guidewiregroup.com/services/innovate/\" target=\"_blank\">GuideWire Group’s Innovate!</a> Program.  Ask your program lead or companies in the program with you.\n\nBiggest tip?  <strong>Suspend judgment</strong>.  Just because things work one way at home, that doesn’t mean it’s the right way or the only way to do things.  You will waste far too much time railing against the system rather than adapting to it.  Assume that to get anything critical done (filing paperwork for a company, visa, etc.) that you will need at least 3 tries and at least 2 hours per visit to the powers that be.  Bring something to do.  And note that you can’t bring devices into US embassies/consulates. Laptops, cell phones, iPads, iPods – all such devices must stay at the screening point, and some buildings won’t even let you leave them in security, which means you will need to leave them at home or with a friend outside the building.\n\nAlso, don’t forget that most places have a rocking startup community, even if it is dinky, and you have access to already!  Sign up for the local <a href=\"http://startupdigest.com/\" target=\"_blank\">StartUpDigest</a>.\n\nLast but not least, why not join us at one of our “Doing PR In Europe” roundtables?  <a href=\"http://twitter.com/coletteballou\" target=\"_blank\">Ping me on Twitter for an invite</a> – if we can’t get you in this round, we’ll get you in the next one.",
    "type": "post",
    "path": "/2011/01/20/what-you-need-to-know-to-go-international-us-version/"
}