{
    "title": "How to Turn an Angry Customer into an Advocate",
    "slug": "what-to-do-when-a-customers-pissed",
    "date": "2013-08-26T16:49:29.000Z",
    "url": "http://500.co/?p=1116729337",
    "uri": "http://500.co/2013/08/26/what-to-do-when-a-customers-pissed/",
    "postId": "1116729337",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/08/megcrying.gif",
        "http://500.co/wp-content/uploads/2013/08/eatingburger.gif",
        "http://500.co/wp-content/uploads/2013/08/thumbs-up.gif"
    ],
    "creator": "",
    "categories": [
        "airbnb",
        "customer-service",
        "musings",
        "startups",
        "support"
    ],
    "content": "<p dir=\"ltr\" style=\"text-align: left;\">Earlier this summer, I had one of the worst experiences with one of my favorite startups. I'd somehow managed to lock myself out of my Airbnb condo in NYC.</p>\n<p style=\"text-align: left;\">A simple mistake meant that I was stranded in NYC, with ALL my personal belongings inside a stranger’s condo. Since the place had a 24 hour doorman, I figured getting back in would be as simple as getting a spare key. But the response I received was, \"we don't have any spare keys,\" and both Airbnb and the owner weren't responding to texts or emails. I had no place to go, and my phone was running out of battery.</p>\n<p style=\"text-align: center;\"><a href=\"/backup/megcrying-2013-08-26-13-11-49.gif\"><img class=\"aligncenter  wp-image-1116729341\" alt=\"megcrying\" src=\"/backup/megcrying-2013-08-26-13-11-49.gif\" width=\"372\" height=\"240\" /></a></p>\n<p dir=\"ltr\" style=\"text-align: left;\">Even worse, the super said that there was NO WAY to get into the condo without the owner being present. For all I knew, he was in Europe and wouldn't be returning for 3 days.</p>\n<p dir=\"ltr\" style=\"text-align: left;\">I was fucked. And pretty pissed (even though, yes, it was kind of my fault).</p>\n<p dir=\"ltr\" style=\"text-align: left;\">I know what it's like to be on the other end of this situation. I've worked my fair share of difficult, customer-facing jobs (hello, McDonald's!), and entered the startup world by doing billing support at a startup with lots of customers.</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"/backup/eatingburger-2013-08-26-13-11-49.gif\"><img class=\"aligncenter  wp-image-1116729345\" alt=\"eatingburger\" src=\"/backup/eatingburger-2013-08-26-13-11-49.gif\" width=\"350\" height=\"255\" /></a></p>\n<p dir=\"ltr\" style=\"text-align: left;\">Working with people can be infuriating, especially when they're mad, unreasonable or irrational. But keep this in mind – if someone's angry, it's because they care enough to stick around. A customer that's truly a lost cause will just drop your service and never return. And if they paid for it, they'll issue a chargeback to get their money back (which is really, really bad for your company's rep).</p>\n<p dir=\"ltr\" style=\"text-align: left;\">Here's how to address your pissed off customers – and bring them back into their happy place:</p>\n<p dir=\"ltr\" style=\"text-align: left;\"><strong>Assume what they're saying is true</strong></p>\n<p dir=\"ltr\" style=\"text-align: left;\">Unless they're telling you something completely preposterous, work off the assumption that a pissed off customer isn't trying to scam you. There's nothing more infuriating than calling a support number and having a company rep meet your concerns with skepticism or (even worse) condescension.</p>\n<p dir=\"ltr\" style=\"text-align: left;\">Most customers who are in a bad mood expect to have a horrible time trying to get their issue resolved. Disarm them right away with an admission of guilt: Say \"ok, it looks like we messed up. Let's fix this ASAP\" instead of  \"are you sure that happened?\"</p>\n<p dir=\"ltr\" style=\"text-align: left;\">When I contacted Airbnb about my dilemma, their first response was a long apology and message asking if I was OK. No debate about what happened or any blame (even though I was the idiot who locked myself out) – just a promise to make things right as quickly as possible.</p>\n<p dir=\"ltr\" style=\"text-align: left;\"><strong>Don't just apologize, go above and beyond what they expect</strong></p>\n<p dir=\"ltr\" style=\"text-align: left;\">Talk is cheap, especially when you're angry. Anyone can say they're sorry and promise to fix something, so do more than just fix the problem, even if it takes some extra time and money. The word of mouth and lifetime value you'll get out of the customer will be well worth it.</p>\n<p dir=\"ltr\" style=\"text-align: left;\">This can be as small as sending them a shirt, a gift card, or offering some sort of free upgrade. If you go the upgrade route, don't make it for only a week or a month. Upgrade them for life.</p>\n<p dir=\"ltr\" style=\"text-align: center;\"><a href=\"/backup/thumbs-up-2013-08-26-13-11-49.gif\"><img class=\"aligncenter  wp-image-1116729343\" alt=\"thumbs up\" src=\"/backup/thumbs-up-2013-08-26-13-11-49.gif\" width=\"448\" height=\"224\" /></a></p>\n<p dir=\"ltr\">When Airbnb was sorting out how to get me back into my condo, they immediately agreed to refund me for the night I was locked out. They also told me to have brunch and do fun things in NYC (on their dime) while I waited for them to contact the owner. It didn't make up for being locked out all night, but free brunch was music to this San Francisco yuppie's ears. And it was totally unexpected.</p>\n<p dir=\"ltr\"><strong>Don't use generic language</strong></p>\n<p dir=\"ltr\">For the love of god, NEVER use a canned response hen someone's pissed. If you or your support team is sending out standardized “we’ll get back to you as soon as we can” emails, get into the habit of taking 5-10 seconds to customize each one a little bit. Getting a robotic response when you're angry might even be worse than no response at all. Plus, hearing from an actual human is such a relief when things are going wrong.</p>\n<p dir=\"ltr\"><strong>Jump into the conversation</strong></p>\n<p dir=\"ltr\">As the founder/CEO, you should already be talking to your customers regularly – regardless of the size of your company. If Steve Jobs was able to make time to respond to customers, you can too.</p>\n<p dir=\"ltr\">Take 5 minutes to jump in and let them know the person at the top cares about their experience and wants to make it right. Want to really impress them? Call them instead of sending an email.</p>\nPissed off customers are just a few steps away from being your biggest advocates, so take the time to deal with them – even if they seem crazy at first. Instead of a story of how Airbnb left me homeless, I’m now telling people about how they offered to buy me brunch.",
    "type": "post",
    "path": "/2013/08/26/what-to-do-when-a-customers-pissed/",
    "backgroundImage": "/backup/angryguy-960x540-2013-08-26-13-11-49.jpeg"
}