{
    "title": "When and How to Define Your User Engagement Cycle",
    "slug": "when-and-how-to-define-your-user-engagement-cycle",
    "date": "2013-11-19T18:37:34.000Z",
    "url": "http://500.co/?p=1116730719",
    "uri": "http://500.co/2013/11/19/when-and-how-to-define-your-user-engagement-cycle/",
    "postId": "1116730719",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "distribution",
        "distribution",
        "distribution-hacking",
        "growth",
        "marketing",
        "user-engagement"
    ],
    "content": "<p dir=\"ltr\"><em>This post is part of the ongoing Distribution series. Every week the <a href=\"http://500.co/distribution/?utm_source=500Blog&amp;utm_campaign=DistributionTuesday\" target=\"_blank\">500 Distribution Team</a> highlights actionable resources for marketing your startup. Get even more tips by following @<a href=\"https://twitter.com/500Distribution\" target=\"_blank\">500Distribution</a> on Twitter and subscribing to our <a href=\"http://500.us7.list-manage2.com/subscribe?u=79dc9a3284790af0567d6845f&amp;id=b52998a3a5\" target=\"_blank\">email newsletter</a>.</em></p>\n<p dir=\"ltr\">In <a href=\"http://500.co/2013/10/15/startup-metrics-dont-let-your-sac-get-wacc/\" target=\"_blank\">my last post</a>, I talked about how startups should think about metrics in the context of growth. Given that the most urgent questions for many start-ups revolve around HOW they can grow, and whether the growth they may be experiencing is scalable and sustainable, this post focuses on the more tactical aspects of achieving growth.</p>\n<p dir=\"ltr\">Let’s say that your product is in the marketplace, you have an initial set of users, and you may even be experiencing some nascent growth. How do you take the next step towards accelerating your efforts? You need to develop an understanding of how your users are interacting with your product, and which users are most valuable. Defining your user engagement cycle is a good place to start. Engagement is synonymous with retention, which is the most critical element in a sustainable, scalable growth dynamic—more so than user acquisition.</p>\n<p dir=\"ltr\">Each company’s cycle is unique, depending on the feature set of the product, key usages, and monetization scheme. At its core, it spans the cradle-to-grave experience that users have, starting with the sign-up/purchase funnel and ending with them becoming non-users by either becoming permanently dormant or deleting their account. In between, you need to identify all of the key activities that users can engage in, as well as all of your touch-point opportunities with them. Some of the key questions you need to be able to answer include:</p>\n\n<ul>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>Where are your users coming from? How are they finding you?</strong></p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>At which stage are you seeing significant drop-off: acquisition, activation, etc.?</strong></p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>How many users are using your product daily? Weekly? Monthy?</strong></p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\"><strong>What are they doing, and how active are they?</strong></p>\n</li>\n</ul>\n<p dir=\"ltr\">Keep in mind that your user base is heterogeneous and should be thought of in terms new, casual, core, and dormant user segments. Your goal is to first define what classifies a user as belonging to each of these segments. Then, you must understand how core users—who are your most valuable users—differ from casual and dormant users in terms of behavior. It could be that core users complete registration upon their first visit, add a profile photo immediately, invite at least two friends, come back at least three times during the first week, or complete their first purchase in their first visit. Identify which actions correlate most closely with a high LTV.</p>\n<p dir=\"ltr\">As a next step, develop and test a series of hypotheses for how you can nudge new and casual users into the core user bucket. For example, At Hulu a key predictor of a Hulu Plus subscriber’s customer lifetime was how many minutes of content they watched during a given time period. Knowing that, we worked towards maintaining the necessary level of video consumption by personalizing the user experience and serving up relevant recommendations, through the application UX as well as through email campaigns.</p>\nAs a corollary, you should also test different means of reactivating dormant users and rescuing users who have bailed. Email, or push notifications if your primary point of user engagement is a mobile app, is your only realistic opportunity to reactivate dormant users. While reactivation is generally a long-shot, you can maximize your odds by offering meaningful value to these users: a discount, an offer to a complementary service, or high-value content.\n\nRescuing bailed users takes two forms. Those who bail during registration or on-boarding can be re-engaged using retargeting or email, if you capture email addresses at the top of your funnel. Those who bail after being active users for a period of time are the least likely to reactivate because they’ve ceased to find your offering valuable. Include a survey in your cancellation flow to gain insight into the user’s reason for leaving; if it’s tied to a factor that may change over time, for example pricing or feature set, you may have an opportunity to win them back later via email.\n\nAt this point, you’ve defined and optimized your user engagement cycle. With an understanding of which users are the most valuable, and how to maximize that value, you are now ready to go into full-blown growth mode: testing and identifying which customer acquisition channels can drive the most users likely to become core users in an ROI-positive and scalable manner.\n<h2><b>What's Next?</b></h2>\nIf you enjoyed this post, first check out these additional resources for how you can up your game from the 500 Distribution team:\n<ul>\n\t<li><a href=\"http://500.co/2014/03/13/5-distro-experiments-you-can-do-on-10-or-less/\">5 Distribution Experiments You Can Do For $10 Or Less</a></li>\n\t<li><a title=\"The WhatsApp Effect: Don’t Base Your Acquisition Strategy on Outliers\" href=\"http://500.co/2014/03/03/the-whatsapp-effect/\" target=\"_blank\">The WhatsApp Effect: Don’t Base Your Acquisition Strategy on Outliers</a></li>\n\t<li><a href=\"http://500.co/2013/08/13/how-to-suck-less-at-e-mail-marketing/\">How to Suck Less at Email Marketing</a></li>\n\t<li><a href=\"http://500.co/2013/10/25/the-power-of-trigger-emails/\">The Power of Trigger Emails</a></li>\n</ul>\nThen, sign up to get a daily bite-sized distro hack (and one awesome GIF) delivered to your inbox:\n\n<b>&gt;&gt; </b><a href=\"http://eepurl.com/BfYXn\"><b>Subscribe to Distrosnack here</b></a><b> &lt;&lt;</b>\n\n&nbsp;",
    "type": "post",
    "path": "/2013/11/19/when-and-how-to-define-your-user-engagement-cycle/",
    "backgroundImage": "/backup/circle-960x540-2013-11-19-13-12-37.jpg"
}