{
    "title": "When to Fire – and When to Keep – a Startup Employee",
    "slug": "when-to-fire-and-when-to-keep-a-startup-employee",
    "date": "2013-09-04T15:46:46.000Z",
    "url": "http://500.co/?p=1116729571",
    "uri": "http://500.co/2013/09/04/when-to-fire-and-when-to-keep-a-startup-employee/",
    "postId": "1116729571",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "anonymous",
        "confessions",
        "employees",
        "firing",
        "founders",
        "musings",
        "startups"
    ],
    "content": "<p dir=\"ltr\"><em>The following post was submitted by an anonymous 500 Startups founder.</em></p>\n<p dir=\"ltr\">A while back, I hired someone with relevant experience in our industry and demonstrated success in account management with previous employers. This person had never worked at a startup before. Shortly after bringing them onto the team, I began to have issues with their performance. They were unfocused, wouldn’t finish projects, and had trouble meeting the goals for leads, followups and sales that we’d set when they started.</p>\n<p dir=\"ltr\">My company’s definitely not perfect (we’re a startup, after all), and there’s no training manual, clear employee onboarding or other new employee resources a larger company might have. I really wanted this employee to be successful, and – as demonstrated by their previous work experience – they had the skills and experience needed to really kick ass in this position. But for some reason, their performance just wasn’t up to par.</p>\n<p dir=\"ltr\">I reached out to some of my founder friends for advice, and the responses I received were divided sharply between two camps:</p>\n<p dir=\"ltr\"><strong>Camp “It’s Their Fault”: Cut our losses and fire them</strong></p>\n<p dir=\"ltr\"><strong>Camp “It’s Your Fault”: Fix our management process</strong></p>\n<p dir=\"ltr\">Was I setting up this employee to fail or succeed? After some deliberation, here’s what happened:</p>\n<p dir=\"ltr\">I sat them down and clearly laid out the delta between our expectations (driving revenue measured by qualified leads and actionable opportunities) and their performance over the first 3 months on the job.</p>\n<p dir=\"ltr\">I told this person that normally I would have let other people go in this situation (and have before), but given the relevant experience and passion for our product, I wanted to give them a fair chance to change their behavior. I also had a long discussion about whether or not this person’s behavior was helping us grow the company, and how distracting activities that do not contribute to their stated goals should be dropped.</p>\n<p dir=\"ltr\">My employee was surprised to hear this. That made me realize that a lot of this was our fault – if you’re good at communicating with your team, nothing this important will come as a surprise. Here’s where I failed:</p>\n\n<ol>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">We didn’t set clear goals</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">We didn’t have realistic expectations for ramp time – including learning all the specifics of our product</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">We didn’t provide daily feedback</p>\n</li>\n\t<li dir=\"ltr\">\n<p dir=\"ltr\">We didn’t give them the right resources</p>\n</li>\n</ol>\n<p dir=\"ltr\">After realizing our mistakes and resolving to make things right, we renegotiated a contract with more specific goals. I’ve seen this employee’s performance change drastically, and they’re already exceeding their new goals. They’re now focused on generating leads, opportunities, and closing businesses.</p>\n<p dir=\"ltr\">If you find yourself in the same situation, here’s what to ask yourself before deciding to fire someone or keep them around:</p>\n<p dir=\"ltr\"><strong>Evaluate whether you’re investing or wasting time</strong></p>\n<p dir=\"ltr\">Does the employee actually have the skills necessary to get the job done? If not, it’s because you suck at hiring. Find another role for them or get rid of them, then figure out how to hire the right people. If they have skills for the job, think about how can meet the goals you’ve set for them. Do your goals make sense? Are they clear enough? Do they have the resources they need? Investing in someone talented will eat up some of your time, but you’ll get massive returns later on when they start kicking ass. If they have the skillset and are passionate your company, they’re probably worth it.</p>\n<p dir=\"ltr\"><strong>Know how much of a “startup” you really are:</strong></p>\n<p dir=\"ltr\">Would I have taken this much time to focus on an underperforming employee when we were a very early-stage startup? No. But we’re leaving the 'startup' stage where it’s okay to expect a team member to “figure it out or leave,” and moving to a stage where it’s our responsibility to provide structure for employees to succeed – even employees without a founder’s personality. This person had never worked for a startup before, and we knew that when we hired them. We definitely should have spent at least a little time onboarding instead of expecting them to know everything from day one.</p>\n<p dir=\"ltr\"><strong>Be critical of yourself and the management team</strong></p>\n<p dir=\"ltr\">Look at where you may have failed to set up employees for success. Are you bad at communicating goals? Do you hire for one thing, then expect people to do something else? Are you a micro-manager who doesn’t let them get anything done? Think about all the ways YOU might be messing up. If management is a mess at 10 people, imagine how much worse it’ll be when the team is 10x, or even 100x larger. Fix problems when your startup is small – they’ll only get bigger later.</p>\n<p dir=\"ltr\">Every startup is different. Hire slow and fire fast, but remember to think twice before you let go of an underperforming employee. In our case, keeping someone around – when others may have let them go – resulted in a kickass addition to our team.</p>",
    "type": "post",
    "path": "/2013/09/04/when-to-fire-and-when-to-keep-a-startup-employee/"
}