{
    "title": "Why My Team and I Joined 500 Startups",
    "slug": "why-my-team-and-i-joined-500-startups",
    "date": "2013-06-28T16:26:02.000Z",
    "url": "http://500.co/?p=1116728179",
    "uri": "http://500.co/2013/06/28/why-my-team-and-i-joined-500-startups/",
    "postId": "1116728179",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "accelerator",
        "ebooks",
        "education",
        "kitereaders"
    ],
    "content": "<em><strong>The following post was contributed by Chintu Parikh, CEO and Founder of <a href=\"http://angel.co/kitereaders\" target=\"_blank\">KiteReaders</a> (a Batch 6 company). Follow them online at <a href=\"http://www.angel.co/kitereaders\">AngelList</a>, <a href=\"http://twitter.com/kitereaders\">Twitter</a>, and <a href=\"https://www.facebook.com/kitereaders\" target=\"_blank\">Facebook</a>.\n</strong></em>\n\nSince we began our endeavor over a year ago to launch our bootstrapped company, KiteReaders, we had been growing at a steady pace. We had customers that loved us, continued to give us steady business and referrals, and ever-growing revenue. Our team had expanded from an initial 3 members to 5 full-time as we continued to reinvest in the business and put forth efforts to expand our market. We had considerable proof that the product we were building was a market need and we were furiously working to meet the customer demands. However, we were also stretched thin.\n\nAs CEO, I was continuing to add to the number of “hats” I was wearing: Business development, financial growth, product fine-tuning, hiring, speaking engagements at conferences and so forth. Our business had reached a point that was ready to scale. I knew in order to scale effectively, I needed not only investment but also a network that enabled and supported an entrepreneur with drive to grow his/her business. It is daunting to go at it alone.\n\nThe opportunity to join 500 Startups’ accelerator program came at the perfect time. Not only did 500 have an outstanding reputation, but 500 and KiteReaders shared a very similar set of values. Specifically:\n\n<strong>1. 500 encourages females founders and family tech.</strong>\n\nOne of the defining aspects of KiteReader’s founding team is that it is dominated by females, including my co-founder Aarti Parikh, who also serves as CTO. In addition, KiteReaders’ primary customers are children’s book authors and publishers, parents and children, and librarians and teachers, making it a family tech business. Already, our inclusion in 500 has enabled us the opportunity to present our platform at the Mama Bear Family Tech Conference.\n\n<strong>2. 500 supports diversity.</strong>\n\nWe have a diverse team that works with both new and established authors and publishers from around the globe to serve readers everywhere. Having invested in over 35 countries (and growing), 500 Startups is a big believer in openness and diversity. 500 has funded more international startups than anyone else in the history of entrepreneurship.\n\n<strong>3. The #500strong community.</strong>\n\nWith access to the extensive 500 network, our team has had the incredible opportunity to work alongside international batch mates, meet with the knowledgeable 500 staff, mentors, and partners, and connect with the <a href=\"http://500.co/\">500 Startups</a> viral community via its Dashboard platform. Within the first few weeks, the input we received around key metrics, pitches, design, and growth strategy has given us a laser-sharp focus. Our team is now working furiously towards driving the business with new approaches, quicker decision-making, and a faster iteration process.\n\nWe’re thrilled with our 500 Startups experience so far. Launching and growing a startup is all about the journey, not the destination, and we know our time here will be valuable in more ways than one.\n\n<em><strong> </strong></em>",
    "type": "post",
    "path": "/2013/06/28/why-my-team-and-i-joined-500-startups/"
}