{
    "title": "Why Facebook for India Is a Waste of Time",
    "slug": "why-facebook-for-india-is-a-waste-of-time",
    "date": "2013-04-26T01:52:05.000Z",
    "url": "http://500.co/?p=1116726887",
    "uri": "http://500.co/2013/04/25/why-facebook-for-india-is-a-waste-of-time/",
    "postId": "1116726887",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "entrepreneurs",
        "facebook",
        "india-2",
        "musings",
        "social-2",
        "startups"
    ],
    "content": "<em><strong> This article <a href=\"http://citizentekk.com/2013/04/19/facebook-for-india-is-a-waste-of-time/\" target=\"_blank\">first appeared on CitizenTekk</a></strong></em>\n\nIn a country of almost 1.3 billion people, mid-20th century infrastructure, rampant corruption, over 400 million people below the international poverty line, roughly another 400 million people that are considered middle class and one of the youngest populations on the planet – building the next Facebook is not exciting.\n\nSo what *is* exciting? Solving problems for over <b>800 million</b> people who don’t have access to smartphones, tablets or computers. The real opportunities in India for smart, savvy entrepreneurs is to solve the problems plaguing them on a daily basis. And there really is no shortage of problems, big or small.\n\nFor example, A SMS based service that brings “mandi” (market) prices directly to a farmer and allows the farmer to know exactly how much his produce will get him at a market in Mumbai, Delhi, Indore, Kolkata, etc. In 2009, Thomson Reuters made over a million dollars a year by providing this service to farmers in only three states in India. In many cases, information about current market prices has helped farmers better negotiate fair prices with middlemen, sometimes tripling the amount of money the farmer receives.\n\nEver hear of “star dialing”? Chances are that if you live in the US, you haven’t. In India, on my mobile phone, I can dial *123# and my current balance will pop up on an iPhone just as easily as a Nokia 1100 feature phone. The best part is that “star dialing” doesn’t cost the caller anything – and no call ever gets terminated. Well, can you imagine building a banking solution on top of this for people who don’t have access to a bank? Eko Financial, based in New Delhi, has done exactly that. For the millions of people who don’t have access to a bank or the millions who need to send money back home to their family in a small village, can now do so quickly and easily by going to a local bodega (we call them “kirana” stores in India) and by giving cash to the store owner. The store owner simply enters a sequence of numbers to authenticate the service and transmits the cash to the destination account. All of this is done in minutes and payments can be tiny or relatively large.\n\nImagine you live in a rural area with no terrestrial Internet connection, no <b>3G</b>, no <b>2G</b> – nothing.  You have a mobile phone to communicate with the world via voice and SMS. Imagine if you could search the web simply by sending an SMS to <b>55444</b>. Now you can find the Rotten Tomatoes ratings for a movie playing over the air, or you can join IRC style chat rooms simply by using SMS. Innozlet’s you do all of these things and a whole lot more. It’s bringing the power of the Web and applications to people who would never have had access to them. The reality is people living in remote, rural parts of India can now connect with people in cities over IRC style chat rooms, find out the seven day forecast, and even get the best price for a TV from eBay simply by sending a text message.\n\nThese are just a few examples of mobile applications that people have built in India over SMS. Add in smartphone apps that alert civic authorities to sewage problems, garbage piled up on the side of the road, illegal construction, unsafe working conditions, etc. and you have a tech savvy urban population that can use technology to improve their quality of life. The opportunity in India isn’t in building another social network or e-commerce site that sells printed kurtis online. The poor across India are hard-pressed to get access to basic resources. The middle class is very aspirational and though price sensitive, the household savings rate, as a percentage of GDP, fell to <b>7.8%</b> – the lowest in 20 years, according to a report in <a href=\"http://timesofindia.indiatimes.com/business/india-business/Household-savings-lowest-in-22-years/articleshow/15650813.cms\"><b>Times of India</b></a>. This means middle class Indians are spending and it’s been increasing.\n\nToday, it’s possible to get a basic smartphone in India for INR 4,500 or less than USD 85. The Aakash tablet was an ambitious project to produce a basic Internet device that can be used anywhere a mobile phone can at a USD 50 (subsidized to USD 35). A good deal of controversy surrounded the Aakash tablet. However, the push from the Indian government as well as manufacturers towards more affordable smartphones and tablets will help to create massive opportunities for entrepreneurs. These saavy entrpreneurs will be able to provide solutions to every day problems including education, entertainment, sports, content, and other utilities all while serving hundreds of millions of people who are accessing technology for the first time.",
    "type": "post",
    "path": "/2013/04/25/why-facebook-for-india-is-a-waste-of-time/",
    "backgroundImage": "/backup/indians-960x540-2013-04-25-13-20-52.jpg"
}