{
    "title": " Why You're Not Getting a Meeting: Part II",
    "slug": "why-youre-not-getting-a-meeting-part-ii",
    "date": "2011-08-04T02:46:04.000Z",
    "url": "http://blog.500startups.com/?p=1116715812",
    "uri": "http://500.co/2011/08/03/why-youre-not-getting-a-meeting-part-ii/",
    "postId": "1116715812",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/08/Melissa-150x150.jpg"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<a href=\"http://500.co/wp-content/uploads/2011/08/Melissa.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116715814\" title=\"Melissa\" src=\"/backup/Melissa-150x150-2011-08-03-11-21-46.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a>\n\n<em>500 Startups Office Manager and Executive Assistant to Dave McClure, Melissa Grody (<a href=\"http://twitter.com/#!/dmelissag\">@DMelissaG</a>) continues with Part 2 of \" Why You're Not Getting a Meeting,\" in which she explains <em>what you should be doing to increase your chances of getting a meeting.</em> Catch up on Part 1 <a href=\"http://500.co/2011/08/02/why-youre-not-getting-a-meeting-part-i/\">here</a>.</em>\n\nTo Dos\n\nDo your own homework\n\nNot only regarding 500 Startups in general but in reference to connections and referrals. We're particularly noticeable in this regard since a lot of our incoming requests are via referrals. When advised of this, go do your own homework. Don't ask the EA to intro you to people, or even worse, ask to use them as the main intro in. Seriously. (Every time I think of the people who try this I shake my head. I can’t help myself.) Please don’t badger people you want to intro you though. You may lose friends. If people are reluctant, consider why. There are actually multiple mentions out there of who to approach/how to network (as in those around the person you want to meet, not them directly). Search it out. In fact, you can start with this blog post: <a href=\"http://www.drowningamerican.com/2011/07/14/raising-money-for-your-startup-stop-talking-to-investors/\">“Raising Money for your Startup? Stop Talking to Investors!”</a>\n\nBe polite\n\nI'm sure you were raised with manners. Utilize them. This includes in electronic communication. We're in the tech world. You know to not use all caps/excessive bolding, etc for communications. You don't necessarily have to be formal. That's going to depend on your audience but politeness is always a great policy. Simple \"pleases\" and \"thank yous\" go a long way. (When you do get the meeting and see them in person - be friendly! SUPER MEGA EXTRA POINTS = thanking them for arranging the meeting. I know you're thinking, \"But isn't that their job?!\" Absolutely, it's their job, but it's always nice to be thanked.\n\nThis is KEY: Expect to be asked for and have ready a deck and recent metrics and a phone number.\n\nIt's standard to have a deck and metrics and for them to be requested in advance. You're going to be asked for them. If you don't even have a deck... GET ONE. You’re not going to be taken as seriously if your response is, “I don’t have one.” Want to win extra brownie points? Send them right away, before you're asked, in the initial communication. You've just saved the EA some time. It will be appreciated. Plus, you're going to appear on top of your game and your company.\n\nThe same goes for the phone number. It’s unfortunate but sometimes meetings need re-scheduled or delayed. The EA wants to be able to reach you and will ask for your number just in case. If you’ve already given it, again you’ve saved time. (Extra incentive to give your actual, reachable number, sometimes the exec will call you personally.)\n\nDon't take this to mean you shouldn't bring that info with you. Arrive prepared. Arrive ready to provide the deck, metrics and possibly a demo. Put your deck in both paper and electronic form.\n\nBe specific\n\nTell the EA who you are and what the meeting is regarding. Short messages just saying little or nothing more than you want a meeting aren’t helpful and can actually be mistaken for spam or unsolicited requests for meetings. They may not receive the attention they deserve. They’ll also require more back and forth as the EA tries to discern what the meeting is all about.\n\nIf you are in a different area, time zone or part of the world from the exec, advise of such when requesting the meeting.  Phone calls can be scheduled with more flexibility than face to face meetings and will need to be arranged based on time zones if the exec is travelling or you’re somewhere else. It’s helpful if you need less than 30 minutes to state so. Starting off with a 15 min. call and then following up with a 30 min or less face to face is great. You’re more likely to get in sooner rather than later, too.\n\nFollow up\n\nGuess what... you're dealing with a human. Despite all best efforts, there is certainly a chance that your email fell through the cracks. Give it a reasonable amount of time and follow up to check on the status. When requesting meetings with others I give it two business days. To prevent myself from forgetting to check back I use <a href=\"http://www.boomeranggmail.com/\">Boomerang</a> to bring the message back to my inbox if I don't receive a response and I'll often also set a calendar reminder to follow up if it's a particularly crucial meeting request. You can also follow up with a phone call. This might even be recommended if your schedule and the exec’s have caused a lot of back and forth emails.\n\n:) Good luck!",
    "type": "post",
    "path": "/2011/08/03/why-youre-not-getting-a-meeting-part-ii/"
}