{
    "title": "Why Facebook Doesn’t Work for Health",
    "slug": "why-facebook-doesnt-work-for-health",
    "date": "2013-04-03T00:29:35.000Z",
    "url": "http://500.co/?p=1116726623",
    "uri": "http://500.co/2013/04/02/why-facebook-doesnt-work-for-health/",
    "postId": "1116726623",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2013/04/health.png"
    ],
    "creator": "",
    "categories": [
        "autism",
        "guest-posts",
        "health"
    ],
    "content": "<p dir=\"ltr\"><em><b id=\"internal-source-marker_0.5012922524474561\">Post contributed by <a href=\"https://twitter.com/ejpeacock\" target=\"_blank\">Eric Peacock</a> and <a href=\"http://twitter.com/marycray\">Mary Ray</a>, co-founders of <a href=\"http://www.myhealthteams.com/\" target=\"_blank\">MyHealthTeams</a>. </b>MyHealthTeams believes that if you are diagnosed with a chronic health condition, it should be easy to find the best people around to help you. To date, they have launched <a href=\"http://www.myautismteam.com/\" target=\"_blank\">MyAutismTeam</a> (for parents of kids with autism), <a href=\"http://www.mybcteam.com/\" target=\"_blank\">MyBCTeam</a> (women with breast cancer), and most recently <a href=\"http://www.mymsteam.com/\" target=\"_blank\">MyMSTeam</a> (individuals with multiple sclerosis). 500 Startups was an investor in MyHealthTeams’ seed round over the summer.</em></p>\n<p dir=\"ltr\">A recent statistic from the CDC reported that 1 in 50 kids in America will be diagnosed with autism. Chances are someone in your life will be affected by it – perhaps your friend’s son, a daughter of an employee in your startup, or even your own child. And by the end of this decade, more than a half a million of these kids with autism will become adults with autism. Unfortunately, our health care system is woefully unprepared to handle this epidemic growth.</p>\n<p dir=\"ltr\">Now imagine your child was just diagnosed with autism. If you’re like most people, this is what you’ll do:</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Drink from a firehose</strong> – You Google like you’ve never googled before to learn everything you can about autism</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Piece togethers some semblance of an action plan</strong> –  Based on your googling, you’ll write down a laundry list of critical (and maybe not so critical) to-do’s to help your child: speech therapy, occupational therapy, behavioral analysis, experimenting with diet, getting in the right school districts, negotiating the right services, finding the right insurance, and so on. You try to prioritize.</p>\n<p dir=\"ltr\" style=\"padding-left: 30px;\"><strong>Try to find others who have been in your shoes</strong> – Instincts set in and you say, “Why does it feel like I’m re-inventing the wheel here?  I want to find other parents who have been in this situation and learn from them.</p>\n<p dir=\"ltr\">After all this, you ask yourself the single question you will never stop asking yourself for the rest of your life: \"Am I doing enough for my child?\"</p>\n<p dir=\"ltr\">To address these issues, we created a social network for parents of kids with autism called <a href=\"http://www.myautismteam.com/\">MyAutismTeam</a>. But Autism is just one of the 100 different chronic conditions overwhelming the health care system.</p>\n<p dir=\"ltr\">We co-founded MyHealthTeams to help the more than 1 in 2 Americans living with a chronic condition. Providing the right information and support for patients is something the health care system will never, ever be able to do on its own. A big part of the solution will come from startups like us, and probably not from the likes of Facebook or Google. Here’s why:</p>\n<p dir=\"ltr\"><strong>Mass Market Functionality Can't Fulfill Niche Market Needs</strong></p>\n<p dir=\"ltr\">When we launched <a href=\"http://www.myautismteam.com/\">MyAutismTeam</a>, and later <a href=\"http://www.mybcteam.com/\">MyBCTeam</a> (a social network for women diagnosed with breast cancer) and <a href=\"http://www.mymsteam.com/\">MyMSTeam</a> (for people with multiple sclerosis), a lot of members flocked to us from Facebook groups because they couldn’t refine their search beyond just folks with autism, or women with breast cancer.  The mother of the 7-year-old, non-verbal, but highly outgoing boy with autism wanted to find other parents with children just like hers.  The 32-year-old woman with stage 2 invasive lobular breast cancer who wants information about having children after chemotherapy wants to find 20 or 30, even 100 young women just like her – not every woman with breast cancer. People want to find others just like them and learn from them. By continuously and rapidly iterating our platform based on constant user feedback, we have been able to provide product features as easy to use as what you would find on LinkedIn for recruiting, a Match.com for dating, or a Kayak.com for travel.</p>\n<p dir=\"ltr\">The same is true for finding providers. It should be just as easy to find an occupational therapist who’s good at helping autistic teens improve their handwriting, as it is to find a taqueria open after midnight that is good for groups on Yelp. People want a provider directory with all the bells and whistles of yelp that’s focused on providers related to their condition.</p>\n<p dir=\"ltr\"><a href=\"/backup/health-2013-04-02-13-18-29.png\"><img class=\"alignleft  wp-image-1116726625\" alt=\"health\" src=\"/backup/health-2013-04-02-13-18-29.png\" width=\"744\" height=\"469\" /></a></p>\n<strong>People Want a Customized Experience</strong>\n<p dir=\"ltr\">People facing a chronic condition are busy. In addition to an already busy home life and career, they now have appointments and treatments galore, with very real side effects slowing them down. Many of these people have tried Facebook groups, but have found they don’t offer the customization they need – and most don’t feel comfortable sharing health details on Facebook, anyway. You just can’t expect these people to find you, so you need to reach out to them using every scrappy marketing tool you can think of to rise above the clutter.</p>\n<p dir=\"ltr\">Once they find you, they’ll be become loyal, raving fans of your social network –  as long as you listen to what they have to say. At MyHealthTeams, we release a new version of each of our sites about every week, based on feedback from our users, and we’ve gone so far as to make sure we launch a separate social network for every condition we address. If you have Multiple Sclerosis, you don’t really want to be on a site for people with prostate cancer, or hereditary angioedema, or autism – and vice versa.</p>\n<p dir=\"ltr\"><strong>It's Hard Work, But The Rewards Are Great</strong></p>\n<p dir=\"ltr\">So far, MyAutismTeam went from 30 registered parents at launch to more than 41,000 parents from every part of the US and Canada today. Autism Speaks – the biggest foundation in autism – named MyAutismTeam as their official social network. And this morning, we got to hang out with <a href=\"http://www.today.com/id/49063771/ns/today-video/#51403958\">Hoda and Kathie Lee and talk about MyAutismTeam</a> on the Today Show (so hopefully the other 1 million+ parents of kids with autism out there hear about us).</p>\nOf course, the thing that really fuels us are the thank you posts and emails we receive every day from parents of kids with autism, women with breast cancer, and people facing multiple sclerosis. We’ve still got a long way to go, but it’s good to know we’re already making a difference.\n\n<em><strong>April 2nd is World Autism Awareness Day. Learn more about how you can help <a href=\"http://www.autismspeaks.org/what-autism/world-autism-awareness-day\" target=\"_blank\">here</a>.</strong></em>",
    "type": "post",
    "path": "/2013/04/02/why-facebook-doesnt-work-for-health/",
    "backgroundImage": "/backup/faces-2013-04-02-13-18-29.png"
}