{
    "title": " Why You're Not Getting a Meeting: Part I",
    "slug": "why-youre-not-getting-a-meeting-part-i",
    "date": "2011-08-03T00:49:25.000Z",
    "url": "http://blog.500startups.com/?p=1116715811",
    "uri": "http://500.co/2011/08/02/why-youre-not-getting-a-meeting-part-i/",
    "postId": "1116715811",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/08/Melissa-150x150.jpg"
    ],
    "creator": "",
    "categories": [
        "uncategorized"
    ],
    "content": "<div><a href=\"http://500.co/wp-content/uploads/2011/08/Melissa.jpg\"><img class=\"alignnone size-thumbnail wp-image-1116715814\" title=\"Melissa\" src=\"/backup/Melissa-150x150-2011-08-02-11-19-49.jpg\" alt=\"\" width=\"150\" height=\"150\" /></a></div>\n<em><em>Melissa Grody (<a href=\"http://twitter.com/#!/dmelissag\">@DMelissaG</a>) is the </em>500 Startups Office Manager and Executive Assistant to Dave McClure. Melissa hails from the land of snow and ice (Pennsylvania) and is a recent resident of Silicon Valley. Before this she worked virtually (or perhaps virtually worked, depending on who you ask) with various clients. In the spirit of MVP that's all we're going to say.</em>\n<div>\n\nSome may think this post is self-serving... and perhaps to a certain degree it is. As an all around person in the office and executive assistant (aka EA) I'm experiencing these things first hand every day all day long, and sometimes well into the night. It could be argued that my experience is unusual in that Dave is crazy when it comes to fitting every possible moment in and an overachiever when it comes to taking meetings. I would reply this experience gives me even more insight. However, we won't limit this discussion to just this particular working experience, nor just my own. (Yes, EA's talk to each other!)\n\nAs a startup looking to obtain funding you are going to encounter a lot of dragons at the gate. Their job is to make sure their executive gets to meetings on time (to the best of their ability) and meets with everyone they want or need to. They have immense control over this. The exec may not even be aware of the details, offerings, exchanges or any of the process. They just know that meetings, events, reminders or whatever they need is in their calendar and ready to go for them.\n\nHere are some common mistakes:\n\nCircumventing the EA when you don't get the answer you want and going straight to the source. Especially in this particular field, there are many others vying for time on the calendar. (Remember, you aren't the only startup who needs funding.) This method will in order of likelihood: just get you routed back to the EA, who is now annoyed, ignored by the exec (either accidentally or on purpose), or get you a slot, but perhaps not as good a one and possibly a not so flattering closer look.\n\nSometimes this one is accompanied by a complaint about the EA being difficult. Do you really think the executive isn't going to ask his or her EA about this? Now, you've not only made yourself look like an ass but you've managed to make the EA and possibly the exec unhappy.\n\nThese methods take up valuable time for the EA but MOST IMPORTANTLY valuable time of the exec with whom you wish to meet. There's a reason he hired someone to arrange his meetings. It should be obvious but it's because he or she doesn't have time (and possibly the desire) TO DO IT HIS/HERSELF!\n\nLet's recap... the person you want to give you money hires someone to manage his schedule. Initially you contact this person and because they aren't giving you the slot you want you then contact the ultra busy person you want to give you money. That's kind of like saying... \"I don't really believe you need to have this person managing your schedule.\" (Thereby questioning the exec’s judgment.) Or \"I'm too special to have to go the route everyone else, including billionaires who want to give you money, has to take.\"\n\nProbably not the best method.\n\nIt's not quite as common as circumventing but is much more common than people realize: being a jerk. Trust me on this, if you are an asshole to the EA it's going to be noticed. Did you know that EAs often make notes for their execs regarding the upcoming meetings?\n\nIt may sound unbelievable but one potential startup was not only a jerk to the EA but a high ranking member of the staff. Do you think he got funded?\n\nIf you said, yes... Yeah, you're *that* guy.  No, he didn't. Someone like that is going to be lucky to get a meeting at all. That particular guy did get a meeting but no one took him seriously. Unless you want one of the notes about your meeting to be how rude and pushy you are (or if you work at 500 Startups, perhaps less savory words)... have some common courtesy and be polite.\n\nPoliteness will go a long way. It will go a long way with anyone actually. There are some other tips you can use to have the EA greet you genuinely, say nice things about you and not use their powers of discouragement on you. ;)\n\nDon't exaggerate.\n\nThat's not to say you can't talk up your product but you need to be able to back up what you say. Telling them you have a million users when really you have your mom and her bridge circle and the local Girl Scout troop... makes you look silly and hurts your credibility. It could be that you foresee a potential million users at X time. If that’s the case, say so. In that same vein, don't assume/state that because your product appeals to a segment of a population that it will appeal to all in that demographic.\n\nRemember that cliché? If it sounds too good to be true... You don't want that applied to you, especially when it comes to the person who is deciding if/when to put you on the calendar. Be positive but realistic.\n\nPersistence is good. Being overly persistent in the mistaken belief you are just being persistent is bad. It's also annoying. (Remember, annoying the EA is bad.) I've had people follow up with me in under 5 minutes when they didn't get a response. (Not an exaggeration.) We're all busy but don't assume that because the response isn't instantaneous it isn't coming.\n\nThis should be obvious but don't lie. You're likely to get caught. Don't tell the EA you already chatted with the exec and they cleared the meeting. Bare truth? Just because you caught the exec in the bathroom at The Rosewood and he said, “Yeah, contact my assistant.” doesn’t mean he/she actually wants to meet with you. It means he/she wanted to use the facilities in peace and not be pitched over the fancy soaps. Have some boundaries. Really consider what you’re doing before you approach or try to pitch someone at social events, on the street, in a restaurant wherever other than at a meeting.\n\nDon't just drop by the office and say the exec said to stop by to see him/her; unless it's true. If it's true, then most likely the EA will know about it and you're in the clear. (It may also be a case of the above.) Don’t just stop by without an invite either.\n\nDon't name drop hoping to intimidate the EA into giving you what you want. (Actually I wouldn't recommend name dropping in general but our focus here is on getting meetings.) He/she doesn't care. Chances are if you know the exec’s best hang out at conferences buddy, the intro will be made by them. (And if you mention a “mutual friend” you lose credibility when the friend doesn’t know who you are.)\n\nUsing lots of buzz words/nonsense phrases trying to sound important is also a bad sign to an EA. If what you're pitching sounds like a bunch of jargon gobbledygook that doesn't make sense then it's not going to seem like you know what the hell you're talking about and you're going to be deemed lower priority. Saying this drivel with a confident air also doesn’t do any work, except make others admire your ability to be confident while saying nothing.\n\n<em>Check out <a href=\"http://500.co/2011/08/03/why-youre-not-getting-a-meeting-part-ii/\">Part II</a> where Melissa explains what you should be doing to increase your chances of getting a meeting.</em>\n\n</div>",
    "type": "post",
    "path": "/2011/08/02/why-youre-not-getting-a-meeting-part-i/"
}