{
    "title": "Why Startups Should Care about Building Community",
    "slug": "why-startups-should-care-about-building-community",
    "date": "2014-01-13T22:05:40.000Z",
    "url": "http://500.co/?p=1116731073",
    "uri": "http://500.co/2014/01/13/why-startups-should-care-about-building-community/",
    "postId": "1116731073",
    "description": "",
    "images": [],
    "creator": "",
    "categories": [
        "family"
    ],
    "content": "<em><strong>The following guest post was written by <a href=\"http://twitter.com/davidspinks\" target=\"_blank\">David Spinks</a>, CEO and co-founder of <a href=\"http://letsfeast.com\" target=\"_blank\">Feast</a>. Attend <a href=\"http://http://cmxsummit.com\">CMX Summit</a> on Feb 6th in San Francisco to learn how to build thriving communities with talks from <em><strong>500 Startups, </strong></em>Apple, Airbnb, Behavioral/Community Psychologists and more.</strong></em>\n\nI know, it's a bold request to ask a startup to focus on anything other than their product and growth.\n\nI know, I'm a startup founder myself.\n\nI know that time is our most limited resource and that you have to say no to a lot of things in order to maintain your focus, and sanity.\n\nSo why am I writing a post telling you to focus on community? Because I've seen first hand, and in the example of many other startups, the power that community can wield even at the earliest stages of your growth.\n\nLyft, Airbnb, Eventbrite, Lift, Foursquare, Soundcloud, Skillshare, Udemy, Github, Binpress, Yammer, Hootsuite, Buffer...I could rattle off startups all day who have invested a great deal of time and resources into building community. Social products, b2b, b2c, technical products, toys, fitness, non profits... name the kind of company and I can name several companies building a strong community around their brand and products.\n\nWhy is that? With all the things a startup has to figure out, why do they focus on community?\n<h2>Create highly engaged evangelists</h2>\nThe simplest and most valuable thing you'll get from a community is highly engaged customers or users.\n\nWhen done right, your community creates a sense of belonging. Members feel like they're part of something important and they're proud, they feel special. Their experience with your brand then becomes so much more than just products and features. They develop strong emotions around your brand. They build relationships with other members.\n\nMy mentor Aki Sano once said something along the lines of \"You'll know you have a great business when you can find just one person who's absolutely in love with your product\".\n\nI've seen first hand how building a strong community can create an environment where your members do in fact fall in love with your brand.\n\nThis high engagement leads to the rest of the benefits...\n<h1>Stay close to your customers</h1>\nPerhaps the most important value is that you get to stay very close to your customers.\n\nYour community = your customers.\n\nBy creating a community where your users/customers can interact, converse, share and help each other, it gives you an opportunity to be a fly on the wall and learn more about who they are.\n\nThere are things you'll learn from watching them talk to each other that you'll never see in a survey.\n\nAnd when you have a highly engaged community, you have a pool of customers that you can call on individually to give feedback, test features, hop on a call or whatever else you need to do to learn more about their experience.\n<h1>Support network for reviews and rebuttals</h1>\nFor many companies, getting good reviews early on can make your product. Your community will jump at the opportunity to support you and show you some love.\n\nThey'll also be a great resource for testimonials. When we needed some more customer quotes for <a href=\"http://letsfeast.com\">our homepage</a>, it was as simple as posting in the community and asking for volunteers.\n\nAt the same time, there's a good chance if you're building up some steam that there will be trolls out there to pull you down. Your community can be the people who stand up to defend you and call out their bullshit.\n<h1>Build the foundation for a movement</h1>\nA community comes in many forms. It's greatest form, some might say, is a movement.\n\nYou're an entrepreneur, which probably means you've set your sights on a real big vision. You're not looking to just make a quick buck. You're in it to change the world.\n\nWell, community is what can help you get there. All of the massive companies you know today started with a small, loyal community. That first community serves as the foundation for growth for years to come. Look at Facebook, Instagram, Ebay, Pinterest, Craigslist, Couchsurfing, Meetup, Yelp... I can go on. They all started with a small, loyal community that developed into a larger movement.\n<h1>Improve your customers' experience</h1>\nHumans need community. It's helped us evolve and survive since the beginning of our time. It touches on a basic human need.\n\nSo when we have the chance to become part of a community and feel that sense of belonging, we're happy. That means that community can serve as an added bonus for your product. Not only do your customers get access to your features, they get access to a support group, a network of peers.\n\nMost products become better when people don't feel like they're alone in the game.\n<h1>Defensibility</h1>\nAnyone might be able to copy your product, your brand, your design and even your voice. But there's one thing no other company will ever be able to copy and that's your community.\n\nThere's no faking community. A true community is built on relationships that can only be formed through genuine interactions and a dynamic of trust and respect. This dynamic can take a long time to develop.\n\nYour community members are loyal, and they've invested time into building a reputation amongst the group of peers that you've brought together. It will take a lot for another company to take that away from you.\n<h1>Make more money</h1>\nIn the end, it's just a good business strategy. Your community members, being more loyal and engaged, are more likely to come back and buy again.\n\nMake people happy. That's what it's all about. If you can do that, with your product and potentially with a community, you're on your way.\n\n--\n\nNow I'm not saying every startup should blindly jump into building a community now. It's important to understand why you need a community. It's important to tie it back to your goals and make sure it's in line with everything else you're working on.\n\nSo take a look at what it is you're really hoping to accomplish and then think about how a community might be able to help you achieve those goals.\n\n<strong>Not sure where to get started?</strong>\n\nIf you want to become more efficient at building community, and understand how community dynamics work, come join us at <a href=\"http://cmxsummit.com\">CMX Summit</a> on Feb 6th in San Francisco.\n\nWe're bringing together some of the world's leading minds with completely unique perspectives on how to build communities. Or if you're looking to hire a community manager, you're guaranteed to meet the industry's best at CMX.",
    "type": "post",
    "path": "/2014/01/13/why-startups-should-care-about-building-community/",
    "backgroundImage": "/backup/community-960x540-2014-01-13-14-16-05.jpg"
}