{
    "title": "Why Working So Hard Might Be Doing Your Startup More Harm Than Good",
    "slug": "why-working-so-hard-might-be-doing-your-startup-more-harm-than-good",
    "date": "2011-06-17T00:38:31.000Z",
    "url": "http://blog.500startups.com/?p=1116715474",
    "uri": "http://500.co/2011/06/16/why-working-so-hard-might-be-doing-your-startup-more-harm-than-good/",
    "postId": "1116715474",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/06/flier2.png",
        "http://500.co/wp-content/uploads/2011/06/Picture-521.png"
    ],
    "creator": "",
    "categories": [
        "brendan-mulligan",
        "bret-terrill",
        "danielle-morrill",
        "dojo",
        "dr-neha-sangwan",
        "enrique-allen",
        "events",
        "gopi-kallayil",
        "health",
        "healthy-startup",
        "jared-goralnick",
        "jordy-mont-reynaud",
        "maria-camino",
        "missy-krasner",
        "ron-gutman",
        "scott-hublou",
        "wellness"
    ],
    "content": "It's no secret that s<a href=\"/backup/flier2-2011-06-16-11-19-38.png\"><img class=\"size-full wp-image-1116715487 alignright\" title=\"healthy startup\" src=\"/backup/flier2-2011-06-16-11-19-38.png\" alt=\"\" width=\"379\" height=\"96\" /></a>tartups are unhealthy places to work. At 500 Startups we have observed all kinds of masochistic behaviors by founders and team members while they try to get their companies off the ground. Common pitfalls include: founder’s syndrome, daily fry, living in the dungeon, lack of sleep and exercise, anxiety over funding and burn rate.  Inspired by recent posts by our very own Lion-O aka SuperMentor Brenden Mulligan like <a href=\"http://500.co/2011/01/06/pizza-and-ramen-are-hurting-your-startup/\" target=\"_blank\">Pizza and Ramen are Hurting your Startup</a> and <a href=\"http://500.co/2011/06/14/celebrate-the-small-victories-2/\" target=\"_blank\">Celebrate the Small Victories</a> as well as by feedback from our previous and current batches of startups, we hosting an event to help address these issues.\n\nOn <strong>Saturday June 25th from 1-6pm</strong>, we will host a half-day workshop called, <em><strong>“<a title=\"Design a Healthy Startup: Prevent Burn Out\" href=\"https://www.mogotix.com/events/1662\">Design a Healthy Startup: Prevent Burnout</a>.” </strong></em>Attendees and our very own resident startups will learn practical and actionable tips to avoid burn out from other successful entrepreneurs who have been through the trenches. Learn more about the event and reserve your spot <a href=\"https://mogotix.com/events/1662\">HERE</a>.\n\n<a title=\"Design a Healthy Startup: Prevent Burn Out\" href=\"https://www.mogotix.com/events/1662\"><img class=\"alignnone size-full wp-image-1116715517\" title=\"Reserve your spot\" src=\"/backup/Picture-521-2011-06-16-11-19-38.png\" alt=\"\" width=\"612\" height=\"131\" /></a>\n\n*10 discounts for the first 10 people to use code, '500blog'*\n\nSome of the day’s speakers include: Gopi Kallayil, Group Product Marketing Manager at Google, Bret Terrill, former Senior Director of Corporate Development at  <a href=\"http://www.zynga.com/\" target=\"_blank\">Zynga</a>, Danielle Morrill, Marketing Director at <a href=\"http://www.twilio.com\" target=\"_blank\">Twilio</a>, Scott Hublou, serial startup founder and SVP/ Co-founder of <a href=\"http://www.ecofactor.com\" target=\"_blank\">EcoFactor</a>, Ron Gutman, 2 time startup founder and CEO/Founder at <a href=\"http://www.healthtap.com\" target=\"_blank\">Healthtap</a>, Dr. Neha Sangwan, Wellness Expert, Libby Weathers, founder of <a href=\"http://www.spiritwell.com\" target=\"_blank\">SpiritWell</a>, Maria Molfino from <a title=\"yesplus\" href=\"http://us.yesplus.org/\">yesplus</a> and Jared Goralnick, founder of <a title=\"AwayFind\" href=\"http://awayfind.com\" target=\"_blank\">AwayFind</a>, the productivity expert behind <a title=\"TechnoTheory\" href=\"http://www.technotheory.com/\" target=\"_blank\">TechnoTheory</a>. Check out the full list of speakers <a title=\"Design a Healthy Startup: Prevent Burn Out\" href=\"https://www.mogotix.com/events/1662\" target=\"_blank\">here</a>.   We will talk about intuitive management techniques, how to build creative, fun, and productive workplace cultures and also experience how to do meditation and yoga in the cube.  Demos from cool new startups in the wellness space like <a href=\"http://dojo.com/\" target=\"_blank\">Dojo</a>, <a title=\"HabitLabs\" href=\"http://habitlabs.com/\">Habit Labs</a>, and <a title=\"FitSquid\" href=\"http://www.fitsquid.com/\">FitSquid</a>, will also be presenting the future of health tech behavior.\n\nSometimes we need to take an afternoon to remind ourselves that success has more to do with how well a great idea is executed. Building the next cool thing is important but startups also have to pay attention to how  teams are assembled, managed, and how and where people work.  Even at 500 Startups where teams enjoy many perks, it is hard to maintain a culture of wellness. People still end up eating junk food and pizza and pulling all-nighters. But what happens when the code breaks - or when we have to present non-existent product to an investor - or when the team starts falling apart? New businesses will inevitably have ups and downs but for the long term health of our startups, let’s stop for a minute and learn how to give our bodies and teams the attention they deserve. Learning to stay healthy in a startup environment is just as important as reaching a product milestone, because you can’t have one without the other (at least in a sustainable way). Come join us for an afternoon of actionable techniques and expert advice from founders who have lessons to share.  Make your startup the healthiest it can be!",
    "type": "post",
    "path": "/2011/06/16/why-working-so-hard-might-be-doing-your-startup-more-harm-than-good/"
}