{
    "title": "WIN Wednesdays: Courtney Powell ",
    "slug": "win-wednesdays-courtney-powell",
    "date": "2012-08-09T01:42:30.000Z",
    "url": "http://500.co/?p=1116721789",
    "uri": "http://500.co/2012/08/08/win-wednesdays-courtney-powell/",
    "postId": "1116721789",
    "description": "",
    "images": [
        "http://blog.publikdemand.com/assets/family.png"
    ],
    "creator": "",
    "categories": [
        "startups",
        "win-wednesdays"
    ],
    "content": "<div>\n<div><em>This week's WIN Wednesday woman is Courtney Powell. Courtney's passion for helping dissatisfied consumers led her to become the CEO and co-founder of <a title=\"http://www.publikdemand.com/\" href=\"http://www.publikdemand.com/\">PublikDemand</a>. PublikDemand is a platform that helps unhappy customers use their collective voice to file complaints against big businesses.  They are part of 500 Startups' 4th accelerator batch. Previously, she founded the automated marketing firm <a title=\"http://leedseed.com/\" href=\"http://leedseed.com/\">LeedSeed.com</a>. Follow PublikDemand on <a title=\"http://www.facebook.com/PublikDemand\" href=\"http://www.facebook.com/PublikDemand\">Facebook</a> and <a title=\"http://twitter.com/PublikDemand\" href=\"http://twitter.com/PublikDemand\">Twitter</a> and follow Courtney on Twitter <a title=\"http://twitter.com/CourtneyPowell\" href=\"http://twitter.com/CourtneyPowell\">here</a>.</em></div>\n<div></div>\n<div></div>\n&nbsp;\n<div><strong>How did you become an entrepreneur?\n</strong></div>\nI read <em>Rich Dad, Poor Dad </em>when I was 18. My family had a background in government and non-profit work so I had never been explicitly exposed to the idea of entrepreneurship until I read Kiyosaki’s book.It forced me to reevaluate my understanding of time spent working for someone else versus owning your own time.\n\nA few weeks later I came across a Craigslist ad from two entrepreneurs looking for marketing help. I called the number and they asked me to come in for an interview 30 minutes later. I was nervous but their story sounded interesting. I showed up with work samples from my time on the high school newspaper.\n\nI was green to say the least, but they were pre-funding and assumed that my willingness to show up 30 minutes after we first spoke was a good indicator of startup scrappiness. The company, Boundless Network, grew to over $50M in annual sales during my five-year tenure. After seeing the evolution of a company from an idea to become a major industry player, I knew that I wanted to build my own entrepreneurial dream.\n\n&nbsp;\n<div><strong>What was one of the biggest challenges you’ve had so far with PublikDemand?\n</strong></div>\nPrioritization. As a founder, you wear a million different hats. Especially during fundraising, I struggled with the desire to wholly devote myself to fundraising while I really wanted to just work on the product. Everyday you are forced to decide where to devote your energy and if you don’t have a single goal driving the evolution of your product or company, it’s very easy to go down the wrong path.\n\n&nbsp;\n<div><strong>If you can give one word of advice to future founders, what would it be?\n</strong></div>\nThink bigger. At every step along the way- moving from idea to team, MVP to funding and so on- I found the challenges were never technical in nature, but rather always an indicator of the fact we needed to expand our thinking in some way. I think it is critical to learn to overcome the fear of failure, or any hesitation in stepping out of your comfort zone as early as possible. For me personally, success is nearly 100% determined by my state of mind.\n\n&nbsp;\n<div><strong>Do you have any advice for women considering a career in tech?\n</strong></div>\nI don’t think of myself as a woman in tech. I think of myself as someone who wanted to solve problems for consumers. I don’t know if my gender matters to others or not, but I frankly don’t care. If someone you are talking to slights you in someway because your are a female, then you are talking to the wrong person.\n\n&nbsp;\n<div><strong>Do you have any interest in becoming an angel investor in the future?\n</strong></div>\nAbsolutely. There are several startups in the current 500 Startups batch that I would write a check to today if my resources weren’t already committed to PublikDemand. Sqoot, TenderTree, TwitMusic, Chalkable just to name a few. I would also fund Refer.ly if given the opportunity.\n\n&nbsp;\n<div><strong>What skills did you develop that you found extremely valuable to have as an entrepreneur?\n</strong></div>\nI have learned to focus on my strengths and outsource my weaknesses or activities that are not profitable in some way. I don’t do laundry; I rarely go to the grocery story. Time is far more valuable than money. Although it sounds practical, many people seem to find it a bit radical. However, it has helped me to focus on building what I love.\n\n</div>\n<blockquote>&nbsp;\n\n[caption id=\"\" align=\"aligncenter\" width=\"498\"]<a href=\"http://www.publikdemand.com/\"><img class=\"  \" title=\"publik demand\" src=\"/backup/family-2012-08-08-12-20-42.png\" alt=\"\" width=\"498\" height=\"356\" /></a> Courtney with her team, Richard, A.T., &amp; Jim, of PublikDemand[/caption]</blockquote>",
    "type": "post",
    "path": "/2012/08/08/win-wednesdays-courtney-powell/"
}