{
    "title": "WIN Wednesdays: Christina A. Brodbeck",
    "slug": "win-wednesdays-christina-a-brodbeck",
    "date": "2012-09-27T04:21:06.000Z",
    "url": "http://500.co/?p=1116723310",
    "uri": "http://500.co/2012/09/26/win-wednesdays-christina-a-brodbeck/",
    "postId": "1116723310",
    "description": "",
    "images": [
        "https://twimg0-a.akamaihd.net/profile_images/1940356902/headshot2.png"
    ],
    "creator": "",
    "categories": [
        "mentors",
        "win-wednesdays"
    ],
    "content": "This week WIN Wednesdays woman is Christina A. Brodbeck. Christina is the co-founder of <a title=\"http://theicebreak.com/\" href=\"http://theicebreak.com/\">theicebreak</a>, an app for couples to make the most out of their relationships. Prior to <a title=\"http://theicebreak.com/\" href=\"http://theicebreak.com/\">theicebreak</a>, Christina was a founding team member at YouTube and the company’s first UI Designer. She later went on to lead UI for YouTube Mobile. She is an active angel investor and mentor at various places like 500 Startups and The Designer Fund. Follow <a title=\"https://twitter.com/jellyfishbloom\" href=\"https://twitter.com/jellyfishbloom\">Christina</a> and <a title=\"https://twitter.com/theicebreak\" href=\"https://twitter.com/theicebreak\">theicebreak</a> on Twitter.\n\n&nbsp;\n\n<img class=\"alignnone\" title=\"Christina\" src=\"/backup/headshot2-2012-09-26-12-23-21.png\" alt=\"\" width=\"270\" height=\"334\" />\n\n&nbsp;\n\n<strong>Why do you think there aren't more women angels/investors?</strong>\n<strong>What do you think can be done to change that?</strong>\n\nWomen need to take it upon themselves to become more comfortable\nwith risk. Investing is a risky business, and there are no guarantees you’ll\nmake a profit or even get your money back. Women need to become\nmore comfortable with the instability of seed stage investing. I’ve spoken\nwith a lot of women who are more at ease playing traditional markets\nor participating in institutional investment opportunities (e.g. – series A\nand B) where there is less risk; they are, however, intimidated by angel\ninvesting. I’ve had many interactions with fellow female investors where\nthey try to treat angel deals like institutional deals, and expect the founders\nto have five year detailed financial projections. This is unrealistic; if you\nare investing in an angel deal, their financial projections, and most likely\ntheir entire company idea will change a number of times. Women need to\nbecome comfortable with this risk.\n\nWe also need to create more women with wealth in the tech sector. To do\nthis, we need to get women into start-up companies at very early stages,\neither as founders or as early employees, so they can get enough equity to\nmake money to invest. Traditionally early employees are technical, and so\n\nwe need to get more women into science, technology, and design so that\nthey can fill those roles. In addition, we need more startups and investors\nto recognize the value of non-technical roles early on. A great business or\nmarketing person can make just as good a founder as a great engineer.\n\n&nbsp;\n\n<strong>What was one of the most helpful pieces of advice you</strong>\n<strong>received during your career?</strong>\n\nThe best advice I received was that as an entrepreneur, you are both a\nperson and a company. You are the face of both and you need to be\nconfident and be able to sell yourself if you’re going to have any hope of\nselling your vision.\n\n&nbsp;\n\n<strong>What was one of the biggest mistakes you’ve made during</strong>\n<strong>your career? What did you learn from it?</strong>\n\nGrowing up, I mistakenly thought that your career is where you make\nmoney, and your hobbies are where you have fun. Society tends to\nencourage this mentality, teaching children that the only way to be\nsuccessful is to become a doctor, lawyer, or engineer. It took me a bit\nlonger than it should have to recognize that my hobby of designing Web\nsites, something I desperately loved, could also be my career. I was a\nhistory and pre-law major in college. When I made the decision to not apply\nto law school and instead pursue design, it was a real turning point. Now\nI’m able to do what I love every day and profit from it too!\n<strong></strong>\n\n&nbsp;\n\n<strong>As a kid, what did you want to be when you grew up?</strong>\n\nI wanted to be a politician or in the CIA. As a teenager, instead of music\nposters, my bedroom door was plastered with magazine cutouts of Franklin\nDelano Roosevelt, Hillary Clinton, and Bill Clinton. I was actually kind\nof obsessed with FDR, and admired his ability to come up with creative\nsolutions to complicated problems.\n\n&nbsp;\n\n<strong>How did you become an entrepreneur and angel investor?</strong>\n\nI don’t think it was one particular event that led me to become an\nentrepreneur and an angel investor. I was always attracted to new and\nexciting things and to helping others do the same.\n\nAs a kid family stories of my great-grandfather’s life had a huge impact on\nme. I was in awe of his courage, his capacity to take huge risks, and his\ndesire to go on personal adventures. Despite the equivalent of a fifth grade\neducation and failed attempts at starting various companies (like a lumber\ncompany), he eventually succeeded by founding a brass works foundry and\nfaucet company that later sold to American Standard.<strong></strong>\n\nAs far back as I can remember I was always coming up with new business\nideas and schemes, and trying them out. For example, in college I was\nworking on starting a t-shirt design business. In high school I designed bags\nfor my grandmother to sew. When I was in elementary school, my friend and I\nwould regularly charge the neighborhood kids and parents to attend our talent\nshows.\n\nThe real risk and a-ha moment, however, happened when I chose to move\nout to California from Illinois without a job in sight to pursue my “hobby” of\ndesigning web sites. I’ll never forget my dad saying at the airport “good luck\nlittle pioneer.”\n\n&nbsp;\n\n<strong>Do you have any advice for those interested in becoming</strong>\n<strong>angel investors?</strong>\n\nStop thinking about it, and just go out and do it already!\n\n&nbsp;",
    "type": "post",
    "path": "/2012/09/26/win-wednesdays-christina-a-brodbeck/"
}