{
    "title": "WIN Wednesday: Leah Busque",
    "slug": "win-wednesday-leah-busque",
    "date": "2012-08-16T02:22:02.000Z",
    "url": "http://500.co/?p=1116721937",
    "uri": "http://500.co/2012/08/15/win-wednesday-leah-busque/",
    "postId": "1116721937",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2012/08/Leah_Headshot_New.jpg"
    ],
    "creator": "",
    "categories": [
        "startups",
        "venture-capital",
        "win-wednesdays"
    ],
    "content": "<div>\n<div>\n<div><i>Sometimes at 500 Startups, we'd wish to ourselves that there was a startup out there we can use to find reliable people to help us with tasks and errands. Oh wait! There is! It's called <a title=\"http://www.taskrabbit.com/\" href=\"http://www.taskrabbit.com/\">TaskRabbit</a> and we're an investor! We're a big fan of TaskRabbit and the company's founder, <a title=\"https://twitter.com/labusque\" href=\"https://twitter.com/labusque\">Leah Busque</a>, that's why Leah is today's WIN Wednesday Woman.</i></div>\n<div></div>\n<div><i>Leah graduated Sweet Briar College with a B.S. in Math and Computer Science. She worked as a software engineer at IBM for a long time before co-founding Linkedup LLC. In true entrepreneurship spirit, Leah soon realized another brilliant startup idea and started TaskRabbit.  She is also an angel investor and is one of the many awesome women who have accepted the<a title=\"http://500.co/challenge/women-angels/\" href=\"http://500.co/challenge/women-angels/\"> WIN Challenge</a>.</i></div>\n<div></div>\n&nbsp;\n\n[caption id=\"attachment_1116722289\" align=\"aligncenter\" width=\"288\"]<a href=\"http://500.co/2012/08/15/win-wednesday-leah-busque/leah_headshot_new/\" rel=\"attachment wp-att-1116722289\"><img class=\"wp-image-1116722289 \" title=\"Leah_Headshot_New\" src=\"/backup/Leah_Headshot_New-2012-08-15-12-21-22.jpg\" alt=\"\" width=\"288\" height=\"432\" /></a> Leah Busque, Founder and CEO of TaskRabbit[/caption]\n\n&nbsp;\n<div><strong>How did you become an entrepreneur?</strong></div>\n<div>My entrepreneurial days go all the way back to when I was 11 years old and started an environmental non-profit called Pollution Solutions. Even at such a young age, the entrepreneurial bug got me. After graduating from college, I accepted a job as a programmer at IBM. After working there for about 7 years, one night in February of 2008, my husband and I were waiting for a cab to pick us up to go out to dinner when we realized we were out of dog food. We had a 100-pound yellow lab, named Kobe, that never missed a meal. We thought to ourselves, wouldn't it be nice if there was a place online we could go, say we needed dog food, and name the price we were willing to pay. We were certain there was someone in our neighborhood who would be willing to help us out. This led to the idea of TaskRabbit. Four months later, I quit my job at IBM and started down the path that brought me here today.</div>\n&nbsp;\n<div><strong>If you can give one word of advice to future founders, what would it be?</strong></div>\n</div>\n<div>Surround yourself with powerful and engaging mentors and advisers who understand and believe in your idea.</div>\n&nbsp;\n<div><strong>Do you have any advice for women considering a career in tech?</strong></div>\n</div>\n<div>Mentors and advisers are incredibly powerful and helpful - surround yourself with them, and it doesn't matter if they are male or female. I get asked about how I feel being a woman in the tech all the time and my answer has always been the same: it's a non-issue. I'm building a business - that's what I keep at the front of my mind at all times.</div>\n&nbsp;\n<div>\n<div>\n<div>\n<div>\n<div><strong>What was one of the most helpful pieces of advice you received as a founder?</strong></div>\n</div>\n<div>Very early on in the life of TaskRabbit, I met with Scott Griffith, the CEO of ZipCar. After hearing about my idea, he told me he thought I was onto something, and to \"see how far I could take it.\" Scott is still an adviser, and not a day goes by that I don't think about that piece of advice he gave me.</div>\n&nbsp;\n<div><strong>\n</strong></div>\n<div><strong>As a kid, what did you want to be when you grew up? </strong></div>\n</div>\n</div>\n<div>An astronaut!</div>\n&nbsp;\n<div><strong>Why did you decide to become an angel investor?</strong></div>\n<div>I remember what it was like when I first started TaskRabbit - spending all day, every day, working out of the 2nd bedroom of my house, building my company from the ground up and watching my own cash supply dwindle. I had just quit my comfy job to focus on TaskRabbit full time...it was nerve wracking; every extra cent spent mattered. I am thrilled to be able to support aspiring entrepreneurs early on to help them along in their journey. I couldn't have done it without my angel investors and I am proud to pay it forward.</div>\n</div>\n&nbsp;",
    "type": "post",
    "path": "/2012/08/15/win-wednesday-leah-busque/"
}