{
    "title": "World Startup Report: 16 Countries and Counting",
    "slug": "world-startup-report-16-countries-and-counting",
    "date": "2013-07-10T16:18:46.000Z",
    "url": "http://500.co/?p=1116728319",
    "uri": "http://500.co/2013/07/10/world-startup-report-16-countries-and-counting/",
    "postId": "1116728319",
    "description": "",
    "images": [
        "http://wsr.wpengine.com/wp-content/uploads/2013/07/GOAB.png"
    ],
    "creator": "",
    "categories": [
        "argentina",
        "australia-2",
        "brasil",
        "chile",
        "colombia",
        "ethiopia",
        "greece",
        "guest-posts",
        "india-2",
        "israel",
        "kenya",
        "myanmar",
        "nepal",
        "peru",
        "philippines",
        "spain",
        "startups",
        "thailand",
        "world-startup-report"
    ],
    "content": "<em>The following post was contributed by <a href=\"http://twitter.com/Bowei\" target=\"_blank\">Bowei Gai</a>, founder of <a href=\"http://worldstartupreport.com/\" target=\"_blank\">World Startup Report.</a> Bowei is an entrepreneur who founded CardMunch (A 500 Startups company) and sold it to LinkedIn in 2011. On New Year's Eve of 2013, he boarded his first flight for a 9-month long trip across 29 countries and 36 cities to research the world's startup ecosystems. He traveled to India, Australia, Colombia, Peru, Chile, Brazil, Philippines, Myanmar, Thailand, Nepal, Ethiopia, Kenya, Israel, Greece and Spain. Below is his story.</em>\n\nA million thanks to the World Startup Report team, sponsors, and volunteers around the world for making this trip a reality. It’s been an amazing 6 months. Here’s a recap of what I’ve learned on the road:\n\nTime flies when you’re off <a href=\"http://www.google.com/url?q=http%3A%2F%2Fwww.worldstartupreport.com&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNHJ22x8FpxHIh8pf_lHydxEbC6ZiQ\">exploring startups in far flung lands</a>. Six months ago I set off with just a carry-on and my trusty laptop, bright eyed and armed with boundless enthusiasm – I was ready with a capital R, to explore the world of startups. Now six months have passed and amazingly, I’ve realized that the more I learn, the more there is I need to learn. 6 months, 16 countries and 1000s of startup conversations later, I have only scratched the tip of the iceberg. The people I’ve met and the passion they have for what they do, often times in the face of great adversity is equal parts motivating and humbling. Its been a whirlwind journey so far and I am beyond excited to be able to share these findings. So on that note, here’s a little mini recap of my trip to date. Stay tuned for the full startup reports!\n\n<strong>What in the world did I find?</strong>\n\n<strong>India</strong>: hello, Google? Running a search engine via telephone may sound funny to the Valley, but really is it that different from asking Siri where the nearest parking lot is? Now picture Siri as a live person and put yourself in a country with 895M mobile phones vs just 35M smartphones. JustDial is a $720M empire in India…and it’s just one of many catering to this unique market.\n\n<strong>Nepal</strong>: Don’t discount this hidden gem – even in a country where there are rations of only 12 – 16 hours of electricity per day, you can build tech firms with $100M USD exits.\n\n<strong>Australia</strong>: Being a small yet modern and accessible country can be a double edged sword. On one hand, you get access to the latest and greatest from the West, but on the other hand, this very same lack of entrance barriers eliminates many startup opportunities for locals hoping to break onto the scene. Expect stiff competition here.\n\n<strong>Greece/Spain</strong>: This could be a classic case of turning lemons into lemonade. 50% unemployment rate among youth might turn out to be the fire-starter that Greece/Spain startup ecosystems need.\n\n<strong>Argentina</strong>: The story of Argentina can be told through their currency, which devalued 25% in the last 3 months. These folks are under constant pressure to produce in the midst of impossible constraints – trial by fire style. It could be argued that these conditions have produced the best entrepreneurs in Latin America.\n\n<strong>Brasil</strong>: Size does matter. Virtually all successful Latin companies make the move to Brasil after their initial growing period, despite the unfavorable laws and social instability.\n\n<strong>Peru</strong>: Though one of the least developed countries in South America, it’s also the place with the highest growth. Serious potential here.\n\n<strong>Colombia</strong>: When a country invests 40% of the national budget on education, it changes things and empowers people.\n\n<strong>Chile</strong>: StartupChile might go down in the history books as one of the best things to ever happen to Chile in this decade.\n\n<strong>Kenya</strong>: The future of mobile payment can be seen in Kenya today. M-pesa is a micro-financing and money transfer service all easily accessible from your mobile device. It accounts for 25% of the country’s GDP.\n\n<strong>Ethiopia</strong>: There are two 1s you have to know about Ethiopia: 1% internet penetration rate. 1M new cellphone subscribers a month.\n\n<strong>Philippines</strong>: The Peru of Southeast Asia, but three times bigger with its 100M population plus everyone speaks perfect English. Keep an eye out for it.\n\n<strong>Thailand</strong>: Unbelievable infrastructure and ample access to talents through its tourism. This 70M population country is poised to do well.\n\n<strong>Myanmar</strong>: For a country that’s only a year old, its infrastructure is surprisingly developed. Those who want to jump in for low hanging fruit might already be too late.\n\n<strong>Israel</strong>: Roughly 70% of the startup founders at our meetup believe they can build a billion dollar company. With this much ambition, drive and optimism in the room, some of them could be right.\n\n<strong>So what’s next?</strong>\n\nThere are 13 more countries on the list, equally split between Europe (Netherlands, France, UK, Germany, Ukraine, Russia) and Asia (Korea, Japan, Taiwan, Vietnam, Malaysia, Indonesia, Singapore). Big things are happening for the WSR team, keep following us to access the full country by country World Startup Reports as they become available. If your country is on the list, please let us know if you would like to help! <a href=\"http://bit.ly/helpWSR\">http://bit.ly/helpWSR</a>\n\n<strong>Oh and one more thing… *drum roll*</strong>\n\n<a href=\"http://www.geeksonabeach.com/\"><img alt=\"GOAB\" src=\"/backup/GOAB-2013-07-10-13-11-18.png\" width=\"576\" height=\"240\" /></a>\n<p dir=\"ltr\">We’re proud to announce the WSR closing ceremonies happening in the Philippines at the end of my 29-country tour, called <a href=\"http://www.geeksonabeach.com/\">Geeks-On-A-Beach</a>. Some of our most influential and knowledgeable founders/investors from all over the world will join us at Geeks-On-A-Beach to discuss the global startup trends and opportunities, from Silicon Valley to India. This will also be where I share my overall findings, impressions and conclusions from my epic journey.</p>\n<p dir=\"ltr\">Don’t miss this opportunity to meet the world’s startup founders and investors.  Sign up today and get the early bird discount. This will be an incredible event in partnership to help the local startup community in the Philippines.</p>\n<p dir=\"ltr\"><em>Special thanks to: 500 Startups, Startup Revolution, StartupWeekend, StartupDigest, Brad Feld, Dave McClure, Flightfox, Boingo, Bizpora for making this trip a reality!</em></p>",
    "type": "post",
    "path": "/2013/07/10/world-startup-report-16-countries-and-counting/",
    "backgroundImage": "/backup/worldstartup-2013-07-10-13-11-18.png"
}