{
    "title": "Your Best Friend Is Your Product's Worst Enemy ",
    "slug": "your-best-friend-is-your-products-worst-enemy",
    "date": "2011-02-02T07:38:06.000Z",
    "url": "http://blog.500startups.com/?p=1116714925",
    "uri": "http://500.co/2011/02/02/your-best-friend-is-your-products-worst-enemy/",
    "postId": "1116714925",
    "description": "",
    "images": [
        "http://500.co/wp-content/uploads/2011/02/blake-mug.jpg",
        "http://500.co/wp-content/uploads/2011/02/want-no-want2.jpg"
    ],
    "creator": "",
    "categories": [
        "blake-williams",
        "criticism",
        "data-points",
        "guest-posts",
        "keepsy",
        "opinions",
        "product-feedback",
        "startups"
    ],
    "content": "<a href=\"/backup/blake-mug-2011-02-02-11-01-38.jpg\"><img class=\"alignnone size-full wp-image-1116714927\" title=\"Blake Williams\" src=\"/backup/blake-mug-2011-02-02-11-01-38.jpg\" alt=\"Blake Williams\" width=\"148\" height=\"148\" /></a>\n\n<em>This post was written by <a href=\"http://twitter.com/#!/blakewilliams\">Blake Williams</a>, co-founder and VP Product at <a href=\"http://www.keepsy.com\">Keepsy</a> (a 500 company). Based in Menlo Park, Keepsy lets you crowdsource photo albums with friends. Blake's tour of Silicon Valley includes StoryJumper, Topix, eBay/Paypal, AOL Time-Warner, Apple and one of the greatest dot-com flameouts in history, AllAdvantage.</em>\n\n<strong>The Emperor's New Product</strong>\n\nWhen you're developing at an older, established company, your product has history and inertia to build on. Your strategy is incremental -- building on old successes and (cough) avoiding new projects that have the slightest whiff of failure. You also probably have a big, vocal customer base. You know that you're making new stuff for people that already buy your old stuff.\n\nAt your start-up, all this goes out the window. No history, no inertia, no customers. The moment your prototype is ready, you want feedback from everyone you can muster. And who are you most likely to ask? Your friends. They've been cheering along from the sidelines, investing ramen and rounds of beer along the way to keep you going. Naturally, you're going to want to show off your hard work the moment you have a working demo. How do they respond? \"This is great!\" \"Can't wait to start using it!\" \"We wish we'd thought of this!\" Wow, you're cooking now. What more validation do you need? Ship it for chrissakes!\n\nNot so fast. This is the trap we nearly fell into last July. We had nearly finished the prototype of <a href=\"http://www.keepsy.com\">Keepsy</a> -- our group photo-album site -- and had rave reviews from those close to us. To make matters worse, we also did a round of conventional user-testing with strangers which had great results (or so it seemed). Nearly every user mentioned how fun the product was, and when asked for criticism, offered little, if any. Our path to <a href=\"http://www.startuplessonslearned.com/2008/11/what-is-customer-development.html\">product/market</a> fit was going to be short and sweet. Green light, right?\n\nWe were about a week from shipping when I noticed that an acquaintance had not yet added his page to a test album we were creating for a mutual friend's birthday. I sent him an instant message and asked him about the hold up. He response was, \"some issues with site\". When pressed further, he declined further comment. He felt it was a discussion best done in person. So I invited him to come by the office to chat.\n\nHe arrived the next morning at 9am. What I thought was going to be a quick 30-minute coffee turned into a 7-hour forced march as he methodically began to rip apart each flow, question each design element down to the placement of every pixel, and basically shamed us into believing our product was ever ready to ship. Of course, it wasn't a problem that his feedback was so thoroughly caustic. No, the problem was that we found ourselves agreeing with over 90% of this comments. It was like the child in The Emperor's New Clothes shouting above the din of the crowd, \"Your product sucks!\" and suddenly all of us were standing around very, very naked.\n\nHow could we have been so blind? The simple answer is that we'd been soliciting the feedback we wanted to hear -- the rosy accolades from those we hold dear -- instead of seeking out resistance and conflict. We had resisted the hard cold truth. The next day, we began our redesign. It cost us weeks, but at no point along the way did we hesitate or look back. The path was obvious to us now.\n\n<strong>The Lesson <a href=\"/backup/want-no-want2-2011-02-02-11-01-38.jpg\"><img class=\"alignright size-full wp-image-1116714929\" title=\"want-no-want2\" src=\"/backup/want-no-want2-2011-02-02-11-01-38.jpg\" alt=\"\" width=\"289\" height=\"182\" /></a>\n</strong>\n\nWhile you should listen closely to criticism from friends, you should take most compliments with a grain, nay, large shaker of salt. Take them for what they are: support and validation that you are a friend. The same goes for more conventional, standardized user testing, too. The average person often just doesn't want to hurt your feelings, even when they're repeatedly told they're anonymous and getting paid to do so.\n\nMark Suster says that he ends his more brutal <a href=\"http://www.businessinsider.com/dont-be-a-grin-fker-2010-3\">feedback</a> sessions with, \"My view point is one data point. I might be wrong. Get lots of data points.\" He's right, but I might tweak this slightly as \"get lots of data points with differing opinions.\" Or simply: <strong>Seek out the opinionated jerk.</strong>\n\nEven if you don't agree with everything he or she says, this is where you're going to get the feedback you really need. The opinionated jerk is your product's best friend. If you're in the right, you'll be that much stronger for defending your decisions. If you're in the wrong, it may just save your product from disaster.",
    "type": "post",
    "path": "/2011/02/02/your-best-friend-is-your-products-worst-enemy/"
}